{"id":2162,"company":{"country":"US","currency":"USD","exchange":"NEW YORK STOCK EXCHANGE, INC.","ipo":"1987-08-28","marketCap":533.426513671875,"name":"Central Pacific Financial Corp","phone":"18085440500","outstanding":27.040000915527344,"symbol":"CPF","website":"https://www.cpb.bank/","industry":"Banking"},"price":19.77,"year":2023,"month":12,"day":15,"weekday":"Friday","title":"Ownership Structure of Central Pacific Financial Corp Stock","date":"2023-12-15","url":"/posts/2023/12/15/CPF","content":[{"section":"Institutional Investors","text":"According to the latest available data, Central Pacific Financial Corp has a significant number of institutional investors. As of the most recent filing, institutional ownership stands at 89.67%. This indicates that a large portion of the company's shares are held by institutional investors, such as mutual funds, pension funds, and other large investment firms."},{"section":"Insider Ownership","text":"Insider ownership refers to the percentage of a company's shares held by its executives, directors, and other insiders. For Central Pacific Financial Corp, insider ownership is relatively low. The latest data shows that insiders own approximately 0.62% of the company's outstanding shares. It is important to note that insider ownership can fluctuate over time due to buying or selling of shares by insiders."},{"section":"Major Shareholders","text":"There are several major shareholders of Central Pacific Financial Corp. Some of the largest shareholders include institutional investment firms and mutual funds. The Vanguard Group, BlackRock, and Dimensional Fund Advisors are among the notable institutional shareholders. These major shareholders often have significant influence on the company's decision-making processes and corporate governance."}],"tags":["CrossOver100","Long","Banking"],"news":[{"category":"company","date":1702007940,"headline":"Warning: CPF is at high risk of performing badly","id":124391196,"image":"","symbol":"CPF","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3247575852"},{"category":"company","date":1701885600,"headline":"Local Business Leader Robert Nobriga Named to CPF and CPB Board of Directors","id":124350512,"image":"https://media.zenfs.com/en/business-wire.com/3382321a2a7d9c5ec464e99bce3fcf66","symbol":"CPF","publisher":"Yahoo","summary":"HONOLULU, December 06, 2023--Central Pacific Financial Corp. (NYSE: CPF), parent company of Central Pacific Bank (CPB), today announced the appointment of Robert Nobriga as a member of its board of directors of both CPF and CPB, effective January 1, 2024.","url":"https://finance.yahoo.com/news/local-business-leader-robert-nobriga-180000220.html"},{"category":"company","date":1701867600,"headline":"Central Pacific Financial Corp. Appoints Robert Nobriga as Board of Directors, Effective January 1, 2024","id":124338296,"image":"","symbol":"CPF","publisher":"Finnhub","summary":"Central Pacific Financial Corp. announced the appointment of Robert Nobriga as a member of its board of directors of both CPF and CPB, effective January 1, 2024. Mr. Nobriga is currently President and...","url":"https://finnhub.io/api/news?id=e9833c01f28e94cc6e7d685f6e8891a77c1391c9eff32d273740f431164cd148"}]}