{"id":2163,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2005-02-15","marketCap":976.975,"name":"Preferred Bank","phone":"12138916829.0","outstanding":14.43,"symbol":"PFBC","website":"https://www.preferredbank.com/","industry":"Banking"},"price":73.46875,"year":2023,"month":12,"day":15,"weekday":"Friday","title":"Impact of corporate earnings reports on Preferred Bank stock's price movements","date":"2023-12-15","url":"/posts/2023/12/15/PFBC","content":[{"section":"Q1 2021 Earnings Report","text":"In its Q1 2021 earnings report, Preferred Bank announced net income of $25.3 million, or $1.16 per diluted share, compared to $15.7 million, or $0.74 per diluted share, in the same quarter of the previous year. This represented a significant increase in earnings, exceeding market expectations. As a result, the stock price surged by 10% in the week following the earnings release."},{"section":"Q2 2021 Earnings Report","text":"The Q2 2021 earnings report of Preferred Bank revealed net income of $27.6 million, or $1.32 per diluted share, compared to $17.9 million, or $0.82 per diluted share, in the same quarter of the prior year. This marked another impressive earnings growth, exceeding analyst estimates. Consequently, the stock price experienced a notable 8% increase in the days following the earnings announcement."},{"section":"Q3 2021 Earnings Report","text":"During the Q3 2021 earnings report, Preferred Bank reported net income of $29.1 million, or $1.40 per diluted share, compared to $19.2 million, or $0.89 per diluted share, in the same quarter of the preceding year. Once again, the bank surpassed market expectations, leading to a surge in the stock price. Following the earnings release, the stock price rose by approximately 12%."},{"section":"Factors Influencing Stock Price Movement","text":"The positive impact of Preferred Bank's earnings reports on its stock price can be attributed to various factors. Firstly, the significant increase in net income demonstrates the bank's strong financial performance and growth potential. This encourages investors to reassess the stock's value and adjust their buying decisions accordingly. Additionally, surpassing market expectations builds investor confidence and attracts new shareholders, contributing to the upward movement in the stock price."},{"section":"Conclusion","text":"Corporate earnings reports play a crucial role in influencing the price movements of Preferred Bank stock. The consistent growth in net income, exceeding market expectations, has resulted in significant upward trends in the stock price after each earnings report. It is evident that investors closely monitor and react to the bank's financial performance as reported in the earnings releases."}],"tags":["CrossOver100","Long","Banking"],"news":[{"category":"company","date":1702501260,"headline":"Preferred Bank Announces Increased Cash Dividend","id":124500336,"image":"https://media.zenfs.com/en/globenewswire.com/a9ad743671b29cf774d71cc1b7b02caa","symbol":"PFBC","publisher":"Yahoo","summary":"LOS ANGELES, Dec. 13, 2023 (GLOBE NEWSWIRE) -- Preferred Bank (NASDAQ: PFBC), one of the larger independent commercial banks in California, today reported that the Board of Directors has increased the quarterly cash dividend to $0.70 per share from the previous level of $0.55 per share, an increase of 27.3%. The dividend is payable on January 22, 2024 to holders of record on January 8, 2024. Chairman and CEO Li Yu commented, “We’re extremely pleased to announce this increase in the cash dividend","url":"https://finance.yahoo.com/news/preferred-bank-announces-increased-cash-210100698.html"},{"category":"company","date":1702436580,"headline":"Preferred Bank increases quarterly dividend 27.3% to 70c per share","id":124505370,"image":"","symbol":"PFBC","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3255568214"}]}