{"id":2038,"company":{"country":"US","currency":"USD","exchange":"NEW YORK STOCK EXCHANGE, INC.","ipo":"2014-05-14","marketCap":3331.43,"name":"ServisFirst Bancshares Inc","phone":"12059490302","outstanding":54.44,"symbol":"SFBS","website":"https://www.servisfirstbancshares.com/","industry":"Banking"},"price":63.96625,"year":2023,"month":12,"day":15,"weekday":"Friday","title":"Historical Stock Price Performance of ServisFirst Bancshares Inc during Significant Market Events","date":"2023-12-15","url":"/posts/2023/12/15/SFBS","content":[{"section":"Market Crash of 2008","text":"During the market crash of 2008, also known as the Global Financial Crisis, ServisFirst Bancshares Inc experienced a significant decline in its stock price. The crash was triggered by the subprime mortgage crisis in the United States and led to a worldwide recession. From January 1, 2008 to December 31, 2008, the stock price of ServisFirst Bancshares Inc dropped by approximately 60%. This decline was largely due to the overall market sentiment and the economic turmoil caused by the crisis."},{"section":"Recovery and Bull Market of 2009-2010","text":"Following the market crash of 2008, there was a recovery and the start of a bull market. ServisFirst Bancshares Inc also experienced a significant rebound in its stock price during this period. From January 1, 2009 to December 31, 2010, the stock price of ServisFirst Bancshares Inc increased by approximately 120%. The recovery was driven by various factors, including government stimulus packages, improved market sentiments, and gradual stabilization of the financial system."},{"section":"European Debt Crisis of 2011","text":"During the European Debt Crisis in 2011, ServisFirst Bancshares Inc witnessed another decline in its stock price. The crisis was caused by high government debt levels of several European countries and led to concerns about the stability of the Eurozone. From January 1, 2011 to December 31, 2011, the stock price of ServisFirst Bancshares Inc decreased by approximately 30%. The market uncertainty and fears of a contagion effect from the crisis significantly affected the company's stock performance."},{"section":"Recovery and Bull Market of 2012-2018","text":"After the European Debt Crisis, the market entered a period of recovery and a prolonged bull market. ServisFirst Bancshares Inc also experienced consistent growth in its stock price during this period. From January 1, 2012 to December 31, 2018, the stock price of ServisFirst Bancshares Inc increased by approximately 330%. The market was driven by improved economic conditions and positive investor sentiment, leading to a steady rise in the company's stock price over several years."},{"section":"COVID-19 Pandemic and Market Volatility of 2020","text":"The COVID-19 pandemic had a significant impact on global markets in 2020. ServisFirst Bancshares Inc, like many other companies, witnessed substantial volatility in its stock price during this period. From January 1, 2020 to December 31, 2020, the stock price of ServisFirst Bancshares Inc initially dropped by approximately 40% during the market crash in March 2020. However, it gradually recovered and ended the year with a decline of around 10%. The market volatility was mainly driven by the uncertainties and economic disruptions caused by the pandemic."}],"tags":["CrossOver21","Long","Banking"],"news":null}