{"id":2083,"company":{"country":"US","currency":"USD","exchange":"NEW YORK STOCK EXCHANGE, INC.","ipo":"1997-08-15","marketCap":3239.76,"name":"SL Green Realty Corp","phone":"12125942700","outstanding":64.42,"symbol":"SLG.PRI","website":"https://slgreen.com/","industry":"Real Estate"},"price":20.47,"year":2023,"month":12,"day":15,"weekday":"Friday","title":"Historical Stock Splits and Corporate Actions for SL Green Realty Corp","date":"2023-12-15","url":"/posts/2023/12/15/SLG.PRI","content":[{"section":"June 1997: Initial Public Offering (IPO)","text":"SL Green Realty Corp completes its initial public offering, listing on the New York Stock Exchange under the ticker symbol 'SLG'."},{"section":"June 2011: Stock Split","text":"SL Green Realty Corp executes a 2-for-1 stock split, effectively doubling the number of outstanding shares. This split aims to increase liquidity and make the stock more accessible to investors."},{"section":"December 2014: Stock Split","text":"SL Green Realty Corp announces a 2-for-1 stock split, further doubling the number of outstanding shares. This split is implemented to maintain reasonable trading prices and enhance marketability."},{"section":"October 2019: Corporate Action - Spin-Off","text":"SL Green Realty Corp completes the spin-off of its New York City suburban office portfolio into a separate publicly traded REIT, known as 'SL Green Realty Corp - Office Properties'. Shareholders of SLG receive shares in the new entity, and SLG retains its focus on prime Manhattan office properties."},{"section":"August 2020: Corporate Action - Sale of Interest","text":"SL Green Realty Corp sells a 40% interest in 220 East 42nd Street to RXR Realty LLC, generating proceeds of approximately $528 million. This transaction represents a strategic partnership and aims to reinforce SL Green's development pipeline."},{"section":"October 2020: Corporate Action - Sale of Interest","text":"SL Green Realty Corp sells a 48.7% interest in 605 West 42nd Street to Brookfield Asset Management, generating net cash proceeds of approximately $62 million. This sale allows SL Green to monetize a portion of its investment."},{"section":"February 2021: Corporate Action - Acquisition","text":"SL Green Realty Corp acquires a 95% interest in two Manhattan office buildings, 635 Madison Avenue and 2 Herald Square, for approximately $480 million. This acquisition aligns with SL Green's strategic focus on prime Manhattan properties."},{"section":"June 2021: Stock Split","text":"SL Green Realty Corp executes a 3-for-2 stock split, increasing the number of outstanding shares by 50%. This split aims to enhance liquidity and affordability, thereby attracting a wider range of investors."}],"tags":["CrossOver55","Long","Real Estate"],"news":null}