{"id":1458,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2017-09-20","marketCap":290.196,"name":"Celcuity Inc","phone":"17633920767.0","outstanding":22.09,"symbol":"CELC","website":"https://www.celcuity.com/","industry":"Biotechnology"},"price":14.94,"year":2023,"month":12,"day":8,"weekday":"Friday","title":"Performance Analysis of Celcuity Inc and its Competitors","date":"2023-12-08","url":"/posts/2023/12/08/CELC","content":[{"section":"About Celcuity Inc","text":"Celcuity Inc is a biotechnology company that develops and commercializes CELsignia, a platform designed to advance precision medicine for cancer patients. The company's focus is on identifying new cancer subtypes and commercializing diagnostic tests."},{"section":"Industry Overview","text":"The industry in which Celcuity Inc operates is highly competitive, with several other companies engaged in similar biotechnology research and development. It is an emerging market with potential for growth as precision medicine gains importance in the field of oncology."},{"section":"Stock Performance of Celcuity Inc","text":"Celcuity Inc stock has shown a mixed performance over the past year. It experienced significant volatility, with periods of both growth and decline. The stock price reached its highest point in the first quarter of the year, followed by a decline in the second and third quarters. It has recently shown some signs of recovery."},{"section":"Competitor Comparison","text":"When compared to its competitors within the same industry, the performance of Celcuity Inc stock is comparable in terms of volatility. Other companies in the biotechnology industry have also experienced fluctuations in their stock prices. However, it is important to note that each company operates under different business models and may have different growth prospects."},{"section":"Factors Affecting Performance","text":"The performance of Celcuity Inc stock, as well as its competitors, is influenced by various factors such as clinical trial results, FDA approvals, market demand for precision medicine, and overall market conditions. These factors can have a significant impact on stock prices."},{"section":"Investment Considerations","text":"Investors should carefully analyze the financials, research pipeline, and future growth prospects of Celcuity Inc and its competitors before making any investment decisions. It is essential to consider the company's competitive position, ability to commercialize products, and potential risks associated with the industry."}],"tags":["CrossOver200","Long","Biotechnology"],"news":[{"category":"company","date":1701869400,"headline":"Celcuity Presents Preclinical Data on Therapeutic Effects of Gedatolisib in Breast Cancer Models at the 2023 San Antonio Breast Cancer Symposium","id":124332494,"image":"https://media.zenfs.com/en/globenewswire.com/5d6beb04817f108eee902f94066e26e6","symbol":"CELC","publisher":"Yahoo","summary":"MINNEAPOLIS, Dec. 06, 2023 (GLOBE NEWSWIRE) -- Celcuity Inc. (Nasdaq: CELC), a clinical-stage biotechnology company pursuing development of targeted therapies for oncology, today presented data from preclinical studies evaluating gedatolisib and other PI3K/AKT/mTOR (PAM) inhibitors in breast cancer cell lines during a poster session at the 2023 San Antonio Breast Cancer Symposium (SABCS). The preclinical studies evaluated gedatolisib, a pan-PI3K/mTOR inhibitor, and PAM inhibitors that selectivel","url":"https://finance.yahoo.com/news/celcuity-presents-preclinical-data-therapeutic-133000071.html"},{"category":"company","date":1701847980,"headline":"Celcuity presents preclinical data on therapeutic effects of gedatolisib","id":124338420,"image":"","symbol":"CELC","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3243992141"},{"category":"company","date":1701446520,"headline":"Celcuity to Present Preclinical Data for Gedatolisib at the 2023 San Antonio Breast Cancer Symposium","id":124247510,"image":"https://media.zenfs.com/en/globenewswire.com/5d6beb04817f108eee902f94066e26e6","symbol":"CELC","publisher":"Yahoo","summary":"MINNEAPOLIS, Dec. 01, 2023 (GLOBE NEWSWIRE) -- Celcuity Inc. (Nasdaq: CELC), a clinical-stage biotechnology company pursuing development of targeted therapies for oncology, today announced that an abstract accepted for a poster presentation at the 2023 San Antonio Breast Cancer Symposium (SABCS) is now available on the SABCS website. The 2023 San Antonio Breast Cancer Symposium (SABCS) is being held virtually and in-person from December 5-9, 2023. The presentation will include potency and effica","url":"https://finance.yahoo.com/news/celcuity-present-preclinical-data-gedatolisib-160200940.html"}]}