{"id":4343,"company":{"country":"CN","currency":"CNY","exchange":"HONG KONG EXCHANGES AND CLEARING LTD","ipo":"1996-02-05","marketCap":57132.4,"name":"Tingyi (Cayman Islands) Holding Corp","phone":"862131754604","outstanding":5634.36,"symbol":"TYCMY","website":"https://www.masterkong.com.cn/","industry":"Food Products"},"price":26.824,"year":2024,"month":8,"day":28,"weekday":"Wednesday","title":"Ownership Structure of Tingyi (Cayman Islands) Holding Corp Stock","date":"2024-08-28","url":"/posts/2024/08/28/TYCMY","content":[{"section":"Institutional Investors","text":"According to the latest available data, institutional investors hold a significant portion of the shares of Tingyi (Cayman Islands) Holding Corp. As of [date], approximately [percentage]% of the company's outstanding shares are held by institutional investors."},{"section":"Insider Ownership","text":"Insiders, including executives, directors, and other key individuals within the company, also have ownership stakes in Tingyi (Cayman Islands) Holding Corp. The exact percentage of insider ownership is not publicly disclosed. However, it is common for insiders to hold a certain percentage of the company's shares."},{"section":"Major Shareholders","text":"The major shareholders of Tingyi (Cayman Islands) Holding Corp include both institutional investors and individuals. Some of the known major shareholders are:"},{"section":"1. [Major Shareholder 1]","text":"[Major Shareholder 1] owns a significant portion of the company's shares, estimated to be [percentage]% of the outstanding shares."},{"section":"2. [Major Shareholder 2]","text":"[Major Shareholder 2] is another major shareholder of Tingyi (Cayman Islands) Holding Corp, with an ownership stake of approximately [percentage]%."},{"section":"3. [Major Shareholder 3]","text":"[Major Shareholder 3] holds a notable position in the ownership structure of Tingyi (Cayman Islands) Holding Corp, owning around [percentage]% of the outstanding shares."},{"section":"4. [Major Shareholder 4]","text":"[Major Shareholder 4] is also among the major shareholders of Tingyi (Cayman Islands) Holding Corp, with an approximate ownership stake of [percentage]%."},{"section":"5. [Major Shareholder 5]","text":"[Major Shareholder 5] holds a significant number of shares in Tingyi (Cayman Islands) Holding Corp, estimated to be [percentage]% of the outstanding shares."}],"tags":["CrossOver21","Long","Food Products"],"news":null}