{"id":841,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2016-06-30","marketCap":512.132080078125,"name":"HarborOne Bancorp Inc","phone":"15088951000.0","outstanding":45.91999816894531,"symbol":"HONE","website":"https://www.harboronebancorp.com/corporate-profile/default.aspx","industry":"Banking"},"price":11.15875,"year":2023,"month":11,"day":16,"weekday":"Thursday","title":"Corporate Governance Practices of HarborOne Bancorp Inc","date":"2023-11-16","url":"/posts/2023/11/16/HONE","content":[{"section":"Board Composition","text":"HarborOne Bancorp Inc has a diverse and experienced board of directors. The board consists of nine members, six of whom are independent directors. This composition ensures that the board operates independently and makes impartial decisions. The board members have expertise in various areas such as finance, banking, risk management, and legal, contributing to well-rounded decision-making."},{"section":"Executive Compensation","text":"HarborOne Bancorp Inc follows a performance-based compensation structure for its executives. The compensation committee is responsible for setting executive salaries, bonuses, and other incentives. The committee considers both financial performance and individual contributions to determine compensation. This approach aligns the interests of executives with the long-term success of the company and motivates them to drive shareholder value."},{"section":"Risk Management","text":"HarborOne Bancorp Inc has established a robust risk management framework. The board oversees the company's risk management practices and regularly assesses and monitors risks. The board actively participates in identifying, evaluating, and mitigating risks to ensure the safety and soundness of the organization. This proactive approach enables HarborOne Bancorp Inc to effectively manage risks and protect the interests of its stakeholders."},{"section":"Ethical Standards","text":"HarborOne Bancorp Inc places a strong emphasis on ethical behavior and integrity. The company has a code of conduct in place that guides the actions of its directors, officers, and employees. The board regularly reviews and updates the code of conduct to ensure it reflects changing industry standards and best practices. This commitment to ethical standards fosters trust among stakeholders and contributes to the company's reputation."},{"section":"Shareholder Engagement","text":"HarborOne Bancorp Inc actively engages with its shareholders to understand their perspectives and concerns. The company holds regular shareholder meetings where shareholders can voice their opinions and ask questions to the board and management. The board encourages open and transparent communication with shareholders and seeks to address their concerns effectively. This shareholder engagement helps in building long-term relationships and ensuring alignment of interests."},{"section":"Disclosure and Transparency","text":"HarborOne Bancorp Inc places great importance on transparency and timely disclosure of information. The company provides detailed financial and non-financial disclosures in its annual reports, quarterly reports, and other SEC filings. The board ensures that all material information is accurately and promptly disclosed to shareholders and the public. This transparency promotes trust and allows stakeholders to make informed decisions."},{"section":"Board Committees","text":"HarborOne Bancorp Inc has established various board committees to enhance corporate governance. These committees, including the audit committee, compensation committee, and risk management committee, have clear charters outlining their responsibilities. The committees meet regularly and provide independent oversight in their respective areas of expertise. This committee structure strengthens accountability and decision-making within the organization."},{"section":"Conclusion","text":"HarborOne Bancorp Inc demonstrates strong corporate governance practices through its diverse board composition, performance-based executive compensation, robust risk management framework, emphasis on ethical standards, active shareholder engagement, transparency in disclosures, and effective board committees. These practices contribute to the company's overall governance effectiveness and position it well for sustainable growth and long-term success."}],"tags":["CrossOver100","Long","Banking"],"news":[{"category":"company","date":1700043309,"headline":"STERIS (NYSE:STE) Could Be A Buy For Its Upcoming Dividend","id":123892436,"image":"https://media.zenfs.com/en/simply_wall_st__316/983f2bdfe32b19227b1d118c45bf4f09","symbol":"HONE","publisher":"Yahoo","summary":"It looks like STERIS plc ( NYSE:STE ) is about to go ex-dividend in the next 4 days. The ex-dividend date is one...","url":"https://finance.yahoo.com/news/steris-nyse-ste-could-buy-101509385.html"},{"category":"company","date":1699559641,"headline":"STERIS plc (NYSE:STE) Q2 2024 Earnings Call Transcript","id":123765124,"image":"https://s.yimg.com/ny/api/res/1.2/J6eF.pXE2N5pjq4VohUzsQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/e1098d06ebf841efba84505afd03e70a","symbol":"HONE","publisher":"Yahoo","summary":"STERIS plc (NYSE:STE) Q2 2024 Earnings Call Transcript November 8, 2023 Operator: Good morning, everyone and welcome to the STERIS plc Fiscal Second Quarter 2024 Conference Call. All participants will be in a listen-only mode. [Operator Instructions]. Please also note, today’s event is being recorded. At this time, I’d like to turn the floor over […]","url":"https://finance.yahoo.com/news/steris-plc-nyse-ste-q2-195401301.html"},{"category":"company","date":1699501550,"headline":"Q2 2024 STERIS plc Earnings Call","id":123753381,"image":"","symbol":"HONE","publisher":"Yahoo","summary":"Q2 2024 STERIS plc Earnings Call","url":"https://finance.yahoo.com/news/q2-2024-steris-plc-earnings-034550678.html"},{"category":"company","date":1699482471,"headline":"S\u0026P 500 Gains and Losses Today: New 'Grand Theft Auto' Game Lifts Take-Two Shares","id":123738930,"image":"https://s.yimg.com/ny/api/res/1.2/Etf.Aw8MjjDoI3FkkjLSsQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0xMTQ2/https://media.zenfs.com/en/investopedia.com/56d23df44e847dd2ee0535851aec1366","symbol":"HONE","publisher":"Yahoo","summary":"The S\u0026P 500 was up 0.1% on Wednesday, Nov. 8, 2023, keeping its winning streak alive as the market weighed the possibility of more Fed interest rate hikes ahead.","url":"https://finance.yahoo.com/m/c16cedea-8c6b-314a-82be-586cd6d876bf/s%26p-500-gains-and-losses.html"},{"category":"company","date":1699468917,"headline":"Can STERIS plc (NYSE:STE) Performance Keep Up Given Its Mixed Bag Of Fundamentals?","id":123739558,"image":"https://media.zenfs.com/en/simply_wall_st__316/983f2bdfe32b19227b1d118c45bf4f09","symbol":"HONE","publisher":"Yahoo","summary":"STERIS' (NYSE:STE) stock is up by 3.9% over the past week. Given that the stock prices usually follow long-term...","url":"https://finance.yahoo.com/news/steris-plc-nyse-ste-performance-184157042.html"},{"category":"company","date":1699463422,"headline":"Markets Edge Lower at Midday With Speeches by Fed Officials in Focus","id":123727778,"image":"https://s.yimg.com/ny/api/res/1.2/wFll0uJsduwRa5tWer347Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/investopedia.com/4ae201c39d17c91f1716650b1f87a3ec","symbol":"HONE","publisher":"Yahoo","summary":"U.S. equities edged lower at midday on Wednesday, Nov. 8, 2023, ahead of more comments from Fed officials that could offer clues on the future of interest rates.","url":"https://finance.yahoo.com/m/7c370499-6bf9-3b89-86db-0af6673b6ead/markets-edge-lower-at-midday.html"},{"category":"company","date":1699444140,"headline":"STERIS (STE) Q2 Revenues Surpass Estimates, Margins Down","id":123719073,"image":"https://media.zenfs.com/en/zacks.com/1e552346993bc506645ea4f77aa926c8","symbol":"HONE","publisher":"Yahoo","summary":"STERIS' (STE) fiscal 2024 second-quarter results reflect continued momentum in the Healthcare business.","url":"https://finance.yahoo.com/news/steris-ste-q2-revenues-surpass-114900450.html"},{"category":"company","date":1699420227,"headline":"The Steris PLC (STE) Company: A Short SWOT Analysis","id":123712845,"image":"https://media.zenfs.com/en/us.finance.gurufocus/0346de79b02c85c973f06cc6da35e482","symbol":"HONE","publisher":"Yahoo","summary":"Decoding Steris PLC (STE): A Strategic SWOT Insight","url":"https://finance.yahoo.com/news/steris-plc-ste-company-short-051027800.html"},{"category":"company","date":1699399810,"headline":"Steris (STE) Reports Q2 Earnings: What Key Metrics Have to Say","id":123712847,"image":"https://media.zenfs.com/en/zacks.com/21b1f011539d3e31c28282071d344177","symbol":"HONE","publisher":"Yahoo","summary":"While the top- and bottom-line numbers for Steris (STE) give a sense of how the business performed in the quarter ended September 2023, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values.","url":"https://finance.yahoo.com/news/steris-ste-reports-q2-earnings-233010526.html"},{"category":"company","date":1698939540,"headline":"Steris (STE) Q2 Earnings Preview: What You Should Know Beyond the Headline Estimates","id":123602815,"image":"https://media.zenfs.com/en/zacks.com/5b7da1bf511604b75d7c8a64acb508f4","symbol":"HONE","publisher":"Yahoo","summary":"Beyond analysts' top -and-bottom-line estimates for Steris (STE), evaluate projections for some of its key metrics to gain a better insight into how the business might have performed for the quarter ended September 2023.","url":"https://finance.yahoo.com/news/steris-ste-q2-earnings-preview-153900779.html"}]}