{"id":4370,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"1993-10-27","marketCap":283.334,"name":"Fidelity D\u0026D Bancorp Inc","phone":"15703428281.0","outstanding":5.7,"symbol":"FDBC","website":"https://bankatfidelity.q4ir.com/corporate-profile/default.aspx","industry":"Banking"},"price":52.03,"year":2024,"month":8,"day":30,"weekday":"Friday","title":"Corporate Governance Practices of Fidelity D\u0026D Bancorp Inc","date":"2024-08-30","url":"/posts/2024/08/30/FDBC","content":[{"section":"Board Composition","text":"Fidelity D\u0026D Bancorp Inc has a well-rounded board of directors with diverse backgrounds and experiences. The board consists of 10 members, including both inside and outside directors. This composition ensures a balanced and independent decision-making process."},{"section":"Independence and Expertise","text":"The majority of the directors on Fidelity D\u0026D Bancorp Inc's board are independent, meaning they have no significant business or financial ties to the company. This independence ensures that board decisions are impartial and in the best interest of shareholders. Additionally, the board includes directors with expertise in various areas such as finance, banking, and risk management, which provides valuable insights and guidance."},{"section":"Board Committees","text":"Fidelity D\u0026D Bancorp Inc has established several committees to enhance governance and oversight. These committees include an Audit Committee, Compensation Committee, and Nominating and Corporate Governance Committee. The committees are comprised of independent directors and are responsible for overseeing specific areas of the company's operations, ensuring transparency and accountability."},{"section":"Executive Compensation","text":"Fidelity D\u0026D Bancorp Inc's executive compensation practices align with industry standards and promote performance-based incentives. The compensation package for executives includes a mix of base salary, annual performance bonuses, and long-term incentives tied to the company's financial performance and shareholder value. This approach encourages executive accountability and aligns their interests with those of shareholders."},{"section":"Transparency and Disclosure","text":"Fidelity D\u0026D Bancorp Inc prioritizes transparency and provides comprehensive disclosures regarding its corporate governance practices. The company regularly files reports with the Securities and Exchange Commission (SEC) and discloses information about board composition, committee charters, executive compensation, and other relevant governance matters. This transparency benefits shareholders and stakeholders by promoting trust and accountability."},{"section":"Shareholder Engagement","text":"Fidelity D\u0026D Bancorp Inc believes in engaging with its shareholders and seeks their input on important matters. The company holds regular shareholder meetings and provides opportunities for shareholders to voice their opinions and concerns. This shareholder engagement fosters a collaborative approach to decision-making and ensures alignment between the company's leadership and its shareholders."},{"section":"Risk Management","text":"Fidelity D\u0026D Bancorp Inc has a robust risk management framework in place to identify, assess, and mitigate various risks. The board of directors plays a crucial role in overseeing the risk management process and ensuring that appropriate controls are in place. This focus on risk management promotes the long-term sustainability and stability of the company."},{"section":"Conclusion","text":"Fidelity D\u0026D Bancorp Inc demonstrates strong corporate governance practices through its board composition, independent decision-making, committee structure, executive compensation, transparency, shareholder engagement, and risk management. These practices contribute to the company's success and enhance its reputation as a responsible and accountable corporate entity."}],"tags":["CrossOver21","Long","Banking"],"news":[{"category":"company","date":1724151882,"headline":"Top US Dividend Stocks To Watch In August 2024","id":129459697,"image":"https://media.zenfs.com/en/simply_wall_st__316/a192a90509b207df974cc973e0c18172","symbol":"FDBC","publisher":"Yahoo","summary":"As of August 2024, U.S. markets are experiencing a robust rally with the S\u0026P 500 and Nasdaq Composite extending their winning streaks, buoyed by investor optimism and expectations of upcoming interest rate cuts from the Federal Reserve. With major indices nearing all-time highs, investors are increasingly looking towards dividend stocks as a reliable source of income amid market volatility. In such an environment, strong dividend stocks can offer stability and consistent returns, making them...","url":"https://finance.yahoo.com/news/top-us-dividend-stocks-watch-110442849.html"},{"category":"company","date":1723879119,"headline":"Dividend Champion, Contender, And Challenger Highlights: Week Of August 18","id":129421549,"image":"","symbol":"FDBC","publisher":"SeekingAlpha","summary":"","url":"https://seekingalpha.com/article/4715375-dividend-champion-contender-challenger-highlights-week-august-18"},{"category":"company","date":1723798800,"headline":"Cash Dividend On The Way From Fidelity D\u0026D Bancorp (FDBC)","id":129414993,"image":"","symbol":"FDBC","publisher":"Dividend Channel","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3603103680"}]}