{"id":2317,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2001-06-05","marketCap":265.0150146484375,"name":"Fennec Pharmaceuticals Inc","phone":"19196364530","outstanding":26.6299991607666,"symbol":"FENC","website":"https://fennecpharma.com/","industry":"Biotechnology"},"price":9.92,"year":2023,"month":12,"day":16,"weekday":"Saturday","title":"Market Capitalization and Valuation Metrics of Fennec Pharmaceuticals Inc","date":"2023-12-16","url":"/posts/2023/12/16/FENC","content":[{"section":"Market Capitalization","text":"Fennec Pharmaceuticals Inc has a market capitalization of $X million, which is in line with the industry average market capitalization of $Y million."},{"section":"Valuation Metrics","text":"When comparing Fennec Pharmaceuticals Inc's valuation metrics with industry benchmarks, the following ratios are considered:"},{"section":"1. Price-to-Earnings Ratio (P/E)","text":"Fennec Pharmaceuticals Inc's P/E ratio is Z, compared to the industry average ratio of W. This suggests that the stock may be overvalued or undervalued relative to its earnings."},{"section":"2. Price-to-Sales Ratio (P/S)","text":"The P/S ratio of Fennec Pharmaceuticals Inc is A, while the industry average is B. This ratio indicates the stock's valuation relative to its revenue and can help assess its growth potential."},{"section":"3. Price-to-Book Ratio (P/B)","text":"Fennec Pharmaceuticals Inc's P/B ratio is C, which is higher or lower than the industry average ratio of D. This metric compares the stock's market value to its book value and can indicate if the stock is overvalued or undervalued."},{"section":"4. Enterprise Value-to-Sales Ratio (EV/S)","text":"The EV/S ratio of Fennec Pharmaceuticals Inc is E, while the industry average is F. This ratio takes into account the company's debt and cash to evaluate its value compared to revenue."},{"section":"5. Dividend Yield","text":"Fennec Pharmaceuticals Inc does not currently pay dividends, so the dividend yield is not applicable."},{"section":"6. Other Valuation Metrics","text":"Other relevant valuation metrics, such as price-to-free cash flow and price-to-earnings growth ratio, are not available or applicable for Fennec Pharmaceuticals Inc."}],"tags":["CrossOver100","Long","Biotechnology"],"news":[{"category":"company","date":1701864913,"headline":"With 31% stake, Fennec Pharmaceuticals Inc. (NASDAQ:FENC) seems to have captured hedge funds investors' interest","id":124330057,"image":"https://media.zenfs.com/en/simply_wall_st__316/4d522452d0da08d8412701a84270533b","symbol":"FENC","publisher":"Yahoo","summary":"Key Insights Institutions' substantial holdings in Fennec Pharmaceuticals implies that they have significant influence...","url":"https://finance.yahoo.com/news/31-stake-fennec-pharmaceuticals-inc-121513257.html"},{"category":"company","date":1701773700,"headline":"Fennec Announces Incremental $5 Million Investment from Petrichor","id":124300868,"image":"https://media.zenfs.com/en/globenewswire.com/9250c5b3cdd26e4e6cf63b0e20aad27a","symbol":"FENC","publisher":"Yahoo","summary":"~ Supports Strategic Discussions and Global Launch Activities ~ ~ Extends Access to Additional Undrawn Capital As Needed During Global PEDMARK® Rollout ~ ~ Facilitates Market Expansion into the Adolescent and Young Adult (AYA) Patient Population ~ RESEARCH TRIANGLE PARK, N.C., Dec. 05, 2023 (GLOBE NEWSWIRE) -- Fennec Pharmaceuticals Inc. (NASDAQ: FENC; TSX: FRX), a commercial stage specialty pharmaceutical company focused on improving the lives of children with cancer, today announced the third","url":"https://finance.yahoo.com/news/fennec-announces-incremental-5-million-105500634.html"},{"category":"company","date":1701763980,"headline":"Analysts Conflicted on These Healthcare Names: Roche Holding AG (OtherRHHVF), REPRO-MED Systems (KRMD) and Fennec Pharmaceuticals (FENC)","id":124317138,"image":"","symbol":"FENC","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3242192065"}]}