{"id":2318,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2001-07-31","marketCap":327.7265625,"name":"Orange County Bancorp Inc","phone":"18453415000","outstanding":5.650000095367432,"symbol":"OBT","website":"https://investors.orangebanktrust.com/","industry":"Banking"},"price":56.7125,"year":2023,"month":12,"day":16,"weekday":"Saturday","title":"Governance practices of Orange County Bancorp Inc stock","date":"2023-12-16","url":"/posts/2023/12/16/OBT","content":[{"section":"Board composition","text":"Orange County Bancorp Inc has a diverse and independent board of directors. The board consists of seven members, including both internal and external directors. The board is composed of individuals with extensive experience in the financial industry and other relevant fields. This diverse composition ensures a wide range of perspectives and expertise to guide the company."},{"section":"Executive compensation","text":"Orange County Bancorp Inc follows a transparent and performance-driven approach to executive compensation. The company's compensation committee sets the compensation for top executives based on measurable performance criteria, such as financial performance, customer satisfaction, and employee engagement. This aligns the interests of the executives with the long-term success of the company and promotes a culture of accountability."},{"section":"Board independence","text":"The majority of the board members of Orange County Bancorp Inc are independent, ensuring their decisions are not influenced by management. Independent directors bring objectivity and expertise to the board and serve as a check on management's actions. This promotes accountability and helps protect the interests of shareholders."},{"section":"Committees","text":"Orange County Bancorp Inc has established various board committees to oversee specific areas of corporate governance. These committees include an audit committee, compensation committee, and nominating committee. Each committee is composed of independent directors and has a specific mandate to ensure proper oversight and strategic decision-making in their respective areas."},{"section":"Shareholder rights","text":"Orange County Bancorp Inc recognizes the importance of protecting shareholder rights. The company ensures that shareholders have the ability to participate in key decisions through voting rights and provides regular updates on financial performance and corporate governance practices. Shareholders are also provided opportunities to engage with the board and management through annual general meetings and other forums."},{"section":"Ethical standards","text":"Orange County Bancorp Inc promotes a culture of ethical conduct and has established a code of business conduct and ethics for all directors, officers, and employees. The company emphasizes integrity, transparency, and accountability in all its operations. Additionally, the board regularly reviews and updates the company's corporate governance policies to comply with evolving regulations and best practices."},{"section":"Risk oversight","text":"Orange County Bancorp Inc has a robust risk management framework in place. The board actively oversees and assesses the company's risk profile and monitors the effectiveness of risk mitigation strategies. The board communicates with management to ensure that risks are properly identified, assessed, and managed in line with the company's risk appetite."},{"section":"Conclusion","text":"Orange County Bancorp Inc demonstrates a commitment to strong corporate governance practices. The company's diverse board composition, performance-based executive compensation, independent directors, board committees, shareholder rights, ethical standards, and risk oversight contribute to effective governance and protection of shareholder interests. These practices enhance transparency, accountability, and the long-term sustainability of the company."}],"tags":["CrossOver100","Long","Banking"],"news":[{"category":"company","date":1702695865,"headline":"Orange County Bancorp (OBT) Price Target Increased by 7.07% to 54.06","id":124545111,"image":"","symbol":"OBT","publisher":"Fintel","summary":"","url":"https://fintel.io/news/orange-county-bancorp-obt-price-target-increased-by-707-to-5406-298"},{"category":"company","date":1702649716,"headline":"Orange County Bancorp, Inc. (OBT) Hit a 52 Week High, Can the Run Continue?","id":124545506,"image":"https://media.zenfs.com/en/zacks.com/71afbbc0512eb3c471136d93f39079c9","symbol":"OBT","publisher":"Yahoo","summary":"Orange County Bancorp, Inc. (OBT) is at a 52-week high, but can investors hope for more gains in the future? We take a look at the company's fundamentals for clues.","url":"https://finance.yahoo.com/news/orange-county-bancorp-inc-obt-141516161.html"},{"category":"company","date":1702548300,"headline":"Strength Seen in Orange County Bancorp, Inc. (OBT): Can Its 6.9% Jump Turn into More Strength?","id":124511009,"image":"https://media.zenfs.com/en/zacks.com/07898017c06d55a392c4649155ab41b2","symbol":"OBT","publisher":"Yahoo","summary":"Orange County Bancorp, Inc. (OBT) was a big mover last session on higher-than-average trading volume. The latest trend in earnings estimate revisions might not help the stock continue moving higher in the near term.","url":"https://finance.yahoo.com/news/strength-seen-orange-county-bancorp-100500674.html"},{"category":"company","date":1702439700,"headline":"Orange County Bancorp management to meet with Piper Sandler","id":124498719,"image":"","symbol":"OBT","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3254771650"},{"category":"company","date":1702292460,"headline":"Orange County Bancorp management to meet virtually with Stephens","id":124445826,"image":"","symbol":"OBT","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3251588229"},{"category":"company","date":1702043406,"headline":"Here's Why Momentum in Orange County Bancorp, Inc. (OBT) Should Keep going","id":124391339,"image":"https://media.zenfs.com/en/zacks.com/26a86d59f0e8f1e82a35a92ae5684cd9","symbol":"OBT","publisher":"Yahoo","summary":"Orange County Bancorp, Inc. (OBT) made it through our \"Recent Price Strength\" screen and could be a great choice for investors looking to make a profit from stocks that are currently on the move.","url":"https://finance.yahoo.com/news/heres-why-momentum-orange-county-135006287.html"},{"category":"company","date":1701828420,"headline":"Orange County Bancorp (OBT) Passes Through 2% Yield Mark","id":124350132,"image":"","symbol":"OBT","publisher":"Dividend Channel","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3244544014"},{"category":"company","date":1701699304,"headline":"OFG Bancorp (OFG) Hit a 52 Week High, Can the Run Continue?","id":124278287,"image":"https://media.zenfs.com/en/zacks.com/f889276f4a638f3c7a79c0e3e6b768c1","symbol":"OBT","publisher":"Yahoo","summary":"OFG (OFG) is at a 52-week high, but can investors hope for more gains in the future? We take a look at the company's fundamentals for clues.","url":"https://finance.yahoo.com/news/ofg-bancorp-ofg-hit-52-141504897.html"}]}