{"id":1882,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2001-12-20","marketCap":609.215,"name":"Horizon Bancorp Inc","phone":"12198790211","outstanding":44.11,"symbol":"HBNC","website":"https://www.horizonbank.com/","industry":"Banking"},"price":13.04,"year":2023,"month":12,"day":14,"weekday":"Thursday","title":"Corporate Governance Practices of Horizon Bancorp Inc","date":"2023-12-14","url":"/posts/2023/12/14/HBNC","content":[{"section":"Board Composition","text":"Horizon Bancorp Inc has a board of directors composed of experienced individuals with diverse backgrounds and expertise. The board consists of both internal and external directors, providing a balance of perspectives and ensuring independent oversight. The board members possess relevant industry knowledge and skills necessary for effective decision-making in the banking sector."},{"section":"Executive Compensation","text":"Horizon Bancorp Inc's executive compensation appears to be in line with industry norms and performance-based. The company has a compensation committee that reviews and determines executive pay, considering factors such as financial performance, individual performance, and competitive market benchmarks. This ensures that executives are rewarded fairly for their contributions and aligns their interests with those of the shareholders."},{"section":"Transparency and Accountability","text":"Horizon Bancorp Inc demonstrates a commitment to transparency and accountability in its corporate governance practices. The company provides comprehensive disclosure of its governance policies, executive compensation practices, and financial performance. Shareholders have access to relevant information to make informed decisions and hold management accountable for their actions."},{"section":"Risk Management","text":"Horizon Bancorp Inc maintains a solid risk management framework to identify, assess, and mitigate various risks associated with its operations. The board oversees the company's risk management practices and ensures that appropriate measures are in place to safeguard the interests of shareholders and other stakeholders. Regular risk assessments and reporting mechanisms enhance the effectiveness of risk management."},{"section":"Shareholder Rights","text":"Horizon Bancorp Inc acknowledges and respects the rights of its shareholders. The company holds regular shareholder meetings, allowing investors to have a voice in key decisions and express their concerns. Shareholders are also provided with ample information regarding their rights, voting procedures, and access to corporate documents. This fosters a culture of shareholder democracy and engagement."},{"section":"Compliance and Ethical Standards","text":"Horizon Bancorp Inc adheres to high compliance and ethical standards in its operations. The company has implemented robust policies and practices to prevent conflicts of interest, promote integrity, and ensure compliance with applicable laws and regulations. Ethical conduct is emphasized at all levels of the organization and employees are encouraged to report any potential violations through established channels."},{"section":"Conclusion","text":"Horizon Bancorp Inc demonstrates strong corporate governance practices, evidenced by a well-composed board, reasonable executive compensation, transparency, and a commitment to accountability. The company's focus on risk management, shareholder rights, and ethical standards further reinforces its commitment to responsible and sustainable business practices."}],"tags":["CrossOver55","Long","Banking"],"news":[{"category":"company","date":1702448820,"headline":"Horizon Bancorp (HBNC) Gets a Hold from Piper Sandler","id":124499906,"image":"","symbol":"HBNC","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3254892689"},{"category":"company","date":1702415100,"headline":"Horizon Bancorp, Inc. Announces Balance Sheet Repositioning","id":124473152,"image":"https://s.yimg.com/ny/api/res/1.2/2pqqJ2cL1sfETzrASrH_IQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05Mjc-/https://media.zenfs.com/en/globenewswire.com/6e0c57426fa201e05b07dd19384ee467","symbol":"HBNC","publisher":"Yahoo","summary":"MICHIGAN CITY, Ind., Dec. 12, 2023 (GLOBE NEWSWIRE) -- (NASDAQ GS: HBNC) – Horizon Bancorp, Inc. (“Horizon” or the “Company”), the parent company of Horizon Bank (the “Bank”), announced the execution of a balance sheet repositioning related to its investment securities portfolio and bank owned life insurance policies. The Company sold $382.7 million in available-for-sale (“AFS”) securities, composed of treasury, agency, corporate, and municipal securities with a weighted average book yield of 2.","url":"https://finance.yahoo.com/news/horizon-bancorp-inc-announces-balance-210500790.html"},{"category":"company","date":1702351920,"headline":"Horizon Bancorp repositions balance sheet with AFS securities sales","id":124472576,"image":"","symbol":"HBNC","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3253837679"},{"category":"company","date":1702351680,"headline":"Horizon Bancorp executes balance sheet repositioning, sees accretion","id":124472577,"image":"","symbol":"HBNC","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3253830492"}]}