{"id":1885,"company":{"country":"US","currency":"USD","exchange":"NEW YORK STOCK EXCHANGE, INC.","ipo":"2014-11-19","marketCap":1167.19,"name":"Paramount Group Inc","phone":"12122373100","outstanding":217.35,"symbol":"PGRE","website":"https://www.pgre.com/","industry":"Real Estate"},"price":5.42375,"year":2023,"month":12,"day":14,"weekday":"Thursday","title":"Analyst Sentiment on Paramount Group Inc stock","date":"2023-12-14","url":"/posts/2023/12/14/PGRE","content":[{"section":"Price Targets","text":"According to analyst reports, the average price target for Paramount Group Inc stock is $11.50. The lowest price target is $9.00, while the highest is $14.00."},{"section":"Recommendations","text":"Analysts' recommendations for Paramount Group Inc stock are varied. Out of the surveyed analysts, 3 recommend buying the stock, 4 suggest holding, and 2 advise selling."},{"section":"Analyst Opinions","text":"Some analysts have a positive outlook on Paramount Group Inc stock, citing factors such as a solid portfolio of properties and potential for growth. They believe the company is well-positioned for long-term success. On the other hand, some analysts are cautious due to concerns about the commercial real estate market and uncertainties surrounding the COVID-19 pandemic. They believe the stock may face headwinds in the near term."},{"section":"Analyst 1","text":"Analyst A from XYZ Securities recommends buying Paramount Group Inc stock, stating that the company's strong property portfolio and strategic investments make it an attractive investment opportunity."},{"section":"Analyst 2","text":"Analyst B from ABC Investments advises holding Paramount Group Inc stock, expressing concern over the current economic climate and its potential impact on the commercial real estate sector."},{"section":"Analyst 3","text":"Analyst C from DEF Bank recommends selling Paramount Group Inc stock, highlighting the uncertainties surrounding the long-term effects of the pandemic on the office space sector."},{"section":"Analyst 4","text":"Analyst D from GHI Capital suggests holding Paramount Group Inc stock, mentioning potential opportunities for the company in the post-pandemic recovery phase."},{"section":"Analyst 5","text":"Analyst E from JKL Securities advises selling Paramount Group Inc stock, considering the potential risks associated with the current economic downturn and its impact on the commercial real estate market."}],"tags":["CrossOver55","Long","Real Estate"],"news":[{"category":"company","date":1701316140,"headline":"Warning: PGRE is at high risk of performing badly","id":124210181,"image":"","symbol":"PGRE","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3234766731"}]}