{"id":1797,"company":{"country":"CH","currency":"USD","exchange":"SWISS EXCHANGE","ipo":"2014-11-28","marketCap":80162.90625,"name":"UBS Group AG","phone":"41442341111","outstanding":3233.267333984375,"symbol":"UBS","website":"https://www.ubs.com/","industry":"Financial Services"},"price":28.78625,"year":2023,"month":12,"day":14,"weekday":"Thursday","title":"The Impact of Changes in Credit Ratings and Market Conditions on UBS Group AG","date":"2023-12-14","url":"/posts/2023/12/14/UBS","content":[{"section":"Introduction","text":"UBS Group AG is a Swiss multinational investment bank and financial services company that operates globally. As a major player in the financial industry, UBS's creditworthiness and access to debt markets are crucial factors in its success. Changes in credit ratings and credit market conditions can significantly impact UBS's cost of borrowing and its stock price."},{"section":"Credit Ratings and Cost of Borrowing","text":"Credit ratings reflect an assessment of UBS's ability to repay its debts and indicate the level of credit risk associated with lending to the company. A higher credit rating suggests lower credit risk, which can lead to lower borrowing costs. Conversely, a downgrade in UBS's credit rating could result in higher borrowing costs as lenders demand higher interest rates to compensate for the perceived increase in risk."},{"section":"Impact on Stock Price","text":"Changes in credit ratings can also have a significant impact on UBS's stock price. A higher credit rating enhances investor confidence in the company's financial stability and can attract more investors, leading to an increase in demand for the stock. This increased demand can drive up the stock price. Conversely, a credit rating downgrade can erode investor confidence, resulting in a decrease in stock price as investors perceive higher risk associated with UBS's financial position."},{"section":"Credit Market Conditions and UBS's Cost of Borrowing","text":"Credit market conditions, such as overall interest rates and liquidity in the market, can affect UBS's cost of borrowing. In a low-interest rate environment, UBS may be able to secure loans at more favorable rates, reducing its cost of borrowing. Conversely, in a high-interest rate environment, UBS may face higher borrowing costs, potentially impacting its profitability and financial performance."},{"section":"Creditworthiness and Debt Markets","text":"UBS's creditworthiness has a direct impact on its ability to access debt markets. A strong creditworthiness allows UBS to borrow funds at lower interest rates and from a broader range of lenders. This provides UBS with more flexibility in managing its debt and reduces its dependence on a few key lenders. However, a deterioration in UBS's creditworthiness can make it more challenging for the company to raise funds in debt markets, potentially limiting its ability to finance its operations and investments."},{"section":"Conclusion","text":"Changes in credit ratings and credit market conditions have a significant impact on UBS Group AG's cost of borrowing and its stock price. Maintaining a strong credit rating and closely monitoring credit market conditions are crucial for UBS's financial performance. By assessing and managing its creditworthiness effectively, UBS can optimize its borrowing costs and investor sentiment, ensuring its long-term success in the financial industry."}],"tags":["OverBought","Short","Financial Services"],"news":[{"category":"company","date":1702515586,"headline":"Credit Suisse Disbands China Onshore Wealth Unit, Dozens Depart","id":124500092,"image":"https://s.yimg.com/ny/api/res/1.2/Hsh3hC4CPpnHZ3uOmIVpaA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD01MjQ-/https://media.zenfs.com/en/bloomberg_markets_842/ef7800041de04f6ac7b6f449c567b415","symbol":"UBS","publisher":"Yahoo","summary":"(Bloomberg) -- Credit Suisse dismissed its entire wealth management team in China, scrapping its ambition to become one of the biggest foreign money managers in the country as UBS Group AG decided not to take on the staff, people familiar with the matter said. Most Read from BloombergJPMorgan Is in a Fight Over Its Client’s Lost $50 Million FortuneCitigroup Offers Partial Early Bonuses to Encourage Staff DeparturesTesla Recalls 2 Million Cars to Fix Autopilot Safety FlawsFed Pivots to Rate Cuts","url":"https://finance.yahoo.com/news/credit-suisse-disbands-china-onshore-005946651.html"},{"category":"company","date":1702509573,"headline":"UBS steps up efforts to recover cash from Credit Suisse defectors - Bloomberg News","id":124500093,"image":"https://media.zenfs.com/en/reuters-finance.com/8076d812b72d0ff85c4e504daacbee0d","symbol":"UBS","publisher":"Yahoo","summary":"UBS has contacted hundreds of bankers and offered some multi-year payment plans amid efforts to claw back a chunk of the 1.2 billion Swiss francs ($1.38 billion) in restricted cash bonuses, the report said, citing people familiar with the matter and documents seen by it.  The amount that UBS is seeking to recover is less than 651 million Swiss francs, the report said.  UBS earlier in the year took over Credit Suisse, in the biggest bank merger since the global financial crisis and it was orchestrated by the Swiss state to avert Credit Suisse's collapse.","url":"https://finance.yahoo.com/news/ubs-steps-efforts-recover-cash-231933309.html"},{"category":"company","date":1702509359,"headline":"UPDATE 1-UBS steps up efforts to recover cash from Credit Suisse defectors - Bloomberg News","id":124500094,"image":"","symbol":"UBS","publisher":"Yahoo","summary":"Swiss lender UBS Group AG has stepped up efforts to recoup hundreds of millions in cash bonuses that Credit Suisse  paid to retain dealmakers before the lender's collapse, Bloomberg News reported on Wednesday.  UBS has contacted hundreds of bankers and offered some multi-year payment plans amid efforts to claw back a chunk of the 1.2 billion Swiss francs ($1.38 billion) in restricted cash bonuses, the report said, citing people familiar with the matter and documents seen by it.  The amount that UBS is seeking to recover is less than 651 million Swiss francs, the report said.","url":"https://finance.yahoo.com/news/1-ubs-steps-efforts-recover-231559838.html"},{"category":"company","date":1702504619,"headline":"Credit Suisse Units Pay $10 Million to End SEC Mutual Fund Probe","id":124500095,"image":"https://s.yimg.com/ny/api/res/1.2/HYM2muUst1VEHPPknl2xLQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_markets_842/ad28e40a82d4b0fbd1e4f31ba8d46f0e","symbol":"UBS","publisher":"Yahoo","summary":"(Bloomberg) -- Three Credit Suisse entities agreed to pay $10 million to settle a Securities and Exchange Commission probe into whether they improperly provided services to mutual funds before the Swiss bank was acquired by UBS Group AG. Most Read from BloombergJPMorgan Is in a Fight Over Its Client’s Lost $50 Million FortuneCitigroup Offers Partial Early Bonuses to Encourage Staff DeparturesTesla Recalls 2 Million Cars to Fix Autopilot Safety FlawsFed Pivots to Rate Cuts as Inflation Heads Towa","url":"https://finance.yahoo.com/news/credit-suisse-units-pay-10-215659298.html"},{"category":"company","date":1702438920,"headline":"Credit Suisse entities to pay $10M in SEC settlement over prohibited services","id":124496207,"image":"","symbol":"UBS","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3255625001"},{"category":"company","date":1702382940,"headline":"UBS creates new team of top dealmakers led by former investment bank head L’Esperance","id":124462038,"image":"https://images.fnlondon.com/im-899351/?width=749\u0026height=499","symbol":"UBS","publisher":"DowJones","summary":"UBS is aiming to expand its investment banking business following its Credit Suisse acquisition","url":"https://www.fnlondon.com/articles/ubs-creates-new-team-of-top-dealmakers-led-by-former-investment-bank-head-lesperance-20231212"},{"category":"company","date":1702375320,"headline":"UBS offers smaller redundancy payments for older staff in Madrid","id":124462001,"image":"https://images.fnlondon.com/im-899221/?width=749\u0026height=499","symbol":"UBS","publisher":"DowJones","summary":"UBS is cutting around 150 jobs at Credit Suisse's former post-Brexit hub in Spain","url":"https://www.fnlondon.com/articles/credit-suisse-offers-smaller-redundancy-payments-for-older-staff-in-madrid-20231212"},{"category":"company","date":1702363560,"headline":"UBS hires JPMorgan veteran Rueger to co-head equity capital markets","id":124455973,"image":"https://images.fnlondon.com/im-899183/?width=749\u0026height=499","symbol":"UBS","publisher":"DowJones","summary":"UBS has continued to hire externally despite an influx of former Credit Suisse bankers","url":"https://www.fnlondon.com/articles/ubs-hires-jpmorgan-veteran-rueger-to-co-head-equity-capital-markets-20231212"},{"category":"company","date":1702317480,"headline":"Four Financial Advisors join UBS in Atlanta, Georgia","id":124441208,"image":"https://media.zenfs.com/en/business-wire.com/c3dc7760a2273f90ebadcb44e0d81e48","symbol":"UBS","publisher":"Yahoo","summary":"ATLANTA, December 11, 2023--UBS Wealth Management USA today announced that Financial Advisors Chris Hartnett, Daniel Schurr, John Little and William Kennon, and Client Service Associate Wanda Brewster-Harris have joined the firm. Combined, they bring more than 50 years of industry experience and manage nearly $600 million in client assets.","url":"https://finance.yahoo.com/news/four-financial-advisors-join-ubs-175800023.html"},{"category":"company","date":1702306800,"headline":"UBS expands Wealth Management capabilities in Arizona, unveils new offices in Phoenix and Scottsdale","id":124441209,"image":"https://media.zenfs.com/en/business-wire.com/98f94743af0ed86360d6dbc2d38ce7bb","symbol":"UBS","publisher":"Yahoo","summary":"PHOENIX, December 11, 2023--UBS supports Arizona investors with expanded offices in Phoenix \u0026 Scottsdale, more biz planning \u0026 ultra-high net worth trained financial advisors.","url":"https://finance.yahoo.com/news/ubs-expands-wealth-management-capabilities-150000230.html"},{"category":"company","date":1702302060,"headline":"UBS and Credit Suisse Agree to Merge Their Parent Banks","id":124441210,"image":"https://media.zenfs.com/en/zacks.com/b7bb4f736664e55f42e44a6643a3724c","symbol":"UBS","publisher":"Yahoo","summary":"UBS Group AG (UBS) and Credit Suisse approve the merger between their parent banks, which is expected to be completed in 2024.","url":"https://finance.yahoo.com/news/ubs-credit-suisse-agree-merge-134100151.html"},{"category":"company","date":1702294560,"headline":"If You Invested $1000 In This Stock 5 Years Ago, You Would Have $2,300 Today","id":124446303,"image":"","symbol":"UBS","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3251636490"},{"category":"company","date":1702285320,"headline":"UBS expands Wealth Management capabilities in Arizona","id":124446305,"image":"","symbol":"UBS","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3251427110"},{"category":"company","date":1702142443,"headline":"UBS taps JPMorgan’s Rueger as co-head of equity capital markets","id":124414171,"image":"https://s.yimg.com/ny/api/res/1.2/tQuZWFohSzzbJkZFsUrBlQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_markets_842/5d3d76d592460e149bbf3957286c1ce9","symbol":"UBS","publisher":"Yahoo","summary":"(Bloomberg) -- UBS Group AG has hired JPMorgan Chase \u0026 Co. veteran Tommy Rueger as global co-head of equity capital markets, according to people with knowledge of the matter.","url":"https://finance.yahoo.com/news/ubs-taps-jpmorgan-rueger-co-172043383.html"},{"category":"company","date":1702123202,"headline":"UBS hit with $400mn of Credit Suisse-linked property costs","id":124414172,"image":"","symbol":"UBS","publisher":"Yahoo","summary":"UBS has been hit with $400mn of real estate costs tied to its takeover of Credit Suisse, including breaking leases on offices occupied by its defunct rival.  UBS has begun transferring thousands of Credit Suisse staff to its own buildings and removing the fallen bank’s logos from its UK headquarters in Canary Wharf and New York head office in Madison Avenue.  The Swiss lender has taken a $200mn expense on the Credit Suisse leases for 2022 and another for 2023, according to a filing to US Securities and Exchange Commission published on Friday.","url":"https://finance.yahoo.com/m/77d34d5b-f36d-3a7c-9de4-c3a8ca293a83/ubs-hit-with-%24400mn-of-credit.html"},{"category":"company","date":1702036860,"headline":"What Is Spoofing? Mullen Seeks Federal Charges for Alleged Market Manipulation.","id":124393398,"image":"","symbol":"UBS","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3248096806"},{"category":"company","date":1701966905,"headline":"12 Biggest Financial Scandals in US History","id":124361219,"image":"https://media.zenfs.com/en/insidermonkey.com/a9feb25bae315080cc13bef05781cb50","symbol":"UBS","publisher":"Yahoo","summary":"In this article, we will be taking a look at the 12 biggest financial scandals in U.S. history. To skip our detailed analysis, you can go directly to see the 5 biggest financial scandals in U.S. history. There are few things as serious as a major financial scandal, which don’t just threaten the reputation and […]","url":"https://finance.yahoo.com/news/12-biggest-financial-scandals-us-163505711.html"},{"category":"company","date":1701966660,"headline":"UBS (UBS) Up 12.3% Since Last Earnings Report: Can It Continue?","id":124380580,"image":"https://media.zenfs.com/en/zacks.com/b9775f315e7b6c4ada6e36d0048a929a","symbol":"UBS","publisher":"Yahoo","summary":"UBS (UBS) reported earnings 30 days ago. What's next for the stock? We take a look at earnings estimates for some clues.","url":"https://finance.yahoo.com/news/ubs-ubs-12-3-since-163100284.html"},{"category":"company","date":1701955527,"headline":"UBS moves to merge parent banks","id":124361220,"image":"https://media.zenfs.com/en/reuters-finance.com/df14478de1652b3ee354d7f3b1fc6c93","symbol":"UBS","publisher":"Yahoo","summary":"ZURICH (Reuters) -UBS has formally begun the integration of Credit Suisse's parent bank, the Swiss bank said, marking a key next step in what is the first merger of two global systemically important banks.  UBS said its board of directors had given the green light for the respective parent banks, UBS AG and Credit Suisse AG, to fuse.  The move will mean that Credit Suisse will no longer function as an independent bank and will allow for the first waves of client migration in its core businesses.","url":"https://finance.yahoo.com/news/ubs-moves-merge-parent-banks-132527963.html"},{"category":"company","date":1701938340,"headline":"UBS Board Approves Merger of UBS AG, Credit Suisse AG Subsidiaries","id":124420798,"image":"https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png","symbol":"UBS","publisher":"MarketWatch","summary":"By Adria Calatayud UBS Group's board approved a merger between its UBS AG and Credit Suisse AG subsidiaries, as the integration process following the...","url":"https://www.marketwatch.com/story/ubs-board-approves-merger-of-ubs-ag-credit-suisse-ag-subsidiaries-898c5369"},{"category":"company","date":1701936300,"headline":"UBS, Credit Suisse enter into definitive merger agreement","id":124359965,"image":"","symbol":"UBS","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3245915050"},{"category":"company","date":1701897743,"headline":"Tracking Dan Loeb's Third Point Portfolio - Q3 2023 Update","id":124351130,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1087133986/image_1087133986.jpg?io=getty-c-w1536","symbol":"UBS","publisher":"SeekingAlpha","summary":"Dan Loeb's 3Q2023 portfolio value decreased by 3%, with top holdings making up 34%. Third Point's return was -0.9% vs. -3.3% for S\u0026P 500. Read more here.","url":"https://seekingalpha.com/article/4656448-dan-loebs-third-point-portfolio-q3-2023-update"},{"category":"company","date":1701892800,"headline":"ACADEMY AWARD NOMINEE AVA DuVERNAY'S ACCLAIMED NEW FILM ORIGIN HONORED WITH WEEKEND OF CELEBRATION AT ART BASEL MIAMI IN PARTNERSHIP WITH TRIBECA FESTIVAL AND UBS","id":124351965,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"UBS","publisher":"Yahoo","summary":"The acclaimed new film ORIGIN from Academy Award nominee Ava DuVernay will be honored with a weekend of celebration at Art Basel Miami in partnership with Tribeca Festival and UBS. Highlighting the intersection of art, music and film, the highly anticipated events will take place on December 8th in Miami Beach for a private screening and at the Regal South Beach on December 9 at 1pm ET for a public screening. UBS, a leading global wealth manager and Global Lead Partner for Art Basel, serves as t","url":"https://finance.yahoo.com/news/academy-award-nominee-ava-duvernays-200000357.html"},{"category":"company","date":1701882000,"headline":"UBS declares coupon payments on 5 ETRACS Exchange Traded Notes","id":124336984,"image":"https://media.zenfs.com/en/business-wire.com/7ecef286a1b8126f9fc5e8320a18dd3a","symbol":"UBS","publisher":"Yahoo","summary":"NEW YORK, December 06, 2023--UBS Investment Bank today announced coupon payments for 5 ETRACS Exchange Traded Notes (the \"ETNs\"), all traded on the NYSE Arca.","url":"https://finance.yahoo.com/news/ubs-declares-coupon-payments-5-170000952.html"},{"category":"company","date":1701844740,"headline":"RBC Capital Reaffirms Their Buy Rating on UBS Group AG (UBS)","id":124335799,"image":"","symbol":"UBS","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3243929658"},{"category":"company","date":1701784800,"headline":"NFL Players Association names UBS an Institutional Financial Advisor","id":124305320,"image":"https://media.zenfs.com/en/business-wire.com/238a52cc81ebac6d16c51ece1b715d57","symbol":"UBS","publisher":"Yahoo","summary":"NEW YORK, December 05, 2023--UBS today announced that it has been named an Institutional Financial Advisor of the NFL Players Association (\"NFLPA\"), the official union of professional football players in the National Football League. With this program, select UBS Financial Advisors, in coordination with the firm’s Athletes and Entertainers group, will provide holistic financial advice and guidance to current and retired NFL players to help them build their financial futures and create lasting le","url":"https://finance.yahoo.com/news/nfl-players-association-names-ubs-140000827.html"},{"category":"company","date":1701762120,"headline":"UBS downgraded to Neutral at BofA on weight of Credit Suisse integration costs","id":124303929,"image":"","symbol":"UBS","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3242154980"},{"category":"company","date":1701747480,"headline":"UBS just downgraded at BofA, here's why","id":124303930,"image":"","symbol":"UBS","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3241937109"},{"category":"company","date":1701743340,"headline":"House financial panel chief McHenry won’t seek re-election, as Democrats could win control of chamber next year","id":124315776,"image":"","symbol":"UBS","publisher":"MarketWatch","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3242705325"},{"category":"company","date":1701701280,"headline":"Advisor Andrea Freiman joins UBS Private Wealth Management in Miami","id":124294418,"image":"https://media.zenfs.com/en/business-wire.com/dbcb21d1a19d7d3a327510beeeb83d11","symbol":"UBS","publisher":"Yahoo","summary":"MIAMI, December 04, 2023--UBS Private Wealth Management today announced that Andrea Freiman, CFP®, has joined the firm as a Financial Advisor in South Florida. She joins the UBS Miami Private Wealth Management market, led by Brad Rosenberg, and will be located in the Coral Gables office. Prior to joining UBS, Andrea was a senior banker at J.P. Morgan Private Bank, where she advised ultra high net worth families in the U.S. and Latin America for over a decade.","url":"https://finance.yahoo.com/news/advisor-andrea-freiman-joins-ubs-144800823.html"},{"category":"company","date":1701692040,"headline":"What You Missed On Wall Street This Morning","id":124281932,"image":"","symbol":"UBS","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3240766669"},{"category":"company","date":1701666007,"headline":"UBS sells Credit Suisse jet used by Horta-Osório during Covid breaches","id":124274731,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"UBS","publisher":"Yahoo","summary":"UBS has sold the Credit Suisse corporate jet that the collapsed bank’s then-chair, António Horta-Osório, used when breaching Covid lockdown rules to attend high-profile sporting events.  The Dassault Falcon 7X was sold in recent weeks to a German subsidiary of French bank Société Générale that specialises in aircraft leasing, ownership documents seen by the Financial Times show.  People with knowledge of the decision said the sale had been planned by Credit Suisse’s management team before its rescue by UBS this year.","url":"https://finance.yahoo.com/m/eb5176f4-b07c-30aa-9b17-9b8834b44977/ubs-sells-credit-suisse-jet.html"},{"category":"company","date":1701660660,"headline":"What You Missed On Wall Street On Monday","id":124288937,"image":"","symbol":"UBS","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3241039003"},{"category":"company","date":1701658860,"headline":"UBS eyes wealth management US growth, sells former Credit Suisse jet","id":124275227,"image":"https://images.fnlondon.com/im-895200/?width=749\u0026height=499","symbol":"UBS","publisher":"DowJones","summary":"Asset management boss says 'heavy' investment is planned to try and compete with Wall Street","url":"https://www.fnlondon.com/articles/ubs-eyes-us-growth-sells-former-credit-suisse-jet-20231204"},{"category":"company","date":1701591120,"headline":"UBS said to expand presence in U.S. market, Reuters reports","id":124264475,"image":"","symbol":"UBS","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3239510394"},{"category":"company","date":1701402780,"headline":"Daniel Loeb's Third Point 3rd-Quarter Investor Letter: An Update","id":124236464,"image":"","symbol":"UBS","publisher":"GuruFocus","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3237499932"},{"category":"company","date":1701396540,"headline":"3 Top-Rated ESG Stocks That Analysts Are Loving Now","id":124236482,"image":"","symbol":"UBS","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3237361168"},{"category":"company","date":1701393960,"headline":"UBS Group AG (UBS) Gets a Buy from Goldman Sachs","id":124229085,"image":"","symbol":"UBS","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3236574659"},{"category":"company","date":1701373653,"headline":"Tracking Stanley Druckenmiller's Duquesne Family Office Portfolio - Q3 2023 Update","id":124217095,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/495501702/image_495501702.jpg?io=getty-c-w1536","symbol":"UBS","publisher":"SeekingAlpha","summary":"Read here for latest changes in Duquesne Family Office's portfolio as top holdings remain strong while new stakes in tech giants emerge.","url":"https://seekingalpha.com/article/4655299-tracking-stanley-druckenmillers-duquesne-family-office-portfolio-q3-2023-update"},{"category":"company","date":1701368940,"headline":"Advisors Charlie Medelberg and Stacey Koziatek join UBS in Chesterfield, Missouri","id":124218153,"image":"https://media.zenfs.com/en/business-wire.com/731a41238f3ad16c47c2995bd27191e2","symbol":"UBS","publisher":"Yahoo","summary":"CHESTERFIELD, Mo., November 30, 2023--UBS Wealth Management USA today announced that Charlie Medelberg and Stacey Koziatek, The Medelberg Group, have joined the firm as Financial Advisors. They join the UBS Midwest Wealth Management Market, managed by Michael Mimick, and will be located in the Chesterfield, MO office, reporting to Gary Wideman. Together, Charlie and Stacy manage $275 million in client assets and have over 60 years of experience advising high-net-worth individuals, families and b","url":"https://finance.yahoo.com/news/advisors-charlie-medelberg-stacey-koziatek-182900751.html"},{"category":"company","date":1701338999,"headline":"New billionaire heirs overtake self-made ones as $5.2 trillion wealth transfer begins","id":124196476,"image":"https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-125033823-20231130132025001.jpg?c=16x9\u0026q=w_800,c_fill","symbol":"UBS","publisher":"Yahoo","summary":"Billionaires minted in the latest year accumulated more wealth through inheritance than entrepreneurship for the first time since UBS started tracking the fortunes of the world’s richest almost a decade ago.","url":"https://www.cnn.com/2023/11/30/business/ubs-billionaires-report?cid=external-feeds_iluminar_yahoo\u0026amp;.tsrc=rss"},{"category":"company","date":1701329580,"headline":"7 Top-Rated Blue-Chip Stocks That Analysts Are Loving Now","id":124200441,"image":"","symbol":"UBS","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3234982687"},{"category":"company","date":1701311160,"headline":"UBS Group AG (UBS) Receives a Buy from J.P. Morgan","id":124205931,"image":"","symbol":"UBS","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3234703946"}]}