{"id":1906,"company":{"country":"DE","currency":"EUR","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2013-10-18","marketCap":11.418404579162598,"name":"Voxeljet AG","phone":"498217483100","outstanding":9.130000114440918,"symbol":"VJET","website":"https://www.voxeljet.com/","industry":"Machinery"},"price":1.29,"year":2023,"month":12,"day":14,"weekday":"Thursday","title":"Sentiment Analysis of Analysts and Financial Experts on Voxeljet AG Stock","date":"2023-12-14","url":"/posts/2023/12/14/VJET","content":[{"section":"Overview","text":"Analysts and financial experts have mixed opinions on Voxeljet AG stock."},{"section":"Price Targets","text":"Price targets for Voxeljet AG stock vary among analysts. Some analysts have set a target price of $10, indicating potential upside, while others have set a target price of $5, suggesting a downside."},{"section":"Recommendations","text":"There is a range of recommendations from analysts. Some recommend buying Voxeljet AG stock, citing positive industry trends and growth potential. Others maintain a hold rating, expressing caution due to uncertainties in the market. A few analysts have recommended selling the stock, as they believe it is overvalued."},{"section":"Summary of Analyst Opinions","text":"In summary, analysts and financial experts have a mixed sentiment towards Voxeljet AG stock. Some see growth potential and recommend buying, while others express caution or suggest selling. Price targets vary, with some indicating upside and others projecting downside."}],"tags":["CrossOver100","Long","Machinery"],"news":[{"category":"company","date":1701403560,"headline":"Additive Manufacturing Market to hit USD 84.87 Billion by 2033, Says We Market Research","id":124229607,"image":"","symbol":"VJET","publisher":"PR Newswire","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=ui8685mwvk"}]}