{"id":141,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2017-07-21","marketCap":657.09,"name":"PetIQ Inc","phone":"12089398900.0","outstanding":29.42,"symbol":"PETQ","website":"https://petiq.com/","industry":"Health Care"},"price":22.16625,"year":2023,"month":10,"day":11,"weekday":"Wednesday","title":"Corporate Governance Practices of PetIQ Inc","date":"2023-10-11","url":"/posts/2023/10/11/PETQ","content":[{"section":"Board Composition","text":"PetIQ Inc's board of directors is composed of nine members, including the CEO and eight independent directors. The CEO also serves as the Chairman of the board. The board consists of individuals with diverse backgrounds and expertise, including healthcare, finance, and retail. This composition ensures a broad range of perspectives and skillsets are represented."},{"section":"Independent Directors","text":"PetIQ Inc has a majority of independent directors on its board, which promotes unbiased decision-making and reduces potential conflicts of interest. The independent directors contribute to the effective oversight of management and ensure that the interests of shareholders are adequately represented."},{"section":"Committees","text":"The board of PetIQ Inc has established various committees to enhance governance and oversight. These committees include an Audit Committee, Compensation Committee, Nominating and Corporate Governance Committee, and a Compliance Committee. Each committee is comprised of independent directors and performs specific functions to strengthen transparency, accountability, and compliance within the organization."},{"section":"Executive Compensation","text":"PetIQ Inc's executive compensation program is designed to align the interests of executives with those of shareholders. It includes a mix of salary, annual bonuses, and long-term incentives such as stock options. The compensation program is overseen by the Compensation Committee, which carefully reviews and approves executive compensation to ensure it is reasonable, competitive, and performance-based."},{"section":"Shareholder Engagement","text":"PetIQ Inc actively engages with its shareholders through regular communication and annual meetings. The company provides comprehensive reports on its financial performance, corporate governance practices, and strategic initiatives. Shareholders are encouraged to voice their opinions and concerns, promoting transparency and accountability."},{"section":"Risk Management","text":"PetIQ Inc has implemented robust risk management practices to identify, assess, and mitigate various risks that could impact the company's performance. The board oversees the risk management process and works closely with management to ensure effective risk mitigation strategies are in place."},{"section":"Ethics and Compliance","text":"PetIQ Inc places a strong emphasis on ethical conduct and compliance with applicable laws and regulations. The company has a Code of Business Conduct and Ethics that all directors, officers, and employees must adhere to. Regular training programs and internal controls are implemented to promote a culture of integrity and compliance."},{"section":"Conclusion","text":"Overall, PetIQ Inc demonstrates strong corporate governance practices through its diverse board composition, majority of independent directors, well-established committees, and shareholder engagement efforts. The company's executive compensation program aligns with shareholder interests, and robust risk management and compliance measures further enhance governance. PetIQ Inc's commitment to transparency, accountability, and ethical conduct contributes to its effective governance."}],"tags":["stock","Long","Health Care"],"news":[{"category":"company","date":1696447455,"headline":"PetIQ Inc - (PETQ) Price Target Increased by 6.67% to 29.92","id":122960832,"image":"","symbol":"PETQ","publisher":"Fintel","summary":"","url":"https://fintel.io/news/petiq-inc-petq-price-target-increased-by-667-to-2992-499"},{"category":"company","date":1696315494,"headline":"Truist Securities Maintains PetIQ Inc - (PETQ) Buy Recommendation","id":122920887,"image":"","symbol":"PETQ","publisher":"Fintel","summary":"","url":"https://fintel.io/news/truist-securities-maintains-petiq-inc-petq-buy-recommendation-663"},{"category":"company","date":1696244100,"headline":"PetIQ price target raised to $30 from $25 at Truist","id":122911089,"image":"","symbol":"PETQ","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3141973770"}]}