{"id":1075,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"1990-11-15","marketCap":274.0616149902344,"name":"Northrim BanCorp Inc","phone":"19075620062.0","outstanding":5.550000190734863,"symbol":"NRIM","website":"https://ir.northrim.com/corporate-information/investor-information/default.aspx","industry":"Banking"},"price":48.8275,"year":2023,"month":11,"day":21,"weekday":"Tuesday","title":"Corporate Governance Practices of Northrim BanCorp Inc","date":"2023-11-21","url":"/posts/2023/11/21/NRIM","content":[{"section":"Board Composition","text":"Northrim BanCorp Inc has a diverse board composition with a mix of independent and non-independent directors. The board is responsible for overseeing the company's strategic direction and overall performance. The board includes members with diverse backgrounds and expertise, which brings a range of perspectives to the decision-making process. The board also consists of several committees that focus on specific areas such as audit, compensation, and governance."},{"section":"Executive Compensation","text":"The executive compensation practices of Northrim BanCorp Inc are designed to align the interests of executives with those of shareholders and to attract and retain top talent. The compensation packages include a combination of base salary, annual incentives, and long-term incentives such as stock options or restricted stock units. The company sets performance targets and evaluates executive performance against these targets. The compensation committee reviews and approves executive compensation to ensure it is competitive within the industry and reflects the company's performance."},{"section":"Governance Policies","text":"Northrim BanCorp Inc has implemented various governance policies to promote transparency, accountability, and ethical conduct. The company has a code of conduct that outlines the expected behavior of directors, officers, and employees. The company also has a policy on conflicts of interest to ensure that directors and executives act in the best interest of the company and its shareholders. Additionally, Northrim BanCorp Inc has established whistleblower protection mechanisms to encourage employees to report any suspected wrongdoings without fear of retaliation."},{"section":"Shareholder Engagement","text":"Northrim BanCorp Inc values shareholder engagement and recognizes the importance of shareholder feedback. The company regularly communicates with shareholders through annual general meetings, quarterly earnings calls, and other investor events. The board and management team actively listen to shareholder concerns and take them into account when making decisions. Shareholders are also given the opportunity to vote on important matters, such as the election of directors and executive compensation, through proxy voting."},{"section":"Risk Oversight","text":"Northrim BanCorp Inc has a strong focus on risk oversight and management. The board and its committees regularly review and discuss the company's risk profile, including financial, operational, and strategic risks. The company has implemented robust risk management processes and internal controls to identify, assess, and mitigate risks. The audit committee plays a key role in overseeing the company's financial reporting and internal controls to ensure the accuracy and reliability of financial information."},{"section":"Stakeholder Engagement","text":"Northrim BanCorp Inc recognizes the importance of engaging with various stakeholders, including employees, customers, and communities. The company actively communicates with employees through regular updates, town hall meetings, and feedback channels. Northrim BanCorp Inc also values its customers and strives to provide excellent customer service. The company supports community initiatives and participates in philanthropic activities to contribute positively to the communities it operates in."},{"section":"Board Independence","text":"Northrim BanCorp Inc emphasizes the importance of board independence and has a majority of independent directors on its board. Independent directors are not affiliated with the company or its management, which ensures they can provide unbiased judgment and decision-making. The independent directors play a crucial role in overseeing management and protecting the interests of shareholders. The company regularly assesses the independence of its directors and discloses any relationships or transactions that could compromise independence."},{"section":"Conclusion","text":"Overall, Northrim BanCorp Inc demonstrates strong corporate governance practices through its diverse board composition, executive compensation alignment, governance policies, shareholder and stakeholder engagement, risk oversight, and board independence. The company's commitment to transparency, accountability, and ethical conduct positions it well for long-term success and value creation for its shareholders."}],"tags":["CrossOver55","Long","Banking"],"news":[{"category":"company","date":1699982405,"headline":"Can Northrim (NRIM) Run Higher on Rising Earnings Estimates?","id":123884364,"image":"https://media.zenfs.com/en/zacks.com/078b2d95159d12a337f09f2519ff10ba","symbol":"NRIM","publisher":"Yahoo","summary":"Northrim (NRIM) shares have started gaining and might continue moving higher in the near term, as indicated by solid earnings estimate revisions.","url":"https://finance.yahoo.com/news/northrim-nrim-run-higher-rising-172005588.html"}]}