{"id":2520,"company":{"country":"BE","currency":"EUR","exchange":"NYSE EURONEXT - EURONEXT BRUSSELS","ipo":"2012-01-23","marketCap":2687.2734375,"name":"Solvay SA","phone":"3222642111","outstanding":103.76824951171875,"symbol":"SLVYY","website":"https://www.solvay.com/en/","industry":"Chemicals"},"price":12.6575,"year":2023,"month":12,"day":22,"weekday":"Friday","title":"Financial Performance of Solvay SA Stock","date":"2023-12-22","url":"/posts/2023/12/22/SLVYY","content":[{"section":"Revenue","text":"Solvay SA has shown steady revenue growth over the past five years. In 2020, the company reported revenue of €9.97 billion, an increase of 2.3% compared to the previous year. This growth can be attributed to the company's focus on strategic acquisitions and expansion into emerging markets."},{"section":"Earnings","text":"While Solvay SA has experienced revenue growth, its earnings have been declining in recent years. In 2020, the company reported a net loss of €517 million, a significant decrease compared to a net profit of €347 million in the previous year. This decline in earnings can be attributed to several factors, including higher raw material costs, unfavorable exchange rates, and the impact of the COVID-19 pandemic on global demand."},{"section":"Cash Flow","text":"The cash flow of Solvay SA has been inconsistent in recent years. In 2020, the company reported operating cash flow of €1.35 billion, a decrease of 11.5% compared to the previous year. This decline can be attributed to lower earnings and increased working capital requirements. However, the company has maintained a positive free cash flow, which indicates its ability to generate cash after meeting capital expenditures."},{"section":"Conclusion","text":"Overall, Solvay SA has shown positive revenue growth in recent years, driven by strategic acquisitions and expansion into emerging markets. However, the company has experienced declining earnings due to various factors including higher costs and the impact of the COVID-19 pandemic. The cash flow has been inconsistent but remains positive, indicating the company's ability to generate cash. Investors should closely monitor Solvay SA's financial performance and assess its ability to improve earnings and maintain a steady cash flow."}],"tags":["CrossOver21","Long","Chemicals"],"news":[{"category":"company","date":1703057400,"headline":"Participation Notification by Blackrock Inc.","id":124631847,"image":"https://media.zenfs.com/en/globenewswire.com/003eaf968cb5fd197d18bc7cd02e2c3b","symbol":"SLVYY","publisher":"Yahoo","summary":"Regulated information Brussels, December 20, 2023, 08:30 CET According to Belgian transparency legislation (Law of May 2, 2007), BlackRock Inc. (50 Hudson Yards, New York, NY, 10001, U.S.A.) recently sent to Solvay the following transparency notification indicating that it crossed the threshold of 3%. Here is a summary of the move: The notification, dated December 14, 2023, contains the following information: Reason for the notification: acquisition or disposal of voting securities or voting rig","url":"https://finance.yahoo.com/news/participation-notification-blackrock-inc-073000016.html"},{"category":"company","date":1703057400,"headline":"Solvay 2024 Financial Calendar","id":124631846,"image":"","symbol":"SLVYY","publisher":"Yahoo","summary":"Regulated information Brussels, December 20, 2023, 08:30 CET Solvay today publishes its 2024 financial calendar and invites the financial community to mark their calendar accordingly. Event Date Full year 2023 earnings March 13, 2024 First quarter 2024 earnings May 7, 2024 Ordinary General Shareholders’ Meeting May 28, 2024 First half year 2024 earnings July 31, 2024 First nine months 2024 earnings November 6, 2024 Quiet period dates will be provided prior to each earnings’ season.We invite you","url":"https://finance.yahoo.com/news/solvay-2024-financial-calendar-073000502.html"},{"category":"company","date":1702401687,"headline":"Syensqo and Solvay’s $1.7 Billion Surge Makes Case for Spinoffs","id":124462511,"image":"https://s.yimg.com/ny/api/res/1.2/m0VxQdue8PS2zfawzY6jBg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03ODE-/https://media.zenfs.com/en/bloomberg_markets_842/126d72a865c898c1e1b1d0a7853e746a","symbol":"SLVYY","publisher":"Yahoo","summary":"(Bloomberg) -- A €1.6 billion ($1.7 billion) increase in the combined market value of Solvay SA and its Syensqo SA business has strengthened the appeal of spinoffs, as conglomerates weigh strategic options in lieu of tapping the near-dormant initial public offerings market. Most Read from BloombergJPMorgan Is in a Fight Over Its Client’s Lost $50 Million FortuneGoldman Trader Who Was Paid $100 Million Since 2020 to Step DownRaimondo Vows ‘Strongest Possible’ Action on Huawei’s Chip BreakthroughA","url":"https://finance.yahoo.com/news/syensqo-solvay-1-7-billion-172127048.html"},{"category":"company","date":1702315260,"headline":"Basic Materials Roundup: Market Talk","id":124439221,"image":"https://s.yimg.com/ny/api/res/1.2/_0nSO2tCNGAUei3lJRFOyQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/ea9370ff148e5f2af400cad6abde7b14","symbol":"SLVYY","publisher":"Yahoo","summary":"Gain insight on Anglo American, Syensqo, and more in the latest Market Talks covering Basic Materials.","url":"https://finance.yahoo.com/m/9e56edd4-51a2-3da7-9c81-f03ef46a2e43/basic-materials-roundup%3A.html"},{"category":"company","date":1702290966,"headline":"Syensqo Spinoff Starts Trading at Almost €10 Billion Value","id":124439222,"image":"https://s.yimg.com/ny/api/res/1.2/jrbTYH8rKR928gpXxV.9wg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_markets_842/6f3416b57b7d87f958f0373516244980","symbol":"SLVYY","publisher":"Yahoo","summary":"(Bloomberg) -- Syensqo SA, a chemicals maker carved out from Solvay SA, began trading Monday with an equity value just shy of €10 billion ($10.8 billion), in one of the largest spinoffs in Europe this year. Most Read from BloombergAbu Dhabi Is the World’s Newest Wealth Haven for BillionairesJack Ma’s Biggest E-Commerce Rival Is Coming for AmazonBitcoin’s 2023 Rally Frays During Brief 7.5% Drop Toward $40,000India Court Upholds Modi’s Move to Scrap Kashmir’s AutonomyA Record High Is in the Cards","url":"https://finance.yahoo.com/news/syensqo-spinoff-starts-trading-almost-103606220.html"},{"category":"company","date":1702284540,"headline":"Syensqo successfully launched on Euronext","id":124439223,"image":"https://media.zenfs.com/en/globenewswire.com/003eaf968cb5fd197d18bc7cd02e2c3b","symbol":"SLVYY","publisher":"Yahoo","summary":"Syensqo successfully launched on Euronext The company starts its journey as one of the largest publicly traded specialty companies in the world, focused on innovation and growth Brussels, December 11, 2023 - 9:30 CET Today, Syensqo announces the successful listing of its shares on Euronext Brussels and Euronext Paris under ticker SYENS. After the successful completion of the spin-off from Solvay, the listing marks a historical milestone as the company embarks on an exciting, innovation-driven jo","url":"https://finance.yahoo.com/news/syensqo-successfully-launched-euronext-084900526.html"},{"category":"company","date":1702279800,"headline":"Solvay marks new era after successful Syensqo spin-off","id":124439224,"image":"https://s.yimg.com/ny/api/res/1.2/2BgIbm0Lx9g2d4VRwYrKnQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0xNDI0/https://media.zenfs.com/en/globenewswire.com/772dd3b81037164cf3ae8c2d01fb989d","symbol":"SLVYY","publisher":"Yahoo","summary":"Entering a new chapter, Solvay aims to establish itself as a leading industry benchmark in essential chemicals, setting high standards in decarbonization and social responsibility. Brussels, December 11, 2023 - 8:30 CET Solvay has successfully completed the spin-off of its Specialty activities to Syensqo, a pivotal moment in its rich history. This move marks a significant strategic shift for the Group, positioning it as a frontrunner in essential chemicals on a global scale. It prepares Solvay t","url":"https://finance.yahoo.com/news/solvay-marks-era-successful-syensqo-073000213.html"},{"category":"company","date":1702269180,"headline":"Solvay Spinoff Syensqo Market Cap Tops $10 Bln in Trading Debut","id":124444935,"image":"https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png","symbol":"SLVYY","publisher":"MarketWatch","summary":"By Adria Calatayud Syensqo, a Belgian chemicals company that was spun out from Solvay, achieved a market capitalization of 9.53 billion euros ($10.26...","url":"https://www.marketwatch.com/story/solvay-spinoff-syensqo-market-cap-tops-10-bln-in-trading-debut-8dd5e9d8"},{"category":"company","date":1702043040,"headline":"Syensqo is born following overwhelming support of shareholders on demerger of Solvay","id":124396091,"image":"https://s.yimg.com/ny/api/res/1.2/2BgIbm0Lx9g2d4VRwYrKnQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0xNDI0/https://media.zenfs.com/en/globenewswire.com/772dd3b81037164cf3ae8c2d01fb989d","symbol":"SLVYY","publisher":"Yahoo","summary":"Press releaseRegulated informationSyensqo is born following overwhelming support of shareholders on demerger of Solvay Solvay’s extraordinary shareholders’ meeting supported the separation with 99.53 % of positive votes, giving official birth to Syensqo Brussels, December, 8, 2023 - 14:30 CET As the Extraordinary General Shareholders’ Meeting of Solvay SA/NV closed today with massive support (+99.53%) of shareholders, Syensqo SA/NV will be officially demerged from Solvay effective at midnight. “","url":"https://finance.yahoo.com/news/syensqo-born-following-overwhelming-support-134400271.html"},{"category":"company","date":1702042740,"headline":"Shareholders overwhelmingly support the creation of two independent companies - Solvay and Syensqo","id":124396092,"image":"https://s.yimg.com/ny/api/res/1.2/2BgIbm0Lx9g2d4VRwYrKnQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0xNDI0/https://media.zenfs.com/en/globenewswire.com/772dd3b81037164cf3ae8c2d01fb989d","symbol":"SLVYY","publisher":"Yahoo","summary":"Press releaseRegulated information Shareholders overwhelmingly support the creation of two independent companies - Solvay and Syensqo Brussels, December 8, 2023 , 14.30 CET Solvay SA/NV held its Extraordinary General Shareholders’ Meeting in Brussels with record shareholder participation. All proposed resolutions were massively approved by shareholders, including the company’s partial demerger. With this clear and positive outcome, the separation of Solvay into two independent companies, the new","url":"https://finance.yahoo.com/news/shareholders-overwhelmingly-support-creation-two-133900032.html"}]}