{"id":1480,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"1981-11-12","marketCap":2326.14,"name":"InterDigital Inc","phone":"13022813600.0","outstanding":26.41,"symbol":"IDCC","website":"https://www.interdigital.com/","industry":"Technology"},"price":106.625,"year":2023,"month":12,"day":9,"weekday":"Saturday","title":"The Influence of Changing Interest from Institutional Investors and Hedge Funds on InterDigital Inc.'s Stock Price","date":"2023-12-09","url":"/posts/2023/12/09/IDCC","content":[{"section":"Introduction","text":"InterDigital Inc. is a technology research and development company that holds significant value in its intellectual property portfolio. As a result, it attracts attention from institutional investors and hedge funds seeking to capitalize on the potential returns of its innovations."},{"section":"The Role of Institutional Ownership","text":"Institutional ownership refers to the shares of a company that are held by institutional investors such as pension funds, mutual funds, and insurance companies. These investors are known for their substantial financial resources and long-term investment strategies. Their interest in InterDigital Inc. often stems from the belief that the company's intellectual property will generate substantial revenues in the future."},{"section":"Impact of Institutional Ownership on Stock Price","text":"The level of institutional ownership can greatly influence the stock price of InterDigital Inc. When institutional investors maintain a high level of interest, it signals confidence in the company's prospects and attracts other investors. This increased demand for the company's shares can lead to a rise in stock price."},{"section":"Changing Interest from Hedge Funds","text":"Beyond institutional investors, hedge funds also play a significant role in influencing the stock price of InterDigital Inc. Unlike institutional investors, hedge funds are known for their shorter-term and more aggressive investment strategies. Hedge funds can quickly capitalize on market fluctuations and generate substantial profits. Their interest in InterDigital Inc. can result in more frequent buying and selling, leading to increased volatility in the stock price."},{"section":"Effects of Changing Interest","text":"When institutional investors or hedge funds alter their positions in InterDigital Inc., it can have a direct impact on the stock price. For instance, if a renowned institutional investor decides to increase their ownership, it can generate positive market sentiment and cause the stock price to rise. Conversely, if a large hedge fund decides to sell off their shares, it may create a negative perception and contribute to a decline in stock price."},{"section":"Market Reaction to Institutional and Hedge Fund Activity","text":"The market often closely monitors the actions of institutional investors and hedge funds in InterDigital Inc. Their investment decisions can influence the overall sentiment towards the company and shape market expectations. When institutional ownership increases, it sends a positive signal to other investors, potentially attracting more buying interest and resulting in a bullish trend in the stock price. Conversely, a decrease in institutional ownership or significant involvement of hedge funds may generate a more cautious outlook among investors, leading to a bearish trend."},{"section":"Conclusion","text":"Institutional investors and hedge funds significantly impact the stock price of InterDigital Inc. through their changing interest and ownership. The level of institutional ownership acts as a measure of market confidence and can lead to increases in stock price. On the other hand, hedge funds' shorter-term strategies and frequent buying and selling activity can contribute to stock price volatility. Understanding the dynamics of institutional and hedge fund involvement in InterDigital Inc. is crucial for market participants looking to assess and predict its stock price movements."}],"tags":["OverBought","Short","Technology"],"news":[{"category":"company","date":1702072380,"headline":"3 Highly Ranked Stocks Reaching Higher Highs in December","id":124406880,"image":"https://media.zenfs.com/en/zacks.com/fd7c04df60389d70a208ca6bd3a4cedd","symbol":"IDCC","publisher":"Yahoo","summary":"Rewarding investors, a few more stocks on the coveted Zacks Rank #1 (Strong Buy) list hit their 52-week highs this week.","url":"https://finance.yahoo.com/news/3-highly-ranked-stocks-reaching-215300322.html"},{"category":"company","date":1702019760,"headline":"Next Big Thing: 3 Stocks to Make You a Millionaire by 2030","id":124390697,"image":"","symbol":"IDCC","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3247757048"},{"category":"company","date":1701955500,"headline":"InterDigital (IDCC) Raises Share Repurchase Tally to $300M","id":124359822,"image":"https://media.zenfs.com/en/zacks.com/560ce7090345bb7408c706b8e0a8c3fc","symbol":"IDCC","publisher":"Yahoo","summary":"InterDigital (IDCC) aims to reward its shareholders with risk-adjusted returns through share repurchases and dividends.","url":"https://finance.yahoo.com/news/interdigital-idcc-raises-share-repurchase-132500363.html"},{"category":"company","date":1701948660,"headline":"InterDigital management to meet virtually with Roth MKM","id":124364651,"image":"","symbol":"IDCC","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3246191222"},{"category":"company","date":1701869400,"headline":"InterDigital Increases Share Repurchase Authorization to $300 Million","id":124332871,"image":"https://media.zenfs.com/en/globenewswire.com/4c06145bd87789fd1d5e940963e2f694","symbol":"IDCC","publisher":"Yahoo","summary":"WILMINGTON, Del., Dec. 06, 2023 (GLOBE NEWSWIRE) -- InterDigital, Inc. (Nasdaq: IDCC), a mobile and video technology research and development company, today announced that the company’s Board of Directors has authorized an increase to the outstanding amount of the company’s existing share repurchase program of approximately $235 million to a total of $300 million, effective as of December 1, 2023. The timing of repurchases and the number of shares of common stock to be repurchased will depend up","url":"https://finance.yahoo.com/news/interdigital-increases-share-repurchase-authorization-133000603.html"},{"category":"company","date":1701855000,"headline":"New Report Highlights Impact of HEVC Codec on Streaming Industry","id":124332872,"image":"https://media.zenfs.com/en/globenewswire.com/4c06145bd87789fd1d5e940963e2f694","symbol":"IDCC","publisher":"Yahoo","summary":"Report from Futuresource explains how HEVC is forecast to become the leading codec to support high-quality streaming contentWILMINGTON, Del., Dec. 06, 2023 (GLOBE NEWSWIRE) -- HEVC is a codec of choice in the streaming industry, according to a new report commissioned by InterDigital, Inc. (Nasdaq: IDCC), a mobile and video technology research and development company, and written by market research firm Futuresource. The report, Spotlight on HEVC: The Codec of Choice for the Video Streaming Indus","url":"https://finance.yahoo.com/news/report-highlights-impact-hevc-codec-093000074.html"},{"category":"company","date":1701849720,"headline":"InterDigital boosts share buyback to $300M","id":124348169,"image":"","symbol":"IDCC","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3244027683"},{"category":"company","date":1701848100,"headline":"InterDigital increases share repurchase authorization to $300M","id":124348170,"image":"","symbol":"IDCC","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3243994315"},{"category":"company","date":1701766800,"headline":"InterDigital’s Joseph Levy Elected to the IEEE Board of Governors","id":124316628,"image":"https://media.zenfs.com/en/globenewswire.com/4c06145bd87789fd1d5e940963e2f694","symbol":"IDCC","publisher":"Yahoo","summary":"WILMINGTON, Del., Dec. 05, 2023 (GLOBE NEWSWIRE) -- InterDigital, Inc. (Nasdaq: IDCC), a mobile and video technology research and development company, announced the election of Joseph Levy, Principal Engineer, to serve as a voting member of the IEEE Standards Association Board of Governors for a two-year term from 2024 to 2025. IEEE is the world’s largest technical professional organization dedicated to advancing technology for the benefit of humanity, and the IEEE Standards Association (IEEE SA","url":"https://finance.yahoo.com/news/interdigital-joseph-levy-elected-ieee-090000222.html"},{"category":"company","date":1701764100,"headline":"'Wait For A Pullback:' Jim Cramer On This Materials Stock Up 35% Over Past Month","id":124303500,"image":"","symbol":"IDCC","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3242196309"},{"category":"company","date":1701680400,"headline":"InterDigital’s Alain Mourad Elected to ETSI Board","id":124273544,"image":"https://media.zenfs.com/en/globenewswire.com/4c06145bd87789fd1d5e940963e2f694","symbol":"IDCC","publisher":"Yahoo","summary":"WILMINGTON, Del., Dec. 04, 2023 (GLOBE NEWSWIRE) -- InterDigital, Inc. (Nasdaq: IDCC), a mobile and video technology research and development company, announced the election of Dr. Alain Mourad, Head of Wireless Lab Europe, to serve on the ETSI Board for the 2024-2026 mandate. ETSI is a European Standards Organization and the regional standards body responsible for telecommunications, broadcasting and other electronic communications networks and services. As a global organization, ETSI provides","url":"https://finance.yahoo.com/news/interdigital-alain-mourad-elected-etsi-090000275.html"},{"category":"company","date":1701438606,"headline":"What Makes InterDigital (IDCC) a Good Fit for 'Trend Investing'","id":124234129,"image":"https://media.zenfs.com/en/zacks.com/ac90b3d74679f6d01a122aa033d8a9a4","symbol":"IDCC","publisher":"Yahoo","summary":"InterDigital (IDCC) could be a solid choice for shorter-term investors looking to capitalize on the recent price trend in fundamentally sound stocks. It is one of the many stocks that passed through our shorter-term trading strategy-based screen.","url":"https://finance.yahoo.com/news/makes-interdigital-idcc-good-fit-135006593.html"},{"category":"company","date":1701430518,"headline":"InterDigital's Mixed Q3: Strong Deals, Organic Growth Concerns","id":124226670,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1488521147/image_1488521147.jpg?io=getty-c-w1536","symbol":"IDCC","publisher":"SeekingAlpha","summary":"InterDigital, Inc. delivered mixed Q3 2023 results, with strong license agreements boosting revenue and free cash flow. Read more about IDCC stock here.","url":"https://seekingalpha.com/article/4655426-interdigitals-mixed-q3-strong-deals-organic-growth-concerns"},{"category":"company","date":1701379800,"headline":"InterDigital Declares Regular Quarterly Cash Dividend","id":124234130,"image":"https://media.zenfs.com/en/globenewswire.com/4c06145bd87789fd1d5e940963e2f694","symbol":"IDCC","publisher":"Yahoo","summary":"WILMINGTON, Del., Nov. 30, 2023 (GLOBE NEWSWIRE) -- InterDigital, Inc. (Nasdaq: IDCC), a mobile and video technology research and development company, today announced that its Board of Directors has declared a regular quarterly cash dividend of $0.40 per share on its common stock, payable on January 24, 2024, to shareholders of record at the close of business on January 10, 2024. About InterDigital® InterDigital develops mobile and video technologies that are at the core of devices, networks, an","url":"https://finance.yahoo.com/news/interdigital-declares-regular-quarterly-cash-213000997.html"},{"category":"company","date":1701354180,"headline":"Zacks.com featured highlights Direct Digital, Manitex, InterDigital, RCM Technologies and Barrett Business Services","id":124200038,"image":"","symbol":"IDCC","publisher":"Yahoo","summary":"Direct Digital, Manitex, InterDigital, RCM Technologies and Barrett Business Services have been highlighted in this Screen of The Week article.","url":"https://finance.yahoo.com/news/zacks-com-featured-highlights-direct-142300306.html"},{"category":"company","date":1701315660,"headline":"InterDigital declares $0.40 dividend","id":124225712,"image":"","symbol":"IDCC","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3235696977"},{"category":"company","date":1701276011,"headline":"IDCC or QCOM: Which Is the Better Value Stock Right Now?","id":124183386,"image":"https://media.zenfs.com/en/zacks.com/432476d296d64c50172213c0415587c9","symbol":"IDCC","publisher":"Yahoo","summary":"IDCC vs. QCOM: Which Stock Is the Better Value Option?","url":"https://finance.yahoo.com/news/idcc-qcom-better-value-stock-164011280.html"},{"category":"company","date":1701258720,"headline":"5 Stocks With Recent Price Strength to Enhance Your Portfolio","id":124167369,"image":"https://media.zenfs.com/en/zacks.com/f8e8dd74fec7b16eb85235be391efa80","symbol":"IDCC","publisher":"Yahoo","summary":"Investors target stocks that are witnessing a bullish run. Some of the stocks seeing price strength are DRCT, MNTX, IDCC, RCMT, BBSI.","url":"https://finance.yahoo.com/news/5-stocks-recent-price-strength-115200924.html"},{"category":"company","date":1701182402,"headline":"Looking for Computer and Technology Stocks? The Zacks Rank Can Help You Find Winners","id":124151302,"image":"https://media.zenfs.com/en/zacks.com/ac90b3d74679f6d01a122aa033d8a9a4","symbol":"IDCC","publisher":"Yahoo","summary":"The Zacks Rank offers investors a way to easily find top-rated stocks and build a winning investment portfolio. Here's why you should take advantage.","url":"https://finance.yahoo.com/news/looking-computer-technology-stocks-zacks-144002490.html"},{"category":"company","date":1701181805,"headline":"Is It Worth Investing in InterDigital (IDCC) Based on Wall Street's Bullish Views?","id":124151303,"image":"https://media.zenfs.com/en/zacks.com/b9775f315e7b6c4ada6e36d0048a929a","symbol":"IDCC","publisher":"Yahoo","summary":"The average brokerage recommendation (ABR) for InterDigital (IDCC) is equivalent to a Buy. The overly optimistic recommendations of Wall Street analysts make the effectiveness of this highly sought-after metric questionable. So, is it worth buying the stock?","url":"https://finance.yahoo.com/news/worth-investing-interdigital-idcc-based-143005304.html"},{"category":"company","date":1701096008,"headline":"Are Computer and Technology Stocks Lagging  InterDigital (IDCC) This Year?","id":124125905,"image":"https://media.zenfs.com/en/zacks.com/f541c90e0d995722d10914cb76a7c653","symbol":"IDCC","publisher":"Yahoo","summary":"Here is how InterDigital (IDCC) and Synopsys (SNPS) have performed compared to their sector so far this year.","url":"https://finance.yahoo.com/news/computer-technology-stocks-lagging-interdigital-144008172.html"},{"category":"company","date":1701096006,"headline":"Here's Why InterDigital (IDCC) is a Strong Value Stock","id":124125907,"image":"https://media.zenfs.com/en/zacks.com/3cb5117fc22f5e37890d1860dcd61f9f","symbol":"IDCC","publisher":"Yahoo","summary":"Whether you're a value, growth, or momentum investor, finding strong stocks becomes easier with the Zacks Style Scores, a top feature of the Zacks Premium research service.","url":"https://finance.yahoo.com/news/heres-why-interdigital-idcc-strong-144006009.html"},{"category":"company","date":1701091805,"headline":"Here's How Much You'd Have If You Invested $1000 in InterDigital a Decade Ago","id":124125908,"image":"https://media.zenfs.com/en/zacks.com/023168c7ea091c342492be3899b280af","symbol":"IDCC","publisher":"Yahoo","summary":"Investing in certain stocks can pay off in the long run, especially if you hold on for a decade or more.","url":"https://finance.yahoo.com/news/heres-much-youd-invested-1000-133005807.html"},{"category":"company","date":1701048660,"headline":"Golden Portfolio: 3 Picks That Could Make You Rich by 2026","id":124258763,"image":"https://media.zenfs.com/en/investorplace_417/6cd4dc2ae01be9f55e6f878d8cccfcc3","symbol":"IDCC","publisher":"Yahoo","summary":"Looking at tech investments, uncovering stocks that yield substantial returns often feels akin to chasing elusive treasures. Amidst this pursuit, three burgeoning companies have emerged as potential goldmines, offering investors promising prospects for exponential growth. These are our picks that could make you rich. Notably, the dynamics within these companies, marked by their strategic prowess, technological innovations, and market adaptability, hint at a future where riches await the insightf","url":"https://finance.yahoo.com/news/golden-portfolio-3-picks-could-013100425.html"}]}