{"id":3176,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2004-08-19","marketCap":1778870,"name":"Alphabet Inc","phone":"16502530000.0","outstanding":12609,"symbol":"GOOGL","website":"https://abc.xyz/","industry":"Media"},"price":150.122,"year":2024,"month":3,"day":23,"weekday":"Saturday","title":"Influence of Geopolitical Events on Alphabet Inc Stock Markets","date":"2024-03-23","url":"/posts/2024/03/23/GOOGL","content":[{"section":"Introduction","text":"Alphabet Inc, the parent company of Google, is a multinational technology conglomerate with a diverse range of business operations. As such, it is influenced by geopolitical events both directly and indirectly. While company-specific factors and market fundamentals play a significant role in shaping Alphabet Inc's stock markets, geopolitical events can have a notable impact on market sentiment, investor confidence, and global economic trends."},{"section":"Trade Wars and Tariffs","text":"Geopolitical events such as trade wars and the imposition of tariffs can significantly affect Alphabet Inc's stock markets. As a multinational company, Alphabet's revenue and operations are spread across various countries. Trade tensions and an increase in protectionist policies can disrupt global supply chains, impact consumer sentiment, and potentially lead to slower economic growth. These factors can generate uncertainties for Alphabet Inc's business prospects and contribute to stock market volatility."},{"section":"Regulatory and Legal Actions","text":"Geopolitical events involving regulatory and legal actions can also influence Alphabet Inc's stock markets. The company faces scrutiny and legal challenges in various jurisdictions related to antitrust, data privacy, and censorship concerns. Investigations, fines, or changes in regulations can impact Alphabet Inc's operations, financial performance, and investor sentiment. News related to regulatory actions can affect the stock markets by creating uncertainties about future business prospects and potential legal liabilities."},{"section":"Political and Economic Instability","text":"Instances of political and economic instability in major markets can have an indirect influence on Alphabet Inc's stock markets. Significant events such as political upheavals, elections, or economic crises can create uncertainties, hinder business activities, and disrupt market conditions. Investor confidence and risk appetite may be affected, leading to increased market volatility and potential fluctuations in Alphabet Inc's stock prices."},{"section":"Technological Policies and Innovation","text":"Geopolitical events related to technological policies and innovation can shape Alphabet Inc's stock markets. Changes in regulations, government support, or geopolitical shifts in technological leadership can impact the company's competitiveness, market access, and growth potential. Positive developments, such as supportive policies or investment incentives, can boost investor confidence and contribute to upward stock market trends for Alphabet Inc."},{"section":"Cybersecurity and Digital Threats","text":"Geopolitical events surrounding cybersecurity and digital threats can have implications for Alphabet Inc's stock markets. High-profile cyberattacks, data breaches, or geopolitical tensions involving cyber warfare can affect investor sentiment and raise concerns about user privacy, data protection, and system vulnerabilities. Such events can lead to a decline in trust, impacting Alphabet Inc's reputation and potentially affecting stock market performance."},{"section":"Currency Exchange Rates","text":"Geopolitical events that lead to currency exchange rate fluctuations can influence Alphabet Inc's stock markets. As a global company, Alphabet Inc operates in various countries, generates revenue in multiple currencies, and faces exposure to foreign exchange risks. Sharp currency fluctuations, prompted by geopolitical events like interest rate changes, political developments, or economic indicators, can impact Alphabet Inc's financials and stock market performance."},{"section":"Conclusion","text":"Geopolitical events can exert an influence on the stock markets of Alphabet Inc, alongside other company-specific factors and market fundamentals. Trade wars, regulatory actions, political instability, technological policies, cybersecurity threats, and currency exchange rate fluctuations are among the key areas where geopolitical events can impact investor sentiment, market volatility, and Alphabet Inc's stock prices. Careful monitoring of geopolitical developments is essential for investors and stakeholders seeking to make informed decisions regarding Alphabet Inc's stock markets."}],"tags":["LongSignals","Long","Media"],"news":[{"category":"company","date":1711177200,"headline":"Google: Future Focus On AI Possibilities","id":126652605,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1488294044/image_1488294044.jpg?io=getty-c-w1536","symbol":"GOOGL","publisher":"SeekingAlpha","summary":"Google stock jumped nearly 5% following reports that Apple was considering using its Gemini AI engine for the iPhone. Read more on Google's AI efforts.","url":"https://seekingalpha.com/article/4680020-google-future-focus-on-ai-possibilities"},{"category":"company","date":1711171629,"headline":"Google Stock May Be At Crossroads","id":126652131,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/501601187/image_501601187.jpg?io=getty-c-w1536","symbol":"GOOGL","publisher":"SeekingAlpha","summary":"Google's Q4'23 report shows a positive business growth. Concerns arise from EU regulations and negative sentiment towards its Gemini language model. Read more.","url":"https://seekingalpha.com/article/4680063-google-stock-may-be-at-a-crossroads"},{"category":"company","date":1711137325,"headline":"Anthropic weighs slate of sovereign wealth funds to acquire FTX's $1 billion stake, CNBC reports","id":126643863,"image":"https://media.zenfs.com/en/reuters-finance.com/28b573c1484dc1e7d1f33cf971d1628b","symbol":"GOOGL","publisher":"Yahoo","summary":"In February, a U.S. judge ruled that bankrupt crypto exchange FTX may sell its shares in Anthropic.  FTX invested $500 million in Anthropic in 2021, and currently holds a 7.84% stake in the company, according to court documents.  FTX and Anthropic did not immediately respond to Reuters' requests for comment.","url":"https://finance.yahoo.com/news/anthropic-weighs-slate-sovereign-wealth-195525972.html"},{"category":"company","date":1711137070,"headline":"UPDATE 1-Anthropic weighs slate of sovereign wealth funds to acquire FTX's $1 bln stake, CNBC reports","id":126643864,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"GOOGL","publisher":"Yahoo","summary":"Anthropic, backed by Google and Amazon.com, is weighing a slate of sovereign wealth funds to acquire FTX's stake of about $1 billion in the AI startup, CNBC reported on Friday citing sources.  In February, a U.S. judge ruled that bankrupt crypto exchange FTX may sell its shares in Anthropic.  FTX invested $500 million in Anthropic in 2021, and currently holds a 7.84% stake in the company, according to court documents.","url":"https://finance.yahoo.com/news/1-anthropic-weighs-slate-sovereign-195110077.html"},{"category":"company","date":1711136952,"headline":"Alphabet named a 'Best Idea' at Wedbush","id":126643865,"image":"https://s.yimg.com/ny/api/res/1.2/Xl4uxbqa01MmWIjjETk9NQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-03/1f9f92f0-e885-11ee-bf1f-57909032c56a","symbol":"GOOGL","publisher":"Yahoo","summary":"Analysts at Wedbush Securities raised their price target on Alphabet (GOOGL, GOOG) to $175 from $160 and moved it to their \"Best Ideas List.\" Analyst Scott Devitt writes that he believes \"the perceived structural risks to Google Search are overstated,\" adding that he believes Google will benefit from AI. Yahoo Finance's Josh Lipton and Julie Hyman discuss the call in the video above. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Stephanie Mikulich.","url":"https://finance.yahoo.com/video/alphabet-named-best-idea-wedbush-194912436.html"},{"category":"company","date":1711134263,"headline":"Analyst unveils Google stock price target after Apple rumors","id":126643866,"image":"","symbol":"GOOGL","publisher":"Yahoo","summary":"Here's what could happen to Google-parent Alphabet's shares next.","url":"https://www.thestreet.com/technology/analyst-unveils-google-stock-price-target-after-apple-rumors"},{"category":"company","date":1711127610,"headline":"Is Alphabet Stock Going to $175? 1 Wall Street Analyst Thinks So.","id":126641566,"image":"https://g.foolcdn.com/editorial/images/770303/ai-face-looming-over-a-man-at-a-computer-screen.jpg","symbol":"GOOGL","publisher":"Yahoo","summary":"Should Alphabet build a better AI, or sell its data to other AI companies? Either way, this stock is a long-term winner.","url":"https://www.fool.com/investing/2024/03/22/wall-street-analyst-says-alphabet-going-to-175/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;.tsrc=rss"},{"category":"company","date":1711126871,"headline":"Apple Reportedly Held Talks With Baidu About AI","id":126641569,"image":"https://media.zenfs.com/en/ibd.com/c2de1e2347e70520c0f731edcdfa6362","symbol":"GOOGL","publisher":"Yahoo","summary":"Baidu stock is up after report Apple held early talks with the Chinese company to use its AI technology for Apple devices.","url":"https://finance.yahoo.com/m/ef0d456a-50e3-3ee3-bc1a-aa7e979e0139/apple-reportedly-held-talks.html"},{"category":"company","date":1711126664,"headline":"Why Alphabet Stock Popped Again Today","id":126641571,"image":"https://g.foolcdn.com/editorial/images/770297/1-glowing-green-stock-arrow-climbs-on-a-stock-screen.jpg","symbol":"GOOGL","publisher":"Yahoo","summary":"Even without AI, there's a lot to like about Alphabet stock.","url":"https://www.fool.com/investing/2024/03/22/why-alphabet-stock-popped-again-today/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;.tsrc=rss"},{"category":"company","date":1711125733,"headline":"UPDATE 2-Elite Russian hackers targeting German politicians, Google warns","id":126641573,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"GOOGL","publisher":"Yahoo","summary":"Elite hackers tied to Russian intelligence last month targeted several German political parties with an eye toward burrowing into their networks and stealing data, according to an alert released by Germany's cybersecurity agency and security researchers working for Google owner Alphabet.  In a report published on Friday, Alphabet's Mandiant cyber unit said it had caught the hacking group known as APT29, which is alleged by Western intelligence to act on behalf of Russia's SVR foreign spy agency, trying to trick \"key German political figures\" into opening an email masquerading as an invitation to a March 1 dinner event hosted by the Christian Democratic Union (CDU), Germany's center-right political party.","url":"https://finance.yahoo.com/news/1-elite-russian-hackers-targeting-164213971.html"},{"category":"company","date":1711122910,"headline":"Apple's Days of Smartphone Monopoly Are Coming To An End","id":126641576,"image":"https://media.zenfs.com/en/Benzinga/c53cdaec7cc3670c30bda7cdc1821f15","symbol":"GOOGL","publisher":"Yahoo","summary":"On Thursday, U.S. the US Justice Department, along with 17 states and districts, filed a blockbuster lawsuit against Apple Inc (NASDAQ: AAPL). Apple has been accused of illegally monopolizing the smartphone market by violating federal antitrust law to stay ahead of its rivals. As a reminder, Apple ended 2023 by dethroning Samsung as the world’s biggest smartphone seller. Samsung led for 12 years, but Apple got the crown after releasing its iPhone 15 in the fall. Apple is well established as the","url":"https://finance.yahoo.com/news/apples-days-smartphone-monopoly-coming-155510508.html"},{"category":"company","date":1711116751,"headline":"Google Stock Price Target Hiked As Analysts Say Investor Sentiment Improving","id":126641578,"image":"","symbol":"GOOGL","publisher":"Yahoo","summary":"Wedbush analysts that upgraded their price target for Google stock cite improving investor sentiment.","url":"https://finance.yahoo.com/m/44fc884d-6181-3640-b6cc-710f4957a031/google-stock-price-target.html"},{"category":"company","date":1711114811,"headline":"Why Alphabet (GOOGL) is a Top Value Stock for the Long-Term","id":126641580,"image":"https://media.zenfs.com/en/zacks.com/f541c90e0d995722d10914cb76a7c653","symbol":"GOOGL","publisher":"Yahoo","summary":"Whether you're a value, growth, or momentum investor, finding strong stocks becomes easier with the Zacks Style Scores, a top feature of the Zacks Premium research service.","url":"https://finance.yahoo.com/news/why-alphabet-googl-top-value-134011458.html"},{"category":"company","date":1711114628,"headline":"United States Vs. Apple: The Winner Could Be You (Rating Upgrade)","id":126639689,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1158890456/image_1158890456.jpg?io=getty-c-w1536","symbol":"GOOGL","publisher":"SeekingAlpha","summary":"DOJ sues Apple Inc. for monopolistic practices; stock drops 15%. Could present a buying opportunity. Click for my AAPL update and a review of its antitrust issues.","url":"https://seekingalpha.com/article/4679965-united-states-vs-apple-the-winner-could-be-you-rating-upgrade"},{"category":"company","date":1711113219,"headline":"Michael Burry’s Top 15 Stock Picks For 2024","id":126635164,"image":"https://s.yimg.com/ny/api/res/1.2/Ek3h0Lc0mAS4fL.Y0DkbLA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0xNTI0/https://media.zenfs.com/en/insidermonkey.com/7983b5a07536da3dd3251b8672f652df","symbol":"GOOGL","publisher":"Yahoo","summary":"In this article, we discuss Michael Burry’s top 15 stock picks for 2024. If you want to see the investor’s top 5 stock picks, head directly to Michael Burry’s Top 5 Stock Picks For 2024. Michael Burry, the founder and manager of Scion Asset Management, increased his investments in Chinese tech giants Alibaba Group Holding […]","url":"https://finance.yahoo.com/news/michael-burry-top-15-stock-131339807.html"},{"category":"company","date":1711098026,"headline":"Microsoft Deal, Apple-Google Talks Show Tech Giants Need AI Help","id":126634044,"image":"https://s.yimg.com/ny/api/res/1.2/oniFY9Q9AnRCJbVx7oYECw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_technology_68/baf6586d77fc1f3cbc98e3ba2a261d9a","symbol":"GOOGL","publisher":"Yahoo","summary":"(Bloomberg) -- Earlier this week, Microsoft Corp. named artificial intelligence pioneer Mustafa Suleyman chief of its consumer AI business and hired most of the staff from his Inflection AI startup. A day before, Bloomberg reported that Alphabet Inc.’s Google was in talks to license its Gemini AI engine to Apple Inc.Most Read from BloombergNY Gears Up to Seize Trump Westchester Assets If Fraud Fine Is UnpaidBaltimore Wants to Sell Hundreds of Vacant Homes for $1 EachYemen’s Houthis Tell China, R","url":"https://finance.yahoo.com/news/tech-giants-seek-partnerships-talent-090026526.html"},{"category":"company","date":1711108800,"headline":"3 Stocks That Could Create Lasting Generational Wealth","id":126635220,"image":"https://g.foolcdn.com/editorial/images/769244/getty-happy-family-mother-father-children-grandparents.jpg","symbol":"GOOGL","publisher":"Yahoo","summary":"These long-term growers are poised to keep growing -- and rewarding shareholders.","url":"https://www.fool.com/investing/2024/03/22/3-stocks-could-create-lasting-generational-wealth/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;.tsrc=rss"},{"category":"company","date":1711108680,"headline":"Alphabet Is a ‘Best Idea,’ at Wedbush. Why the AI Threat to Google Search Is Overstated.","id":126641584,"image":"","symbol":"GOOGL","publisher":"Yahoo","summary":"Alphabet  Google Search faces competitive risks from other generative artificial intelligence players, but one Wedbush analyst says investor concern is exaggerated.  Scott Devitt moved  Alphabet  to the Wedbush Best Ideas List and increased the stock’s price target to $175 from $160.  Google has been the number one search engine for decades.","url":"https://finance.yahoo.com/m/1113d35e-80eb-3b50-ab3f-b68cb96439f1/alphabet-is-a-%E2%80%98best-idea%2C%E2%80%99-at.html"},{"category":"company","date":1711107420,"headline":"OpenAI meets with Hollywood studios, agents to discuss AI partnerships: report","id":126638393,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410511090"},{"category":"company","date":1711106880,"headline":"OpenAI meets with Hollywood studios to pitch Sora AI tool, Bloomberg reports","id":126638394,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410499909"},{"category":"company","date":1711106700,"headline":"DA Davidson software analysts hold an analyst/industry conference call","id":126638395,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410496664"},{"category":"company","date":1711106362,"headline":"The Core Of United States V. Apple","id":126636438,"image":"","symbol":"GOOGL","publisher":"SeekingAlpha","summary":"","url":"https://seekingalpha.com/article/4679916-the-core-of-united-states-v-apple"},{"category":"company","date":1711105547,"headline":"Alphabet: back to all-time highs on a positive note","id":126636302,"image":"","symbol":"GOOGL","publisher":"Finnhub","summary":"Alphabet is up over 2% on Friday morning on the New York Stock Exchange, back towards its all-time highs, buoyed by favorable comments from Wedbush analysts.The research firm said this morning that it...","url":"https://finnhub.io/api/news?id=e9204e81a7cd2c8e7077b26906cf60a48a59c655ce070e4be4c54ec78f92e456"},{"category":"company","date":1711104780,"headline":"2 Top AI Stocks Ready for a Bull Run","id":126641585,"image":"https://g.foolcdn.com/editorial/images/767396/person-in-front-of-multiple-computer-screens-looking-at-stock-graphs.jpg","symbol":"GOOGL","publisher":"Yahoo","summary":"Alphabet and UiPath aren't getting the same level of respect as their peers. That could change.","url":"https://www.fool.com/investing/2024/03/22/2-top-ai-stocks-ready-for-a-bull-run/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;.tsrc=rss"},{"category":"company","date":1711104300,"headline":"Sequoia Fund - Alphabet/Google:  Set To Deliver Large Incremental Value Through World-Class AI","id":126636203,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1919905342/image_1919905342.jpg?io=getty-c-w1536","symbol":"GOOGL","publisher":"SeekingAlpha","summary":"Alphabet is well-positioned to deliver large incremental value by bringing world-class AI to a world-class set of products. Click here for our thesis GOOG/GOOGL.","url":"https://seekingalpha.com/article/4679921-alphabet-google-set-to-deliver-large-incremental-value-through-world-class-ai"},{"category":"company","date":1711102500,"headline":"Google’s AI Ace in the Hole: Could a Mystery Collab Send GOOG Soaring?","id":126638398,"image":"","symbol":"GOOGL","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410412869"},{"category":"company","date":1711101600,"headline":"Sequoia Fund 2023 Year-End Letter","id":126635653,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/850495466/image_850495466.jpg?io=getty-c-w1536","symbol":"GOOGL","publisher":"SeekingAlpha","summary":"Sequoia Fund returned 27.83% in 2023 vs. 26.29% for S\u0026P 500. Since June 2016, Sequoia and S\u0026P 500 have compounded at 11.25% and 13.59%, respectively. Click here to read more.","url":"https://seekingalpha.com/article/4679910-sequoia-fund-2023-year-end-letter"},{"category":"company","date":1711101000,"headline":"Billionaire David Tepper Is Selling Alphabet and Nvidia Hand Over Fist, but Is Buying These \"Magnificent Seven\" Stocks","id":126634007,"image":"https://g.foolcdn.com/editorial/images/769763/data-center-infrastructure-information-technology.jpg","symbol":"GOOGL","publisher":"Yahoo","summary":"Tepper is especially bullish about two members of the \"Magnificent Seven.\"","url":"https://www.fool.com/investing/2024/03/22/david-tepper-alphabet-nvidia-magnificent-seven/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;.tsrc=rss"},{"category":"company","date":1711101000,"headline":"March 2025 Options Now Available For Alphabet (GOOGL)","id":126638399,"image":"","symbol":"GOOGL","publisher":"Stock Options Channel","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410384747"},{"category":"company","date":1711100280,"headline":"Reddit sinks below opening price in second day of trading","id":126638402,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410370473"},{"category":"company","date":1711100280,"headline":"Market Clubhouse Morning Memo - March 22nd, 2024 (Trade Strategy For SPY, QQQ, AAPL, MSFT, NVDA, GOOGL, META, And TSLA)","id":126637887,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410371067"},{"category":"company","date":1711100100,"headline":"RDDT Stock Alert: Get Ready for a Big Pop After the Reddit IPO","id":126638403,"image":"","symbol":"GOOGL","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410367081"},{"category":"company","date":1711099680,"headline":"Wedbush's Dan Ives Bullish On Alphabet, Raises Target Price: 'Perceived Structural Risks To Google Search Are Overstated'","id":126638404,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410358835"},{"category":"company","date":1711098600,"headline":"Apple in talks to use Baidu's AI model for devices in China: report","id":126638405,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410337795"},{"category":"company","date":1711098360,"headline":"Alphabet Class A call volume above normal and directionally bullish","id":126638406,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410334136"},{"category":"company","date":1711097940,"headline":"Apple in talks to use Baidu's AI model for devices in China - report; Morgan Stanley reiterates rating","id":126638408,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410324588"},{"category":"company","date":1711097760,"headline":"Early notable gainers among liquid option names on March 22nd","id":126638409,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410321982"},{"category":"company","date":1711095780,"headline":"Tennessee Governor Bill Lee Signs 'ELVIS Act' Into Law, A Landmark Protection For Artists Against AI","id":126638410,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410285159"},{"category":"company","date":1711095420,"headline":"Vodafone and Three UK Merger Faces CMA Scrutiny Over Competition Concerns","id":126638411,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410279248"},{"category":"company","date":1711095120,"headline":"'Worst case' for Apple-DOJ case is tech giant pays a fine: Bernstein","id":126638412,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410271985"},{"category":"company","date":1711092420,"headline":"Wedbush Reaffirms Their Buy Rating on Alphabet Class A (GOOGL)","id":126638413,"image":"","symbol":"GOOGL","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410223950"},{"category":"company","date":1711092120,"headline":"Apple has held talks with China's Baidu about AI, WSJ reports","id":126638414,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410219244"},{"category":"company","date":1711089240,"headline":"Alphabet gains as Wedbush adds to Best Ideas List, raises price target","id":126638415,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410169827"},{"category":"company","date":1711087320,"headline":"Wedbush ups Alphabet target, adds to 'Best Ideas List'","id":126638416,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410138852"},{"category":"company","date":1711087080,"headline":"Ex-Googlers Claim Gemini AI's 'Unacceptable' Bias Is Direct Result Of Company's 'Woke' Culture","id":126638418,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410133960"},{"category":"company","date":1711086300,"headline":"Sequoia Strategy 2023 Year-End Letter","id":126632979,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1145882183/image_1145882183.jpg?io=getty-c-w1536","symbol":"GOOGL","publisher":"SeekingAlpha","summary":"Sequoia returned 26.3% in 2023 vs. 26.3% for S\u0026P 500. Since June 2016, Sequoia and S\u0026P 500 have compounded at 10.9% \u0026 13.6%, respectively. Click here to read more.","url":"https://seekingalpha.com/article/4679858-sequoia-strategy-2023-year-end-letter"},{"category":"company","date":1711083780,"headline":"Apple’s AI Awakening: Is Google’s Gemini the Spark AAPL Stock Needs?","id":126638419,"image":"","symbol":"GOOGL","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410085136"},{"category":"company","date":1711083000,"headline":"Tim Cook's 'Buy Your Mom An iPhone' Comes Back To Bite Apple In DOJ's Antitrust Lawsuit","id":126638421,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410074564"},{"category":"company","date":1711082760,"headline":"GOOGL, SQ, MSFT: These Stocks Are Leading Hedge Fund Expert’s Top 3 Picks","id":126638424,"image":"","symbol":"GOOGL","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410071477"},{"category":"company","date":1711081440,"headline":"UN adopts 1st global resolution on AI","id":126638425,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3410052048"},{"category":"company","date":1711073830,"headline":"12 Best Alternatives To Audible","id":126630841,"image":"https://s.yimg.com/ny/api/res/1.2/L1VfzT4mG1Rv4M6zH9u5Cg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/ba8bd44a0ab196b25bfaf9408d49d0db","symbol":"GOOGL","publisher":"Yahoo","summary":"In this article, we will take a look at the 12 best alternatives to audible. If you want to skip our detailed analysis, you can go directly to the 5 Best Alternatives To Audible. Global Audiobooks Industry: An Overview Audiobooks have gained massive popularity over the years. Audiobooks offer flexibility enabling the users to enjoy […]","url":"https://finance.yahoo.com/news/12-best-alternatives-audible-021710471.html"},{"category":"company","date":1711072800,"headline":"Italian watchdog's AI staff struggle spotlights global challenge","id":126631273,"image":"","symbol":"GOOGL","publisher":"Finnhub","summary":"Soon after Italianwatchdog Garante took on ChatGPT with a temporary shutdownlocally last year, it tried to strengthen its team by hiringfour artificial intelligence experts. But...","url":"https://finnhub.io/api/news?id=50b545341861c1c3c650672bacf87e88bdace7680fe5e95c4c6e799726b0a333"},{"category":"company","date":1711066502,"headline":"20 Countries with the Worst English Accents in the World","id":126630842,"image":"https://media.zenfs.com/en/insidermonkey.com/eb426d2bb08dd48267d7df73c52972c7","symbol":"GOOGL","publisher":"Yahoo","summary":"In this article, we will look at the 20 countries with the worst English accents in the world. If you want to skip our detailed analysis, you can go directly to the 5 Countries with the Worst English Accents in the World. English is one of the most spoken languages in the world, with approximately […]","url":"https://finance.yahoo.com/news/20-countries-worst-english-accents-001502589.html"},{"category":"company","date":1711061426,"headline":"Here's how Microsoft is providing a 'good outcome' for Inflection AI VCs, as Reid Hoffman promised","id":126630843,"image":"https://techcrunch.com/wp-content/uploads/2021/09/GettyImages-838037008.jpg?resize=1200,675","symbol":"GOOGL","publisher":"Yahoo","summary":"Exactly how much Microsoft is paying all the investors of Inflection AI as part its oddly structured deal to abscond with the co-founders, much of the staff and the rights to use the tech hasn't been publicly revealed. And Microsoft declined comment when asked. But unnamed sources tell The Information that it's plunking out approximately $650 million: $620 million for non-exclusive licensing fees for the technology (meaning Inflection is free to license it elsewhere) and $30 million for Inflecti","url":"https://techcrunch.com/2024/03/21/microsoft-inflection-ai-investors-reid-hoffman-bill-gates/"},{"category":"company","date":1711054539,"headline":"Why China's options in response to a TikTok ban are limited","id":126626150,"image":"https://s.yimg.com/ny/api/res/1.2/aZnDOC4bnRZwBGgh8Q4LXA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-03/35e11fa0-e7bf-11ee-bbb7-40e80acf7b7c","symbol":"GOOGL","publisher":"Yahoo","summary":"China risks alienating much-needed foreign investment should it hit back against the US over a potential ban on TikTok, its social media success story.","url":"https://finance.yahoo.com/news/why-chinas-options-in-response-to-a-tiktok-ban-are-limited-205539981.html"},{"category":"company","date":1711049410,"headline":"California Protestors Set Waymo Self-Driving Car On Fire After String Of Accidents In Latest Protest Against Rise In Self-Driving Cars","id":126622589,"image":"","symbol":"GOOGL","publisher":"Yahoo","summary":"Recent events in California have marked a significant uptick in public unrest concerning the proliferation of autonomous vehicles, culminating in a dramatic episode where a driverless taxi was set ablaze in San Francisco’s Chinatown. The incident is not isolated but part of a growing series of protests that underscore the public’s mixed feelings toward the burgeoning self-driving car industry. In a startling act that caught the attention of both local authorities and national media, a Waymo-oper","url":"https://finance.yahoo.com/news/california-protestors-set-waymo-self-193010640.html"},{"category":"company","date":1711043376,"headline":"15 Dorm Room Business Ideas for College Students","id":126621046,"image":"https://s.yimg.com/ny/api/res/1.2/WJopyP7sLh3OWAWi1BZ9MA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03Mjg-/https://media.zenfs.com/en/insidermonkey.com/d2c73382aef01dbd29c0039c5520c21a","symbol":"GOOGL","publisher":"Yahoo","summary":"In this article, we will take a look at the 15 dorm room business ideas for college students. If you want to skip our detailed analysis, you can go directly to 5 Dorm Room Business Ideas for College Students. The Role of Social Media in Youth Entrepreneurship Social media plays an important role in fueling […]","url":"https://finance.yahoo.com/news/15-dorm-room-business-ideas-174936533.html"},{"category":"company","date":1711042086,"headline":"Reddit IPO: The company is ready for more AI and advertising, says CEO","id":126619236,"image":"https://s.yimg.com/ny/api/res/1.2/VFZaz_EwsKclU09gXFu74w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-03/c97fa9a0-e79e-11ee-bb15-92225f2b6b8e","symbol":"GOOGL","publisher":"Yahoo","summary":"Reddit co-founder and CEO Steve Huffman says profits are in view as the tech company finally goes public.","url":"https://finance.yahoo.com/news/reddit-ipo-the-company-is-ready-for-more-ai-and-advertising-says-ceo-165515262.html"},{"category":"company","date":1711041455,"headline":"15 Top Amazon Web Services Alternatives in 2024","id":126620798,"image":"https://s.yimg.com/ny/api/res/1.2/jES.4QWlDHc9sIS36lXM2g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/98ce5b257a2e848e21ffb1e42a1541ab","symbol":"GOOGL","publisher":"Yahoo","summary":"In this article, we will take a look at the 15 top Amazon Web Services alternatives in 2024. If you want to skip our detailed analysis, you can go directly to 5 Top Amazon Web Services Alternatives in 2024. Optimize Cloud Computing Costs with CAST AI Startups play a major role in cloud consulting and […]","url":"https://finance.yahoo.com/news/15-top-amazon-services-alternatives-171735114.html"},{"category":"company","date":1711039500,"headline":"Cognizant (CTSH) Boosts Developer Productivity with Google Cloud","id":126621049,"image":"","symbol":"GOOGL","publisher":"Yahoo","summary":"Cognizant (CTSH) teams up with Alphabet's cloud business, Google Cloud, to bolster developer productivity through AI-powered software delivery solutions.","url":"https://finance.yahoo.com/news/cognizant-ctsh-boosts-developer-productivity-164500903.html"},{"category":"company","date":1711038790,"headline":"Reddit COO Says Platform ‘Incredibly Important’ for Training AI","id":126621051,"image":"","symbol":"GOOGL","publisher":"Yahoo","summary":"(Bloomberg) -- Reddit Inc. Chief Operating Officer Jen Wong said that the social media site, which will begin trading publicly Thursday, will continue to see its data licensing business grow as artificial intelligence gains traction.Most Read from BloombergNY Gears Up to Seize Trump Westchester Assets If Fraud Fine Is UnpaidBaltimore Wants to Sell Hundreds of Vacant Homes for $1 EachJustice Department to Sue Apple for Antitrust Violations as Soon as ThursdayWhat Happens If Trump Can’t Post His $","url":"https://finance.yahoo.com/news/reddit-coo-says-platform-incredibly-163310790.html"},{"category":"company","date":1711038709,"headline":"20 Largest Companies in the World by Market Cap in 2024","id":126618144,"image":"https://s.yimg.com/ny/api/res/1.2/ndU42yyiO6AR2iM7JKelxA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/410ac07c4c90786d8592963501a2ed84","symbol":"GOOGL","publisher":"Yahoo","summary":"In this article, we will be taking a look at the 20 largest companies in the world by market cap in 2024. If you want to skip our detailed analysis, you can go directly to 5 Largest Companies in the World by Market Cap in 2024. The biggest companies in the world by market cap […]","url":"https://finance.yahoo.com/news/20-largest-companies-world-market-163149862.html"},{"category":"company","date":1711037840,"headline":"UPDATE 2-Apple, Meta, Google to face EU Digital Markets Act probes, sources say","id":126619453,"image":"","symbol":"GOOGL","publisher":"Yahoo","summary":"Apple, Meta Platforms and Alphabet's Google are set to be investigated for potential violations of the European Union's Digital Markets Act (DMA) that could lead to hefty fines by the end of the year, according to people with direct knowledge of the matter.  The European Commission will likely announce the investigations, either at the same time or one after the other rapidly, in the coming days and issue decisions before EU antitrust chief Margrethe Vestager's term ends in November, they said.","url":"https://finance.yahoo.com/news/1-apple-meta-google-set-161720897.html"},{"category":"company","date":1711036681,"headline":"Factbox-US takes on Apple as efforts to curtail Big Tech gather momentum","id":126616666,"image":"https://media.zenfs.com/en/reuters-finance.com/b2ac72c1390180852d57c7572d755dff","symbol":"GOOGL","publisher":"Yahoo","summary":"The case is the fifth by the U.S. government aimed at reining in tech giants.  The U.S. Justice Department has been probing Apple since 2019 and alleged on Thursday that the company has imposed software and hardware limitations on its iPhones and iPads to impede rivals from effectively competing.  The California-based firm is also under regulatory scrutiny in Europe and was earlier this month hit with a 1.84 billion euro ($2 billion) fine for thwarting competition from music streaming rivals through restrictions on its App Store.","url":"https://finance.yahoo.com/news/factbox-us-takes-apple-efforts-155801147.html"},{"category":"company","date":1711036221,"headline":"Ozempic and the Oprah Effect: From Hollywood Vanity Diet to Mainstream Miracle Shot That’s Leading Obesity Intervention","id":126618520,"image":"https://wwd.com/wp-content/uploads/2024/03/oprah-ozempic-special.jpg?w=1024","symbol":"GOOGL","publisher":"Yahoo","summary":"The media titan is leading the conversation of ending stigma from weight loss injectables after a year of celebrity gossip, punchlines, shaming and virality.","url":"https://wwd.com/pop-culture/culture-news/ozempic-media-oprah-weight-loss-special-awards-shows-celebrities-1236271333/"},{"category":"company","date":1711036072,"headline":"Apple, Meta, Google to face EU Digital Markets Act probes, sources say","id":126619469,"image":"","symbol":"GOOGL","publisher":"Yahoo","summary":"Apple, Meta Platforms and Alphabet's Google are set to be investigated for potential violations of the European Union's Digital Markets Act (DMA) that could lead to hefty fines by the end of the year, according to people with direct knowledge of the matter.  The European Commission will likely announce the investigations, either at the same time or one after the other rapidly, in the coming days and issue decisions before EU antitrust chief Margrethe Vestager's term ends in November, they said.","url":"https://finance.yahoo.com/news/apple-meta-google-set-face-154752939.html"},{"category":"company","date":1711035740,"headline":"Microsoft, Google, Nucor partner on initiative to spur emerging 24/7 clean power technologies","id":126623595,"image":"https://www.utilitydive.com/imgproxy/8qesLxePFjj4QFqZpdNzawcKTtpPpaIpCQEa5x2lJ2s/g:ce/rs:fill:770:435:0/bG9jYWw6Ly8vZGl2ZWltYWdlL3hlLTEwMC1yZWFjdG9yX1JPVk5TZVMuanBn.webp","symbol":"GOOGL","publisher":"Yahoo","summary":"The Advanced Clean Electricity initiative aims for widespread commercial deployment of advanced nuclear, next-generation geothermal and long-duration storage by the early 2030s.","url":"https://www.utilitydive.com/news/microsoft-google-nucor-clean-firm-power-advanced-nuclear-geothermal-long-duration-storage/711050/"},{"category":"company","date":1711035667,"headline":"Apple, Google to Be Hit by First Probes Under EU Digital Law","id":126616667,"image":"https://s.yimg.com/ny/api/res/1.2/e8Pwhb.9RoBsGr45c837.w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_technology_68/9e890229b13ab4dd9da827902d0925a1","symbol":"GOOGL","publisher":"Yahoo","summary":"(Bloomberg) -- Apple Inc. and Alphabet Inc.’s Google are set to face full-blown European Union investigations into their compliance with a new law reining in the power of Big Tech, paving the way for potentially hefty fines.Most Read from BloombergBaltimore Wants to Sell Hundreds of Vacant Homes for $1 EachJustice Department to Sue Apple for Antitrust Violations as Soon as ThursdayNY Poised to Seize Trump Westchester Assets If Fraud Fine Is UnpaidSam Bankman-Fried Says 50-Year Sentence Only Suit","url":"https://finance.yahoo.com/news/apple-google-set-hit-first-151645298.html"},{"category":"company","date":1711034980,"headline":"2 No-Brainer Stocks to Buy Right Now for Less than $1,000","id":126616668,"image":"https://g.foolcdn.com/editorial/images/769966/google-logo-on-smartphone.jpg","symbol":"GOOGL","publisher":"Yahoo","summary":"These tech leaders will grow even stronger over the next decade, and your retirement savings will reap the rewards.","url":"https://www.fool.com/investing/2024/03/21/2-no-brainer-stocks-buy-right-now-1000/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;.tsrc=rss"},{"category":"company","date":1711034400,"headline":"Alphabet (GOOGL) Boosts Healthcare Efforts With Latest AI Move","id":126617482,"image":"https://media.zenfs.com/en/zacks.com/76132323c88812a1d58faada145d6911","symbol":"GOOGL","publisher":"Yahoo","summary":"Alphabet's (GOOGL) Google deepens AI push into the healthcare industry in order to revolutionize the industry.","url":"https://finance.yahoo.com/news/alphabet-googl-boosts-healthcare-efforts-152000634.html"},{"category":"company","date":1711032914,"headline":"Justice Department files antitrust suit against Apple","id":126616669,"image":"https://s.yimg.com/ny/api/res/1.2/D8h_a0QFsmMI_aDmSQnUig--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-03/e5fc6770-e709-11ee-bbbe-94bce4afa95f","symbol":"GOOGL","publisher":"Yahoo","summary":"The Department of Justice has filed a new antitrust suit against Apple, setting up yet another confrontation between the US government and an icon of Silicon Valley.","url":"https://finance.yahoo.com/news/justice-department-files-antitrust-suit-against-apple-145514025.html"},{"category":"company","date":1711032010,"headline":"UPDATE 4-Apple accused of monopolizing smartphone markets in US antitrust lawsuit","id":126616670,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"GOOGL","publisher":"Yahoo","summary":"The U.S. Department of Justice and 15 states on Thursday sued Apple, alleging it used the powerful demand for its iPhone and other products to drive up prices for its services and hurt smaller rivals, the latest move in a U.S. crackdown on Big Tech.  Apple joins corporate rivals sued by U.S. regulators, including Alphabet's Google, Meta Platforms and Amazon.com across the administrations of both former President Donald Trump and President Joe Biden.  \"If left unchallenged, Apple will only continue to strengthen its smartphone monopoly.\"","url":"https://finance.yahoo.com/news/1-us-takes-apple-antitrust-144010191.html"},{"category":"company","date":1711031542,"headline":"Apple has kept an illegal monopoly over smartphones in US, Justice Department says in antitrust suit","id":126616671,"image":"https://s.yimg.com/ny/api/res/1.2/WwapsiOVDIyHIG2jhoCM7g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/ap_finance_articles_694/a19ed924362805551c193ebc7f07926a","symbol":"GOOGL","publisher":"Yahoo","summary":"The Justice Department on Thursday announced a sweeping antitrust lawsuit against Apple, accusing the tech giant of engineering an illegal monopoly in smartphones that boxes out competitors and stifles innovation.  The lawsuit, filed in federal court in New Jersey, alleges that Apple has monopoly power in the smartphone market and uses its control over the iPhone to “engage in a broad, sustained, and illegal course of conduct.”  The lawsuit — which was also filed with 16 state attorneys general — is the latest example of the Justice Department’s approach to aggressive enforcement of federal antitrust law that officials say is aimed at ensuring a fair and competitive market, even as it has lost some significant anticompetition cases.","url":"https://finance.yahoo.com/news/apple-kept-illegal-monopoly-over-143222010.html"},{"category":"company","date":1711030430,"headline":"Retail Tech: Puma Taps Google Cloud, Bolt and Checkout.com Team Up","id":126616673,"image":"https://sourcingjournal.com/wp-content/uploads/2024/03/pumagoogle.jpg?w=1024","symbol":"GOOGL","publisher":"Yahoo","summary":"Locus Robotics has entered partnerships with U.K. department store John Lewis and logistics company Geodis.","url":"https://sourcingjournal.com/topics/logistics/retail-tech-puma-google-cloud-bolt-checkout-com-locus-robotics-john-lewis-geodis-g2-reverse-logistics-recurate-500672/"},{"category":"company","date":1711029600,"headline":"This Company Helped Make AI a Reality. Now the Machines Are Crushing It.","id":126615975,"image":"https://s.yimg.com/ny/api/res/1.2/Ub97jxDntkkmEugeZV0CQw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/8e0a62733875a76335bca0b6fbcb2af0","symbol":"GOOGL","publisher":"Yahoo","summary":"Appen once relied on U.S. tech giants for 80% of its revenue, but has fallen victim to rapidly shifting trends in artificial intelligence.","url":"https://finance.yahoo.com/m/7c965af1-7c01-3a1c-a023-aa31cefc884d/this-company-helped-make-ai-a.html"},{"category":"company","date":1711025700,"headline":"3 Artificial Intelligence (AI) Stocks to Buy Hand Over Fist in March","id":126615970,"image":"https://g.foolcdn.com/editorial/images/769395/celebrating-stock-market-success.jpg","symbol":"GOOGL","publisher":"Yahoo","summary":"The market still has plenty of value stocks available.","url":"https://www.fool.com/investing/2024/03/21/3-artificial-intelligence-ai-stocks-to-buy-march/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;.tsrc=rss"},{"category":"company","date":1711023540,"headline":"EU to Probe Apple (AAPL), Meta (META), and Google (GOOGL) for Digital Markets Act Compliance","id":126622093,"image":"","symbol":"GOOGL","publisher":"GuruFocus","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408793529"},{"category":"company","date":1711023480,"headline":"Reddit pops as investors receive latest AI IPO","id":126618711,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408792693"},{"category":"company","date":1711022520,"headline":"Apple DOJ Lawsuit Could Challenge 'Core Business Model': Leading Analyst Predicts What's Next For Tech Giant","id":126617628,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408771173"},{"category":"company","date":1711022460,"headline":"Apple, Google set to face first probes under EU's new tech rules: report","id":126617629,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408769106"},{"category":"company","date":1711021860,"headline":"Apple, Google set to face first EU probes under EU's new tech rules: report","id":126617393,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408754098"},{"category":"company","date":1711021260,"headline":"Broadcom Rocks At AI Event: Here's What Got These Analysts Most Excited","id":126617394,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408740304"},{"category":"company","date":1711018829,"headline":"Alphabet's (NASDAQ:GOOGL) 20% CAGR outpaced the company's earnings growth over the same five-year period","id":126616676,"image":"https://media.zenfs.com/en/simply_wall_st__316/24a8be9e4dd93a7a5c866dec7c65e1eb","symbol":"GOOGL","publisher":"Yahoo","summary":"When you buy a stock there is always a possibility that it could drop 100%. But on the bright side, you can make far...","url":"https://finance.yahoo.com/news/alphabets-nasdaq-googl-20-cagr-110029995.html"},{"category":"company","date":1711018204,"headline":"Astera Labs: Promising AI Pure Play","id":126615683,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/885294108/image_885294108.jpg?io=getty-c-w1536","symbol":"GOOGL","publisher":"SeekingAlpha","summary":"Astera Labs will likely attract investors as one of the few publicly traded AI pure plays. Find out if now is a good time to buy ALAB stock.","url":"https://seekingalpha.com/article/4679624-astera-labs-promising-ai-pure-play"},{"category":"company","date":1711016760,"headline":"EU to hit Apple, Google with first probes under DMA, Bloomberg Law reports","id":126617395,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408636789"},{"category":"company","date":1711016280,"headline":"Apple Faces Major Antitrust Lawsuit Over iPhone and Services Pricing","id":126617396,"image":"","symbol":"GOOGL","publisher":"GuruFocus","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408626068"},{"category":"company","date":1711015920,"headline":"Interesting GOOGL Put And Call Options For May 3rd","id":126617397,"image":"","symbol":"GOOGL","publisher":"Stock Options Channel","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408617027"},{"category":"company","date":1711013820,"headline":"Hamburger delivery by drone? DoorDash, Google and Wendy's are making it happen","id":126617399,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408571108"},{"category":"company","date":1711013700,"headline":"Market Clubhouse Morning Memo - March 21st, 2024 (Trade Strategy For SPY, QQQ, AAPL, MSFT, NVDA, GOOGL, META, And TSLA)","id":126617400,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408569478"},{"category":"company","date":1711011540,"headline":"RDDT Stock IPO: 7 Things to Know as Reddit Starts Trading Today","id":126617402,"image":"","symbol":"GOOGL","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408519542"},{"category":"company","date":1711010100,"headline":"3 Millionaire-Maker Technology Stocks","id":126616677,"image":"https://g.foolcdn.com/editorial/images/769305/nvidia-data-center-with-nvidia-units-installed-showing-nvidia-logo-1.png","symbol":"GOOGL","publisher":"Yahoo","summary":"These Magnificent Seven stocks are still priced to create big-time investment returns.","url":"https://www.fool.com/investing/2024/03/21/3-millionaire-maker-technology-stocks/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;.tsrc=rss"},{"category":"company","date":1711006815,"headline":"Is Alphabet (GOOG) Stock Trading at a Reasonable Valuation?","id":126616678,"image":"https://media.zenfs.com/en/insidermonkey.com/cf6d2f879575432f39eec460d8fb6fb8","symbol":"GOOGL","publisher":"Yahoo","summary":"Ruane, Cunniff \u0026 Goldfarb, an investment adviser managing Sequoia Fund, released its Q4 2023 investor letter. A copy of the same can be downloaded here. In the fourth quarter, the fund returned 13.31% compared to an 11.69% return for the S\u0026P 500 Index. The fund generated a 27.83% return in 2023 compared to a 26.29% return […]","url":"https://finance.yahoo.com/news/alphabet-goog-stock-trading-reasonable-074015257.html"},{"category":"company","date":1711005360,"headline":"Alphabet, Jabil And 2 Other Stocks Insiders Are Selling","id":126617404,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408395944"},{"category":"company","date":1711004460,"headline":"3 Tech Titans Trading at Bargain Prices: Your Chance to Strike Gold","id":126617405,"image":"","symbol":"GOOGL","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408378271"},{"category":"company","date":1711002936,"headline":"Open-source AI models released by Tokyo lab Sakana founded by former Google researchers","id":126611706,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"GOOGL","publisher":"Yahoo","summary":"Sakana AI, a Tokyo-based artificial intelligence startup founded by two prominent former Google researchers, released AI models on Wednesday it said were built using a novel method inspired by evolution, akin to breeding and natural selection.  Sakana AI employed a technique called \"model merging\" which combines existing AI models to yield a new model, combining it with an approach inspired by evolution, leading to the creation of hundreds of model generations.  The company is releasing the three Japanese language models and two are being open-sourced, Sakana AI founder David Ha told Reuters in online remarks from Tokyo.","url":"https://finance.yahoo.com/news/open-source-ai-models-released-063536787.html"},{"category":"company","date":1711002649,"headline":"Alphabet Inc CEO Sundar Pichai Sells 22,500 Shares","id":126611707,"image":"https://s.yimg.com/ny/api/res/1.2/PBKyIO.h7kH1P1td9VBuoQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD01MjU-/https://media.zenfs.com/en/us.finance.gurufocus/7e86fe9f20db4c3321710ac54f5c0604","symbol":"GOOGL","publisher":"Yahoo","summary":"Alphabet Inc (NASDAQ:GOOG), the parent company of Google and a multitude of other subsidiaries that span across various sectors including technology, life sciences, investment capital, and research, has reported an insider selling event.","url":"https://finance.yahoo.com/news/alphabet-inc-ceo-sundar-pichai-063049920.html"},{"category":"company","date":1711002060,"headline":"3 Stocks That Are Leaving Their Competitors in the Dust","id":126638431,"image":"","symbol":"GOOGL","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3409345034"},{"category":"company","date":1711001880,"headline":"Asian Markets Show Mixed Responses Amid US Inflation Concerns","id":126628738,"image":"","symbol":"GOOGL","publisher":"GuruFocus","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3409340529"},{"category":"company","date":1710999420,"headline":"Why MSFT Stock May Be the Ultimate AI Growth Play for the Next Decade","id":126617406,"image":"","symbol":"GOOGL","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408291817"},{"category":"company","date":1710998160,"headline":"AMD Stock: Why The Chipmaker Is a Better Investment Than Nvidia","id":126617408,"image":"","symbol":"GOOGL","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408273424"},{"category":"company","date":1710997560,"headline":"AI Winners: A Cheat Sheet","id":126616270,"image":"","symbol":"GOOGL","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408264581"},{"category":"company","date":1710997260,"headline":"Thursday Macro \u0026 Markets Update – 03.21.24","id":126617411,"image":"","symbol":"GOOGL","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408260742"},{"category":"company","date":1710996300,"headline":"Reddit IPO Potential 'Watershed' Moment For Tech Industry, Says Wedbush's Dan Ives: Expects It To Hit $1B In Revenue Next Year","id":126617412,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408246944"},{"category":"company","date":1710995700,"headline":"Cognizant, Google Cloud expand partnership","id":126617413,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408237864"},{"category":"company","date":1710974426,"headline":"15 Best Cities for Cyber Security Jobs in the World","id":126606221,"image":"https://s.yimg.com/ny/api/res/1.2/B6uRJXErB32RA89.5com3g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/de33a7226806e9e607f8ab87ef2ab2d8","symbol":"GOOGL","publisher":"Yahoo","summary":"In this article, we will look at the 15 best cities for cyber security jobs in the world. We have also discussed the growing demand in the field. If you want to skip our detailed analysis, head straight to the 5 Best Cities for Cyber Security Jobs in the World. The cybersecurity field is growing […]","url":"https://finance.yahoo.com/news/15-best-cities-cyber-security-224026378.html"},{"category":"company","date":1710973651,"headline":"Apple Reportedly Faces DOJ Antitrust Suit Over iPhone In Latest Move Vs. Big Tech","id":126606222,"image":"https://media.zenfs.com/en/ibd.com/fb58ddf956b8be32417c7ca798a40267","symbol":"GOOGL","publisher":"Yahoo","summary":"The Justice Department reportedly will file an antitrust suit as soon as Thursday for alleged iPhone dominance. Apple stock fell slightly.","url":"https://finance.yahoo.com/m/3e394199-66e8-398f-aac5-92304893595a/apple-reportedly-faces-doj.html"},{"category":"company","date":1710972629,"headline":"12 Best Alternatives to a 4-Year College","id":126606224,"image":"https://s.yimg.com/ny/api/res/1.2/AiNG74d4tTik4GOh35HZ3w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/634636b8b0601454d5201ee6d951d457","symbol":"GOOGL","publisher":"Yahoo","summary":"In this article, we will look at the 12 best alternatives to a 4-year college. We have also discussed the decreasing value of college degrees. If you want to skip our detailed analysis, head straight to the 5 Best Alternatives to a 4-Year College. In recent years, there has been a growing emphasis on alternatives […]","url":"https://finance.yahoo.com/news/12-best-alternatives-4-college-221029074.html"},{"category":"company","date":1710972522,"headline":"Tracking Ruane, Cunniff, \u0026 Goldfarb's Portfolio - Q4 2023 Update","id":126609451,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1323041315/image_1323041315.jpg?io=getty-c-w1536","symbol":"GOOGL","publisher":"SeekingAlpha","summary":"Ruane, Cunniff \u0026 Goldfarb's 13F portfolio value rose to $6.26B, driven by top holdings in ICE, GOOG, and SCHW. Read more on the portfolio update here.","url":"https://seekingalpha.com/article/4679513-tracking-ruane-cunniff-and-goldfarbs-portfolio-q4-2023-update"},{"category":"company","date":1710971819,"headline":"20 Best ChatGPT Alternatives for 2024: Free \u0026 Paid","id":126606225,"image":"https://s.yimg.com/ny/api/res/1.2/uhaEWqILUdrMhtlWPKv7tg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/insidermonkey.com/048a910fa376a41ea682f5f73e8c3d95","symbol":"GOOGL","publisher":"Yahoo","summary":"In this article, we will list the 20 best ChatGPT alternatives for 2024. If you want to skip the latest news regarding generative AI, visit 8 Best ChatGPT Alternatives for 2024: Free \u0026 Paid. The Global AI market has undergone significant growth, which is likely to continue in the long term. Technological advancements are shaping […]","url":"https://finance.yahoo.com/news/20-best-chatgpt-alternatives-2024-215659934.html"},{"category":"company","date":1710970927,"headline":"Justice Department to Sue Apple for Antitrust Violations as Soon as Thursday","id":126606227,"image":"https://s.yimg.com/ny/api/res/1.2/IXG25S2BucCKE7Ys1qw6Gg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_technology_68/dbe2699bd481c7896a94ba0105e967a3","symbol":"GOOGL","publisher":"Yahoo","summary":"(Bloomberg) -- The Justice Department is poised to sue Apple Inc. as soon as Thursday, accusing the world’s second most valuable tech company of violating antitrust laws by blocking rivals from accessing hardware and software features of its iPhone.Most Read from BloombergTrump Rules Out Vivek Ramaswamy as Running Mate as He Eyes New TeamSam Bankman-Fried Says 50-Year Sentence Only Suitable for a ‘Super Villain’What Happens If Trump Can’t Post His $454 Million BondFed to Give Fresh Clues on Path","url":"https://finance.yahoo.com/news/justice-department-sue-apple-antitrust-212239046.html"},{"category":"company","date":1710970324,"headline":"Goodbye, Magnificent Seven. Who are tech's 'Electric Eleven'?","id":126606228,"image":"https://s.yimg.com/ny/api/res/1.2/TLmWy0A_6oakzDCT_Be_Lw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-03/1bc98800-e701-11ee-bf7f-1b137e8c65cd","symbol":"GOOGL","publisher":"Yahoo","summary":"First came the Magnificent Seven. And then Wall Street analysts began doubting the strength of the tech sector, quickly coining the term \"Fantastic Four\" to exclude several of the biggest laggards in 2024. Now, Evercore ISI is pairing together a new group of tech stocks as big as the previous two — \"the Electric Eleven,\" comprised of Airbnb (ABNB), Alphabet (GOOG, GOOGL), Amazon (AMZN), Booking Holdings (BKNG), DoorDash (DASH), Meta Platforms (META), Netflix (NFLX), Shopify (SHOP), Spotify (SPOT), The Trade Desk (TTD), and Uber (UBER). Evercore ISI Senior Managing Director and Head of Internet Research Mark Mahaney explains where the similarities between these companies lie and their core drivers. \"I think most of these digital-first companies are beneficiaries of gen AI. They're going to be able to figure it out, they're going to deploy, or they already have in ways that improve products and processes and they're and I think shareholders will benefit from that,\" Mahaney explains. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan.","url":"https://finance.yahoo.com/video/goodbye-magnificent-seven-techs-electric-213204281.html"},{"category":"company","date":1710967328,"headline":"Nvidia Is One Of 2 Mag 7 Stocks On This Breakout Screen","id":126603538,"image":"https://media.zenfs.com/en/ibd.com/74f981605b2ac82d3f0d2192a3e6a429","symbol":"GOOGL","publisher":"Yahoo","summary":"Google stock perked up on reports of talks to license Alphabet's Gemini AI training to Apple for use in iPhones.","url":"https://finance.yahoo.com/m/fce0a54f-aa85-31dd-b8a8-056176defb5a/nvidia-is-one-of-2-mag-7.html"},{"category":"company","date":1710963712,"headline":"Google defends Digital Markets Act changes, cites complex trade-offs","id":126606230,"image":"https://media.zenfs.com/en/reuters-finance.com/30cb8c3d85d9eea833a3861570f70495","symbol":"GOOGL","publisher":"Yahoo","summary":"Alphabet's Google on Thursday will seek to fend off criticism about changes to its core services mandated by landmark EU tech rules, according to a copy of a senior Google executive's speech seen by Reuters.  Oliver Bethell, a lawyer who leads Google's EMEA competition team, will tell regulators and rivals that balancing the various interests has required the tech company to make complex trade-offs, according to the document.  Under the Digital Markets Act (DMA), which kicked in on March 7, users can remove any Google pre-installed software or app if they want while Google will need their consent to use their data across its various services or for personalised ads.","url":"https://finance.yahoo.com/news/google-defends-digital-markets-act-194152628.html"},{"category":"company","date":1710957669,"headline":"Reddit prices IPO at top of indicated range to raise $748 million","id":126604624,"image":"","symbol":"GOOGL","publisher":"Finnhub","summary":"Social media platform Redditpriced its initial public offering at the top of itstargeted range of $31 to $34 per share on Wednesday, raising$748 million and giving the ailing technology IPO market...","url":"https://finnhub.io/api/news?id=5fcb78ce6a68cdd8cada5ee0c42499eb88aad04acd9b9d5b3f26d84a9e1a816f"},{"category":"company","date":1710955694,"headline":"Google: Great Apple News Amid Fears Of Inferiority","id":126604151,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/497298355/image_497298355.jpg?io=getty-c-w1536","symbol":"GOOGL","publisher":"SeekingAlpha","summary":"Google's competitive positioning in the LLM landscape would gain significant points if a deal materializes. Find out why GOOG stock is a Buy.","url":"https://seekingalpha.com/article/4679473-google-great-apple-news-amid-fears-of-inferiority"},{"category":"company","date":1710952850,"headline":"UPDATE 1-Michael Cohen will not face sanctions after generating fake cases with AI","id":126599064,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"GOOGL","publisher":"Yahoo","summary":"A federal judge on Wednesday declined to sanction Michael Cohen, the former fixer for Donald Trump, for mistakenly giving his lawyer fake case citations generated by artificial intelligence, calling the episode \"embarrassing.\"  U.S. District Judge Jesse Furman in Manhattan also refused to end court-supervised release for Cohen, who pleaded guilty in 2018 to campaign finance violations and tax evasion and served time in prison, and suggested Cohen may have perjured himself.  Furman's decision came as Cohen prepares to be a star witness against Trump in the former president's upcoming criminal trial in Manhattan.","url":"https://finance.yahoo.com/news/1-michael-cohen-not-face-164050898.html"},{"category":"company","date":1710951428,"headline":"Only Two Mag 7 Stocks Make This Breakout Screen. Nvidia Is One.","id":126597634,"image":"https://media.zenfs.com/en/ibd.com/74f981605b2ac82d3f0d2192a3e6a429","symbol":"GOOGL","publisher":"Yahoo","summary":"Google stock perked up on reports of talks to license Alphabet's Gemini AI training to Apple for use in iPhones.","url":"https://finance.yahoo.com/m/fce0a54f-aa85-31dd-b8a8-056176defb5a/only-two-mag-7-stocks-make.html"},{"category":"company","date":1710950460,"headline":"Amazon (AMZN) Boosts AWS Portfolio With NVIDIA Collaboration","id":126599066,"image":"https://media.zenfs.com/en/zacks.com/ae16b860501e504815b944ed35f1e848","symbol":"GOOGL","publisher":"Yahoo","summary":"Amazon's (AMZN) AWS extends collaboration with NVIDIA to strengthen its portfolio offerings with generative AI technology.","url":"https://finance.yahoo.com/news/amazon-amzn-boosts-aws-portfolio-160100077.html"},{"category":"company","date":1710950160,"headline":"Alphabet (GOOGL) Adds New Feature to Google Maps for Wear OS","id":126599067,"image":"https://media.zenfs.com/en/zacks.com/76132323c88812a1d58faada145d6911","symbol":"GOOGL","publisher":"Yahoo","summary":"Alphabet's (GOOGL) Google launches a new Transit feature for Google Maps on Wear OS, boosting the Google Services segment.","url":"https://finance.yahoo.com/news/alphabet-googl-adds-feature-google-155600989.html"},{"category":"company","date":1710948205,"headline":"Google becomes the first AI company to be fined over training data","id":126599068,"image":"","symbol":"GOOGL","publisher":"Yahoo","summary":"Google's €250 million defeat in a long-running showdown with French news publishers comes with an AI twist.","url":"https://finance.yahoo.com/news/google-becomes-first-ai-company-152325343.html"},{"category":"company","date":1710947820,"headline":"Forget Meta Platforms: 2 Artificial Intelligence (AI) Stocks to Buy Instead","id":126596111,"image":"https://g.foolcdn.com/editorial/images/769942/ai-robot-whispers-secrets-to-smiling-human.jpg","symbol":"GOOGL","publisher":"Yahoo","summary":"Two tech titans are poised to outperform in the AI-driven market shift. Jumping on the Meta Platforms bandwagon might not be your best move when these superior choices exist.","url":"https://www.fool.com/investing/2024/03/20/2-artificial-intelligence-ai-stocks-to-buy/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;.tsrc=rss"},{"category":"company","date":1710937255,"headline":"Google hit with $270M fine in France as authority finds news publishers’ data was used for Gemini","id":126596126,"image":"https://techcrunch.com/wp-content/uploads/2020/03/GettyImages-1194872527.jpg?resize=1200,800","symbol":"GOOGL","publisher":"Yahoo","summary":"In a never-ending saga between Google and France’s competition authority over copyright protections for news snippets, the Autorité de la Concurrence announced a €250 million fine against the tech giant Wednesday (around $270 million at today’s exchange rate). According to the competition watchdog, Google disregarded some of its previous commitments with news publishers. But the decision is especially notable because it drops something else that’s bang up-to-date – by latching onto Google’s use","url":"https://techcrunch.com/2024/03/20/google-hit-with-270m-fine-in-france-as-authority-finds-news-publishers-data-was-used-for-gemini/"},{"category":"company","date":1710945563,"headline":"Google fined $270 million by French regulatory authority","id":126596113,"image":"","symbol":"GOOGL","publisher":"Yahoo","summary":"The fine has been levied due to Google's AI training practices.","url":"https://www.thestreet.com/technology/google-fined-270-million-by-french-regulatory-authority"},{"category":"company","date":1710944580,"headline":"This Growth Stock Is Beating the \"Magnificent Seven\": Should You Buy?","id":126595884,"image":"https://g.foolcdn.com/editorial/images/769741/listening-to-music.jpg","symbol":"GOOGL","publisher":"Yahoo","summary":"Despite competing with the largest companies in the world, this popular smartphone application is thriving.","url":"https://www.fool.com/investing/2024/03/20/this-growth-stock-is-beating-the-magnificent-seven/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;.tsrc=rss"},{"category":"company","date":1710941940,"headline":"Apple’s Stock Wavers as It Looks for AI Partners, and Other Technology News Today","id":126594825,"image":"https://s.yimg.com/ny/api/res/1.2/Iy_MGAZQEHqV1lfzNwk1ew--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/Barrons.com/5a1fd413f7d6a1825e8408c01a3e642e","symbol":"GOOGL","publisher":"Yahoo","summary":"Apple  is still looking around for a date to take it to the big artificial-intelligence party.  Apple  has held discussions with  Alphabet  Google as well as  Microsoft  -backed OpenAI and the start-up Cohere about using their AI technology on its devices, according to The Wall Street Journal, which cited people familiar with the matter.  The initial reports that Apple was in talks with Google over AI collaboration pushed up both stocks, but such a deal wouldn’t be a straightforward win for the iPhone maker.","url":"https://finance.yahoo.com/m/a62d6357-a228-37ac-9cdb-ef28585f9b0f/apple%E2%80%99s-stock-wavers-as-it.html"},{"category":"company","date":1710940489,"headline":"The startup wars: Anthropic for Google, Inflection for Microsoft","id":126596122,"image":"","symbol":"GOOGL","publisher":"Yahoo","summary":"The giants of the tech sector are consuming promising startups.","url":"https://www.thestreet.com/technology/the-startup-wars-anthropic-for-google-inflection-for-microsoft"},{"category":"company","date":1710938100,"headline":"Epic reiterates plans for Epic Games Store on iOS, Android, The Verge reports","id":126599215,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3407025341"},{"category":"company","date":1710937583,"headline":"Google Fined €250 Million in French Clash With News Outlets","id":126596124,"image":"https://s.yimg.com/ny/api/res/1.2/N0q0knlwYoIoi6G1y2uE_g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_technology_68/58c2df8402d501c41ce61b9c29edabd2","symbol":"GOOGL","publisher":"Yahoo","summary":"(Bloomberg) -- Alphabet Inc.’s Google was fined €250 million ($271 million) by France’s competition watchdog for failing to keep its pledge to broker fair agreements with media outlets for publishing links to their content, including by plundering press articles to train its AI technology, without informing them.Most Read from BloombergTrump Rules Out Vivek Ramaswamy as Running Mate as He Eyes New TeamWhat Happens If Trump Can’t Post His $454 Million BondUltra-Wealthy Are Souring on Chicago’s Mo","url":"https://finance.yahoo.com/news/google-fined-250-million-french-081047314.html"},{"category":"company","date":1710937320,"headline":"Disney teams with Google, Trade Desk on ad platform update","id":126599216,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3407006720"},{"category":"company","date":1710937200,"headline":"Google Pixel 8A Specs Leak: New Features, Price, And Release Date Revealed","id":126599217,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3406269875"},{"category":"company","date":1710936240,"headline":"Google Fined Roughly $270 Million in France Over Dispute With News Publishers","id":126596127,"image":"","symbol":"GOOGL","publisher":"Yahoo","summary":"France’s competition watchdog fined Google roughly $270 million, saying the search giant breached some commitments it made to negotiate fair license deals with an array of news publishers in the country.","url":"https://finance.yahoo.com/m/f8d94ea5-acae-37f1-8d54-ad0a1450f7e4/google-fined-roughly-%24270.html"},{"category":"company","date":1710934200,"headline":"Gene Munster Agrees With Dan Nathan's Views That These 2 Magnificent 7 Companies Are AI Underdogs: 'I Believe That Will Change'","id":126617414,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3408000243"},{"category":"company","date":1710933433,"headline":"Michael Cohen won't face sanctions after generating fake cases with AI","id":126596034,"image":"","symbol":"GOOGL","publisher":"Finnhub","summary":"A federal judge on Wednesday declined to sanction Michael Cohen, the former lawyer and fixer for Donald Trump, for mistakenly giving his lawyer fake case citations generated by artificial...","url":"https://finnhub.io/api/news?id=4807076271258182655b3d3cddcfb6bd1b34f83d98c87495ae342044877fa1bd"},{"category":"company","date":1710933369,"headline":"Nipping At The Heels Of Nvidia","id":126595569,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1808364763/image_1808364763.jpg?io=getty-c-w1536","symbol":"GOOGL","publisher":"SeekingAlpha","summary":"Nvidia Corporation sees little in the way of a direct competitive threat that can seriously dent its dominant position. Learn why we rate NVDA stock as a buy.","url":"https://seekingalpha.com/article/4679376-nipping-at-the-heels-of-nvidia"},{"category":"company","date":1710932400,"headline":"Adobe's AI Struggle Is Common, But Unfortunate For Becoming A Standout","id":126595446,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2060559146/image_2060559146.jpg?io=getty-c-w1536","symbol":"GOOGL","publisher":"SeekingAlpha","summary":"Adobe has fallen into the commodity status of AI products, facing the same pitfalls as other AI tech giants. Explore more details here.","url":"https://seekingalpha.com/article/4679295-adobes-ai-struggle-is-common-but-unfortunate-for-becoming-a-standout"},{"category":"company","date":1710931635,"headline":"French regulators fine Google $272 million in dispute with news publishers","id":126596129,"image":"https://s.yimg.com/ny/api/res/1.2/0HnALxoFI_2O6R_WZrD.RA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/ap_finance_articles_694/a78c55542b7778447dc86ca9594122b1","symbol":"GOOGL","publisher":"Yahoo","summary":"France’s competition watchdog hit Google on Wednesday with another big fine tied to a long-running dispute over payments to French publishers for their news.  The French Competition Authority said it issued the 250 million euro ($272 million) penalty because of Google's failure to comply with some commitments it made in a negotiating framework.  The dispute is part of a larger effort by authorities in the European Union and around the world to force Google and other tech companies to compensate news publishers for content.","url":"https://finance.yahoo.com/news/french-regulators-fine-google-272-104715814.html"},{"category":"company","date":1710931440,"headline":"The top stocks with buying pressure across the Russell universe - Jefferies","id":126596721,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3406875809"},{"category":"company","date":1710928800,"headline":"Nvidia Stock Soared 239% in 2023, and 1 Wall Street Analyst Says It Could Rise Another 60% This Year","id":126593548,"image":"https://g.foolcdn.com/editorial/images/769597/gettyimages-487690016.jpg","symbol":"GOOGL","publisher":"Yahoo","summary":"Nvidia stock just keeps climbing higher, but there are plenty of reasons to believe further gains are on the horizon.","url":"https://www.fool.com/investing/2024/03/20/nvidia-stock-soared-239-in-2023-and-1-wall-street/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;.tsrc=rss"},{"category":"company","date":1710927540,"headline":"EU set to adopt election safeguards on Big Tech, FT reports","id":126599223,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3406794522"},{"category":"company","date":1710927180,"headline":"Market Clubhouse Morning Memo - March 20th, 2024 (Trade Strategy For SPY, QQQ, AAPL, MSFT, NVDA, GOOGL, META, And TSLA)","id":126596260,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3406787897"},{"category":"company","date":1710924840,"headline":"Zacks Investment Ideas feature highlights: Apple, Alphabet, Eli Lilly, Novo Nordisk and Viking Therapeutics","id":126593796,"image":"https://media.zenfs.com/en/zacks.com/60c096e1e24bb285c41a58d325d8d707","symbol":"GOOGL","publisher":"Yahoo","summary":"Apple, Alphabet, Eli Lilly, Novo Nordisk and Viking Therapeutics have been highlighted in this Investment Ideas article.","url":"https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-085400731.html"},{"category":"company","date":1710923880,"headline":"Disney shifting strategy, selling CTV ads on Google, Trade Desk, AdAge says","id":126599225,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3406718754"},{"category":"company","date":1710923400,"headline":"Apple: AI Hype Finally Reaching Cupertino (Upgrade)","id":126593896,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1705316992/image_1705316992.jpg?io=getty-c-w1536","symbol":"GOOGL","publisher":"SeekingAlpha","summary":"Apple's collaboration with Google has given buyers confidence in its AI inflection and could be a game changer. Read why I am bullish on AAPL stock.","url":"https://seekingalpha.com/article/4679161-apple-ai-hype-finally-reaching-cupertino-upgrade"},{"category":"company","date":1710922200,"headline":"2 \"Magnificent Seven\" Stocks That Will Benefit From a TikTok Ban","id":126592243,"image":"https://g.foolcdn.com/editorial/images/769519/social-media.jpg","symbol":"GOOGL","publisher":"Yahoo","summary":"We could see a rapid shake-up in the consumer internet and social media landscape this year.","url":"https://www.fool.com/investing/2024/03/20/magnificent-seven-stocks-benefit-tiktok-ban/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;.tsrc=rss"},{"category":"company","date":1710919954,"headline":"French competition watchdog hits Google with 250 million euro fine","id":126592244,"image":"https://media.zenfs.com/en/reuters-finance.com/715e700aab3eb5ddcf8c113ae49c8bd5","symbol":"GOOGL","publisher":"Yahoo","summary":"France's competition watchdog on Wednesday said it fined Alphabet's Google 250 million euros ($271.73 million) for breaches linked to EU intellectual property rules in its relationship with media publishers, citing concerns about the company's AI service.  The watchdog said Google's AI-powered chatbot Bard - since rebranded under the name Gemini - was trained on content from publishers and news agencies, without notifying them.  Google has pledged not to contest the facts as part of settlement proceedings, the watchdog said, adding the company also proposed a series of remedy measures to certain shortcomings.","url":"https://finance.yahoo.com/news/french-competition-watchdog-hits-google-073234853.html"},{"category":"company","date":1710919780,"headline":"UPDATE 2-French competition watchdog hits Google with 250 mln euro fine","id":126592245,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"GOOGL","publisher":"Yahoo","summary":"France's competition watchdog on Wednesday said it fined Alphabet's Google 250 million euros ($271.73 million) for breaches linked to EU intellectual property rules in its relationship with media publishers, citing concerns about the company's AI service.  The watchdog said Google's AI-powered chatbot Bard - since rebranded under the name Gemini - was trained on content from publishers and news agencies, without notifying them.  Google has pledged not to contest the facts as part of settlement proceedings, the watchdog said, adding the company also proposed a series of remedy measures to certain shortcomings.","url":"https://finance.yahoo.com/news/1-french-competition-watchdog-hits-072940178.html"},{"category":"company","date":1710918240,"headline":"Huawei's Ambitious AI Chip Developments Trigger Potential US Sanctions on Chinese Firms","id":126597393,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3406610683"},{"category":"company","date":1710917975,"headline":"Google Fined Roughly $270 Million in France Over Dispute With News Publishers -- 2nd Update","id":126593001,"image":"","symbol":"GOOGL","publisher":"Finnhub","summary":"By Mauro Orru France's competition watchdog fined Google 250 million euros , saying the search giant breached some commitments it made to negotiate fair license deals with an array of news...","url":"https://finnhub.io/api/news?id=43eee52da8fe1556c1ae3630876f5c6e1a1b3016664e66dd0e9476e1c3168c14"},{"category":"company","date":1710917880,"headline":"Google fined €250M by French regulator for 'non compliance' of previous media deal","id":126599230,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3406602787"},{"category":"company","date":1710917340,"headline":"Drone Stocks Expected to Fly Up; These are the Ones to Watch","id":126599232,"image":"","symbol":"GOOGL","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3406594736"},{"category":"company","date":1710917220,"headline":"Fund managers risk appetite at 2-year high, but 40% see an AI bubble","id":126596264,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3406592498"},{"category":"company","date":1710916380,"headline":"Meta, Reddit, YouTube To Face Legal Action From Buffalo Shooting Survivors, Judge Rules","id":126599237,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3406578392"},{"category":"company","date":1710915600,"headline":"DOJ to file antitrust suit against Apple as soon as Thursday, Bloomberg says","id":126606306,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3407536453"},{"category":"company","date":1710914503,"headline":"Google Fined Around $270 Million in France Over Dispute With News Publishers -- Update","id":126592617,"image":"","symbol":"GOOGL","publisher":"Finnhub","summary":"By Mauro Orru France's competition watchdog fined Google 250 million euros , saying the search giant breached some commitments it made to negotiate fair license deals with an array of news...","url":"https://finnhub.io/api/news?id=a621e588e9f682440e12433e43c8bf2b137801a5ac544449322e3b20eecbc79a"},{"category":"company","date":1710913786,"headline":"Roku Takes International Expansion And Loses ARPU","id":126592597,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1500235086/image_1500235086.jpg?io=getty-c-w1536","symbol":"GOOGL","publisher":"SeekingAlpha","summary":"Roku faces significant headwinds resulting from operational headwinds and international expansion. Find out why I'm bearish on ROKU stock.","url":"https://seekingalpha.com/article/4679313-roku-takes-international-expansion-and-loses-arpu"},{"category":"company","date":1710913620,"headline":"As Alzheimer’s deaths rise, diagnosis is often delayed","id":126599245,"image":"","symbol":"GOOGL","publisher":"MarketWatch","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3406532716"},{"category":"company","date":1710913620,"headline":"The big tech rally is living on borrowed time, says UBS","id":126596266,"image":"","symbol":"GOOGL","publisher":"MarketWatch","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3406532719"},{"category":"company","date":1710912360,"headline":"Alphabet’s AI Stumble: A Rare Buying Opportunity for Savvy GOOG Stock Investors","id":126599248,"image":"","symbol":"GOOGL","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3406512573"},{"category":"company","date":1710911706,"headline":"Alphabet: €250m sanction from the French Competition Authority (Autorité de la concurrence)","id":126592256,"image":"","symbol":"GOOGL","publisher":"Finnhub","summary":"The French Competition Authority has imposed a fine of 250 million euros on Alphabet, Google, Google Ireland and Google France for failing to comply with certain commitments made mandatory by...","url":"https://finnhub.io/api/news?id=883eddb83fda781dacc92e87fddefa43686d16e2273809bd8bd764f3503c2119"},{"category":"company","date":1710911267,"headline":"Google Fined EUR250 Million in France Over Dispute With News Publishers","id":126592176,"image":"","symbol":"GOOGL","publisher":"Finnhub","summary":"By Mauro Orru France's competition watchdog fined Google 250 million euros , saying the search giant breached some commitments it made to negotiate license deals with an array of news...","url":"https://finnhub.io/api/news?id=8a7116421e9efd5f3dbc3d2b4cc71aa7816ad7ba74356d5e7f7c5389c5ccbf28"},{"category":"company","date":1710910980,"headline":"France fines Google EUR 250M for breaching media deal","id":126599251,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3406493134"},{"category":"company","date":1710910500,"headline":"Microsoft hires DeepMind co-founder to run consumer AI, Bloomberg reports","id":126599253,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3406485476"},{"category":"company","date":1710909900,"headline":"DOJ plans to sue Apple over antitrust issues as soon as tomorrow: report","id":126606315,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3407385589"},{"category":"company","date":1710905220,"headline":"Google Defends Its Compliance with EU's Digital Markets Act","id":126617421,"image":"","symbol":"GOOGL","publisher":"GuruFocus","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3407264724"},{"category":"company","date":1710904800,"headline":"Chipotle Stock (NYSE:CMG) Gains on First-Ever Stock Split","id":126599259,"image":"","symbol":"GOOGL","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3406407680"},{"category":"company","date":1710903180,"headline":"#SocialStocks: EU fines for relaxed election AI content moderation coming soon","id":126602139,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3407217137"},{"category":"company","date":1710902100,"headline":"If You Invested $100 In This Stock 10 Years Ago, You Would Have $500 Today","id":126617423,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3407192017"},{"category":"company","date":1710899162,"headline":"Apple-Google Gemini Partnership Could Make an Unstoppable AI Force","id":126589028,"image":"","symbol":"GOOGL","publisher":"Yahoo","summary":"Google’s parent company, Alphabet (NASDAQ:GOOGL), shot higher yesterday, finishing the day up 4.6%, following a Bloomberg report that Apple (NASDAQ:AAPL) may be looking to Google Gemini as the AI integrated into the iPhone. Indeed, a potential Apple-Google Gemini partnership in artificial intelligence (AI) could mirror their deal with search, which was the subject of considerable regulatory scrutiny in recent years. And while a Google-Apple AI partnership is sure to draw the ire of antitrust reg","url":"https://finance.yahoo.com/news/apple-google-gemini-partnership-could-014602633.html"},{"category":"company","date":1710898680,"headline":"Disney (NYSE:DIS) Joins New Coalition in Advertising Push","id":126605016,"image":"","symbol":"GOOGL","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3407111348"},{"category":"company","date":1710885115,"headline":"UPDATE 1-Social media platforms must face lawsuits claiming they enabled Buffalo mass shooter","id":126589876,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"GOOGL","publisher":"Yahoo","summary":"Several social media companies were ordered by a New York state judge to face four lawsuits seeking to hold them responsible for helping enable the avowed white supremacist who killed 10 Black people in 2022 at a Buffalo, New York grocery store.  Justice Paula Feroleto of the Erie County Supreme Court ruled on Monday that the more than 40 plaintiffs could try to prove that Meta Platforms' Facebook and Instagram, Reddit, Google's YouTube and other platforms were designed to addict and radicalize users like the shooter, Payton Gendron.","url":"https://finance.yahoo.com/news/1-social-media-platforms-must-215155352.html"},{"category":"company","date":1710884717,"headline":"Alphabet Inc. (GOOG) Stock Drops Despite Market Gains: Important Facts to Note","id":126589878,"image":"https://media.zenfs.com/en/zacks.com/078b2d95159d12a337f09f2519ff10ba","symbol":"GOOGL","publisher":"Yahoo","summary":"In the latest trading session, Alphabet Inc. (GOOG) closed at $147.92, marking a -0.38% move from the previous day.","url":"https://finance.yahoo.com/news/alphabet-inc-goog-stock-drops-214517589.html"},{"category":"company","date":1710884717,"headline":"Alphabet (GOOGL) Stock Drops Despite Market Gains: Important Facts to Note","id":126589877,"image":"https://media.zenfs.com/en/zacks.com/c2fdcaac033e049c74f38d188afcc9f9","symbol":"GOOGL","publisher":"Yahoo","summary":"In the closing of the recent trading day, Alphabet (GOOGL) stood at $147.03, denoting a -0.44% change from the preceding trading day.","url":"https://finance.yahoo.com/news/alphabet-googl-stock-drops-despite-214517234.html"},{"category":"company","date":1710882706,"headline":"Palantir Technologies: Navigating A New Era Of Growth And Challenges In 2024","id":126587836,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1313497440/image_1313497440.jpg?io=getty-c-w1536","symbol":"GOOGL","publisher":"SeekingAlpha","summary":"Palantir's stock has surged, and investor confidence has grown. Concerns about overvaluation and scalability have been addressed. See why PLTR stock is buy rated.","url":"https://seekingalpha.com/article/4679246-palantir-technologies-navigating-a-new-era-of-growth-and-challenges-in-2024"},{"category":"company","date":1710881289,"headline":"Wall Street Analysts See Upside Potential for 10 Stocks with Rising Price Targets","id":126582144,"image":"https://s.yimg.com/ny/api/res/1.2/xtfEN0_KtEaIYq48aJzTLg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/insidermonkey.com/f1ca4c70580f150efd6757c1ec31881e","symbol":"GOOGL","publisher":"Yahoo","summary":"In this article, we will discuss the 10 stocks whose price targets were recently raised by analysts. If you want to see more such stocks on the list, go directly to Wall Street Analysts See Upside Potential for 5 Stocks with Rising Price Targets. The resurgence in US stocks, buoyed by what’s been labeled the “most-crowded […]","url":"https://finance.yahoo.com/news/wall-street-analysts-see-upside-204809751.html"},{"category":"company","date":1710880835,"headline":"Apple's AI Focus Could Crimp Profit Margins, Analyst Says","id":126581260,"image":"https://media.zenfs.com/en/ibd.com/704c7f29e8ae9f47deabf257295c37bd","symbol":"GOOGL","publisher":"Yahoo","summary":"Apple’s scramble to catch up to other tech firms in artificial intelligence likely will pressure its profit margins, an investment firm says.","url":"https://finance.yahoo.com/m/97ddd0a6-7dc8-3136-8ec6-e293f97812c1/apple%27s-ai-focus-could-crimp.html"},{"category":"company","date":1710873420,"headline":"Alphabet Stock Up 73% From Early 2023; Profits Soaring","id":126581261,"image":"https://media.zenfs.com/en/ibd.com/1488745f54a8e2665444606bd13007e7","symbol":"GOOGL","publisher":"Yahoo","summary":"Google-parent Alphabet got caught in the market downturn the first quarter of last year and reported a drop in earnings growth on a minuscule sales gain.  Then it blasted off, posting rising earnings and sales growth, including 42% profit surges the past two quarters.  With annual revenue topping $300 billion, it's surprising to see that Alphabet stock has soared 73% since January 2023.","url":"https://finance.yahoo.com/m/bc129db4-0133-3b2d-b7ce-6e0990c16544/alphabet-stock-up-73%25-from.html"},{"category":"company","date":1710864026,"headline":"Microsoft Hires DeepMind Co-Founder Suleyman to Run Consumer AI","id":126577398,"image":"","symbol":"GOOGL","publisher":"Yahoo","summary":"(Bloomberg) -- Microsoft Corp. has named Mustafa Suleyman head of its consumer artificial intelligence business, hiring most of the staff from his Inflection AI startup as the software giant seeks to fend off Alphabet Inc.’s Google in the fiercely contested market for AI products.Most Read from BloombergTrump Rules Out Vivek Ramaswamy as Running Mate as He Eyes New TeamApple Is in Talks to Let Google Gemini Power iPhone AI FeaturesNvidia Looks to Extend AI Dominance With New Blackwell ChipsEverg","url":"https://finance.yahoo.com/news/microsoft-hires-deepmind-co-founder-160026504.html"},{"category":"company","date":1710871184,"headline":"I was there for the dot-com bust. Here's why the AI boom isn't the same.","id":126577396,"image":"https://s.yimg.com/ny/api/res/1.2/zAeZGYGsR1bCbYmRr0._uw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MTM-/https://s.yimg.com/os/creatr-uploaded-images/2024-03/cc720100-e611-11ee-bd73-e84771e12430","symbol":"GOOGL","publisher":"Yahoo","summary":"The current AI-infused record highs in the stock market have some people remembering 2000, when the dot-com bubble burst leaving many investors holding the bag. But veteran financial journalist Allan Sloan says that he was there and this feels much different.","url":"https://finance.yahoo.com/news/i-was-there-for-the-dot-com-bust-heres-why-the-ai-boom-isnt-the-same-175944680.html"},{"category":"company","date":1710866760,"headline":"Alphabet (GOOGL) Aids YouTube Music With Song Search Feature","id":126577397,"image":"","symbol":"GOOGL","publisher":"Yahoo","summary":"Alphabet's (GOOGL) Google launches a song search capability for YouTube Music on Android devices, boosting the Google Services segment.","url":"https://finance.yahoo.com/news/alphabet-googl-aids-youtube-music-164600410.html"},{"category":"company","date":1710862200,"headline":"Can the Cheapest \"Magnificent Seven\" Stock Turn $100,000 Into $1 Million?","id":126577400,"image":"https://g.foolcdn.com/editorial/images/769481/sitting-in-chair-throwing-money-in-air.jpg","symbol":"GOOGL","publisher":"Yahoo","summary":"You might think these dominant tech-enabled enterprises are expensive, but one company will challenge that assumption.","url":"https://www.fool.com/investing/2024/03/19/cheapest-magnificent-seven-stock-1-million/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;.tsrc=rss"},{"category":"company","date":1710860400,"headline":"Google Deepens AI Push Into Health Care With Fitbit, Screenings","id":126577401,"image":"https://s.yimg.com/ny/api/res/1.2/YqldUu3qE9KY5JZzqONssQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_technology_68/f8f09ed2353645366d7f43962514207a","symbol":"GOOGL","publisher":"Yahoo","summary":"(Bloomberg) -- Alphabet Inc.’s Google announced a slew of initiatives to deploy its artificial intelligence models in the health care industry, including a tool that will help Fitbit users glean insights from their wearable devices and a partnership to improve screenings for cancer and disease in India.Most Read from BloombergTrump Rules Out Vivek Ramaswamy as Running Mate as He Eyes New TeamApple Is in Talks to Let Google Gemini Power iPhone AI FeaturesNvidia Looks to Extend AI Dominance With N","url":"https://finance.yahoo.com/news/google-deepens-ai-push-health-150000314.html"},{"category":"company","date":1710858204,"headline":"Top 3 Ad-Tech Stocks For 2024","id":126577545,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1487322533/image_1487322533.jpg?io=getty-c-w1536","symbol":"GOOGL","publisher":"SeekingAlpha","summary":"The U.S. advertising market shows growth with a 4.3% YoY increase in January. We see opportunity in some leading ad-tech names, click for our picks!","url":"https://seekingalpha.com/article/4679186-top-3-ad-tech-stocks-for-2024"},{"category":"company","date":1710856680,"headline":"Alphabet (GOOGL) Soars 4.6%: Is Further Upside Left in the Stock?","id":126576252,"image":"https://media.zenfs.com/en/zacks.com/08a11e0480211461a5a105bd914b6012","symbol":"GOOGL","publisher":"Yahoo","summary":"Alphabet (GOOGL) was a big mover last session on higher-than-average trading volume. The latest trend in earnings estimate revisions might help the stock continue moving higher in the near term.","url":"https://finance.yahoo.com/news/alphabet-googl-soars-4-6-135800225.html"},{"category":"company","date":1710853632,"headline":"Why I Just Increased My Google Position","id":126575741,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1415832512/image_1415832512.jpg?io=getty-c-w1536","symbol":"GOOGL","publisher":"SeekingAlpha","summary":"Google stock lagged behind most Mag 7 and other AI-related stocks, but recent correction offers significant buying opportunity. Find out why GOOG stock is a Buy.","url":"https://seekingalpha.com/article/4679163-why-i-just-increased-my-google-position"},{"category":"company","date":1710851640,"headline":"Meta Bows Down to EU Regulations After Apple And Google, Cut Subscription Prices for Ad-Free Facebook and Instagram","id":126576172,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3405297882"},{"category":"company","date":1710850920,"headline":"Just Like Its Car Dreams, Is Apple Steering Away From AI? This Billionaire Investor Thinks So","id":126574116,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404544049"},{"category":"company","date":1710848880,"headline":"Microsoft brings in new execs to run consumer AI unit","id":126587218,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3405236705"},{"category":"company","date":1710848220,"headline":"Tesla's Model Y Price Increase: How It Impacts EV Giant's Stock","id":126574927,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3405222455"},{"category":"company","date":1710847500,"headline":"PDD's shopping app Temu mulls reducing reliance on US shoppers - report","id":126576176,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3405205536"},{"category":"company","date":1710846840,"headline":"Nvidia slips even as Wall Street commends 'impressive' GTC keynote; chips follow","id":126574117,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3405191095"},{"category":"company","date":1710844620,"headline":"Nvidia Has Global Dominance in Its Sights, Why It’s the New Apple. And 5 Other Things to Know Before Markets Open.","id":126570572,"image":"https://s.yimg.com/ny/api/res/1.2/tJRKi0ocH7TsMiFsS9NA_Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/Barrons.com/df2ef35c250a4f933a843e21b668a8a4","symbol":"GOOGL","publisher":"Yahoo","summary":"Google’s potential AI tie-up could spark antitrust concerns, Japan finally raises interest rates after 17 years, and other news to start your day.","url":"https://finance.yahoo.com/m/35945fe1-1811-3122-b9c9-41e3b9239c56/nvidia-has-global-dominance.html"},{"category":"company","date":1710844620,"headline":"Apple and Google Could Team Up on Generative AI. Here's Why Both \"Magnificent Seven\" Stocks Would Likely Win From a Deal.","id":126570571,"image":"https://g.foolcdn.com/editorial/images/769674/ai-on-smartphone.jpg","symbol":"GOOGL","publisher":"Yahoo","summary":"Both of these tech giants could win with incorporating Google Gemini into Apple's iPhones.","url":"https://www.fool.com/investing/2024/03/19/apple-and-google-could-team-up-on-generative-ai-he/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;.tsrc=rss"},{"category":"company","date":1710843370,"headline":"MORNING BID AMERICAS-Japan returns from upside-down world, AI fizzes","id":126571256,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"GOOGL","publisher":"Yahoo","summary":"If just two years ago, you'd imagined the day the Bank of Japan ended its negative interest rate era, you'd probably not have put the yen near 34-year lows through 150 per dollar or the Nikkei stock index within 2% of record highs.  Yet, here they are - and Bank of Japan policy rates are positive again for the first time since 2016 after the BOJ delivered its first rate hike in 17 years at Tuesday's meeting.","url":"https://finance.yahoo.com/news/morning-bid-americas-japan-returns-101610250.html"},{"category":"company","date":1710843000,"headline":"Nvidia slips as Wall Street digests Blackwell architecture unveiling","id":126574118,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3405109740"},{"category":"company","date":1710841440,"headline":"Market Clubhouse Morning Memo - March 19th, 2024 (Trade Strategy For SPY, QQQ, AAPL, MSFT, NVDA, GOOGL, META, And TSLA)","id":126574119,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3405076373"},{"category":"company","date":1710841288,"headline":"Meijer adds closed-loop measurement capabilities to retail media network","id":126577407,"image":"https://www.grocerydive.com/imgproxy/l9RdcJsPNRXiZOEyeWVJVIbYzkpWeaayIQlWTqpwves/g:ce/rs:fill:770:435:0/bG9jYWw6Ly8vZGl2ZWltYWdlL01laWplcl9Hcm9jZXJ5X3N0b3Jlcy5qcGc.webp","symbol":"GOOGL","publisher":"Yahoo","summary":"The platform’s newest tool offers brand partners enhanced feedback on in-store and online campaigns’ impacts on sales.","url":"https://www.grocerydive.com/news/meijer-closed-loop-measurement-retail-media-network-Google-technology-omnichannel/710674/"},{"category":"company","date":1710840960,"headline":"This Is the Cheapest \"Magnificent Seven\" Stock, According to Peter Lynch's Favorite Valuation Metric","id":126569616,"image":"https://g.foolcdn.com/editorial/images/769603/gettyimages-1463088844.jpg","symbol":"GOOGL","publisher":"Yahoo","summary":"This measure accounts for both valuation and growth.","url":"https://www.fool.com/investing/2024/03/19/cheapest-magnificent-seven-stock-peter-lynch/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;.tsrc=rss"},{"category":"company","date":1710839688,"headline":"Trending tickers: Nvidia, Apple, Unilever and Astrazeneca","id":126568726,"image":"https://s.yimg.com/ny/api/res/1.2/f_2IUjvW7Y3Zbzy9efUG.w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-03/0fe7e230-e5cf-11ee-bf73-2ad66c9fbd1f","symbol":"GOOGL","publisher":"Yahoo","summary":"The latest investor updates on stocks that are trending on Tuesday","url":"https://uk.finance.yahoo.com/news/nvidia-apple-unilever-astrazeneca-trending-tickers-091448319.html"},{"category":"company","date":1710838800,"headline":"What a Potential Apple and Alphabet AI Partnership Could Mean for Investors","id":126568728,"image":"https://g.foolcdn.com/editorial/images/769690/google-office-headquarters.jpg","symbol":"GOOGL","publisher":"Yahoo","summary":"This isn't the first time the two tech giants would collaborate.","url":"https://www.fool.com/investing/2024/03/19/what-a-potential-apple-and-alphabet-partnership-co/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;.tsrc=rss"},{"category":"company","date":1710836100,"headline":"The Bank Of Japan Is Finally Out Of Negative Rate Territory","id":126574121,"image":"","symbol":"GOOGL","publisher":"TalkMarkets","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404965905"},{"category":"company","date":1710835620,"headline":"CrowdStrike, Zscaler best positioned following healthcare hacks: Macquarie","id":126574122,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404956426"},{"category":"company","date":1710835560,"headline":"These 3 Companies Have Collectively Repurchased $1.07 Trillion of Their Own Stock Since the Start of 2013","id":126568274,"image":"https://g.foolcdn.com/editorial/images/769662/paper-certificate-shares-invest-stock-split-market-reverse-getty.jpg","symbol":"GOOGL","publisher":"Yahoo","summary":"One industry-leading company has spent north of $650 billion on share repurchases since 2013.","url":"https://www.fool.com/investing/2024/03/19/3-companies-repurchase-107-trillion-own-stock-2013/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;.tsrc=rss"},{"category":"company","date":1710835260,"headline":"Bank of Japan Ends Negative Interest Rate Policy, Yen Reacts","id":126574123,"image":"","symbol":"GOOGL","publisher":"GuruFocus","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404949715"},{"category":"company","date":1710835217,"headline":"The effort to ban TikTok faces potential 'graveyard' in Senate","id":126568275,"image":"https://s.yimg.com/ny/api/res/1.2/ciDDmP7uZmZk58lHHnu1_A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-03/3deb86b0-e146-11ee-a2cb-d4dfb8cb689e","symbol":"GOOGL","publisher":"Yahoo","summary":"The Senate was the key stumbling block in recent years when Washington confronted Big Tech. The question is whether that will change as it weighs the fate of TikTok in the US.","url":"https://finance.yahoo.com/news/the-effort-to-ban-tiktok-faces-potential-graveyard-in-senate-080017467.html"},{"category":"company","date":1710834900,"headline":"Notable open interest changes for March 19th","id":126574124,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404942285"},{"category":"company","date":1710834540,"headline":"Prediction: Alphabet Stock Will Take Off Again... and Here's Why.","id":126568276,"image":"https://g.foolcdn.com/editorial/images/768655/goog.jpg","symbol":"GOOGL","publisher":"Yahoo","summary":"Investors that think Alphabet is falling behind in the AI race are missing an important factor.","url":"https://www.fool.com/investing/2024/03/19/prediction-alphabet-stock-will-soar-heres-why/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;.tsrc=rss"},{"category":"company","date":1710833640,"headline":"Snowflake Stock (NASDAQ:SNOW): Now Attractive after 30%+ Tumble","id":126587235,"image":"","symbol":"GOOGL","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3405900451"},{"category":"company","date":1710833520,"headline":"Snowflake Stock (NASDAQ:SNOW): Now Attractive after Tumbling","id":126587238,"image":"","symbol":"GOOGL","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3405897773"},{"category":"company","date":1710833160,"headline":"Nvidia slips even as Wall Street commends 'impressive' GTC keynote","id":126574125,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404908278"},{"category":"company","date":1710833100,"headline":"Apple, Google AI partnership could be 'win/win,' says Evercore ISI","id":126574126,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404907707"},{"category":"company","date":1710832260,"headline":"Apple's In-House AI Features For iOS 18 Are Codenamed 'Project Graymatter,' Separate From Google's Gemini Features Being Discussed","id":126574127,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404892228"},{"category":"company","date":1710830880,"headline":"US Stocks Poised For Lower Open As Fed Jitters Dampen Tech Hopes; Oil Rally Pauses, Bitcoin Slides 8%","id":126574128,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404868715"},{"category":"company","date":1710830580,"headline":"Tuesday Talk: Still Talk Of The Town - Inflation","id":126574129,"image":"","symbol":"GOOGL","publisher":"TalkMarkets","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404861851"},{"category":"company","date":1710829860,"headline":"Meta offers to slash subscription fees for Facebook, Instagram in EU - report","id":126574130,"image":"","symbol":"GOOGL","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404850779"},{"category":"company","date":1710827280,"headline":"Asia Markets Mixed, Europe Gains, While Crude Oil Touches $82 - Global Markets Today While US Slept","id":126574030,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404808328"},{"category":"company","date":1710827220,"headline":"MrBeast Vs. Elon Musk: YouTuber Says X Is 'Not There' For Video Yet, 'They Need A Year Or Two To Build It Out'","id":126587380,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3405740222"},{"category":"company","date":1710826440,"headline":"Join The Bull Run: 3 Top Stocks You Can’t Afford to Miss","id":126574132,"image":"","symbol":"GOOGL","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404794404"},{"category":"company","date":1710825840,"headline":"From Six Figures to Seven: 7 Growth Stocks Set to Make Millionaires","id":126574137,"image":"","symbol":"GOOGL","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404784743"},{"category":"company","date":1710825840,"headline":"Bernstein not surprised Apple looking to potentially partner with Google on AI","id":126574136,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404785275"},{"category":"company","date":1710825840,"headline":"Musk says Google 'interferes to help Democrats' every election, NY Post says","id":126574133,"image":"","symbol":"GOOGL","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404785274"},{"category":"company","date":1710823260,"headline":"Ross Gerber Says 'Apple Using Google AI (Which Still Sucks) On iPhones In A Sad Admission They Missed Another Boat'","id":126574139,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404746965"},{"category":"company","date":1710819000,"headline":"Market Briefing For Tuesday, March 19, 2024","id":126574141,"image":"","symbol":"GOOGL","publisher":"TalkMarkets","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404688443"},{"category":"company","date":1710813540,"headline":"Investor Optimism Decreases Ahead Of Fed Meeting; S\u0026P Snaps 3-Session Losing Streak","id":126574142,"image":"","symbol":"GOOGL","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404617432"},{"category":"company","date":1710812760,"headline":"Bernstein Sticks to Their Hold Rating for Alphabet Class A (GOOGL)","id":126574144,"image":"","symbol":"GOOGL","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3404608438"},{"category":"company","date":1710785303,"headline":"Apple is getting serious about AI","id":126564168,"image":"https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1670366603.jpg?c=16x9\u0026q=w_800,c_fill","symbol":"GOOGL","publisher":"Yahoo","summary":"Apple researchers say they’ve developed a family of multimodal models — which refers to an AI system that can interpret and generate different types of data, such as text and images at the same time — called MM1.","url":"https://www.cnn.com/2024/03/18/tech/apple-ai-google-gemini?cid=external-feeds_iluminar_yahoo\u0026amp;.tsrc=rss"},{"category":"company","date":1710808370,"headline":"Dow Jones Futures Fall: Nvidia CEO Speech In Focus; Google, Tesla Surge Ahead Of Fed Meeting","id":126564144,"image":"https://media.zenfs.com/en/ibd.com/c17b5b65818a93054b26ab66c9c27269","symbol":"GOOGL","publisher":"Yahoo","summary":"Dow Jones Futures: Nvidia stock was in focus late Monday during CEO Jensen Huang's speech. Google and Tesla surged ahead of the Fed meeting.","url":"https://finance.yahoo.com/m/6171e83e-7dae-330e-b9bf-caef5b72d2c3/dow-jones-futures-fall%3A.html"},{"category":"company","date":1710809124,"headline":"Nvidia's new software tools meant for companies adding AI to business","id":126565377,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"GOOGL","publisher":"Yahoo","summary":"Nvidia on Monday unveiled software aimed at making it easier for businesses to incorporate artificial intelligence systems into their work, broadening the chipmaker's offerings.  The release highlights Nvidia's push to expand its presence in the AI application execution sector, called inference, where the company's chips don't dominate the market, said Joel Hellermark, CEO of Sana, a maker of AI assistants for companies.  Nvidia is best known for providing the chips used to train so-called foundation models like OpenAI's GPT-4.","url":"https://finance.yahoo.com/news/nvidias-software-tools-meant-companies-004524470.html"},{"category":"company","date":1710808065,"headline":"SEC Blasted by Judge for ‘Gross Abuse of Power’ in Crypto Case","id":126565378,"image":"https://s.yimg.com/ny/api/res/1.2/Vvn1ZK6kLesJvoH_i_OCuQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTk-/https://media.zenfs.com/en/bloomberg_markets_842/a4a404f15a018ddc43b4a6b578398830","symbol":"GOOGL","publisher":"Yahoo","summary":"(Bloomberg) -- A federal judge in Utah took the extremely unusual step of sanctioning the Securities and Exchange Commission, saying that the regulator abused its authority in a case against crypto platform Digital Licensing Inc., known as DEBT Box.Most Read from BloombergApple Is in Talks to Let Google Gemini Power iPhone AI FeaturesMusk Says His Ketamine Prescription Is in Investors’ Best InterestsTrump Rules Out Vivek Ramaswamy as Running Mate as He Eyes New TeamNvidia Unveils Successor to It","url":"https://finance.yahoo.com/news/sec-blasted-judge-gross-abuse-002745154.html"},{"category":"company","date":1710804454,"headline":"Google Gemini: Everything you need to know about the new generative AI platform","id":126565379,"image":"https://techcrunch.com/wp-content/uploads/2023/12/google-bard-gemini-v2.jpg?resize=1200,675","symbol":"GOOGL","publisher":"Yahoo","summary":"Google's trying to make waves with Gemini, a flagship suite of generative AI models, apps and services. But while Gemini appears to be promising in a few aspects, it's falling short in others -- as our informal review revealed. So what is Gemini? How can you use it? And how does it stack up to the competition? To make it easier to keep up with the latest Gemini developments, we've put together this handy guide, which we'll keep updated as new Gemini models, features and news about Google’s plans","url":"https://techcrunch.com/2024/03/18/what-is-google-gemini-ai/"}]}