{"id":3911,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2015-04-30","marketCap":3685.07,"name":"Blueprint Medicines Corp","phone":"16173747580.0","outstanding":60.79,"symbol":"BPMC","website":"https://www.blueprintmedicines.com/","industry":"Biotechnology"},"price":115.26125,"year":2024,"month":7,"day":9,"weekday":"Tuesday","title":"Historical Stock Price Performance of Blueprint Medicines Corp during Significant Market Events","date":"2024-07-09","url":"/posts/2024/07/09/BPMC","content":[{"section":"Crash of 2008","text":"During the global financial crisis in 2008, Blueprint Medicines Corp was not yet a publicly traded company. Therefore, it did not experience any impact on its stock price during this market crash."},{"section":"Market Rally of 2009-2010","text":"As Blueprint Medicines Corp is a relatively new company, it went public in 2015. Hence, it did not have any stock price data during the market rally of 2009-2010."},{"section":"COVID-19 Pandemic","text":"The COVID-19 pandemic had a significant impact on global markets, including the stock market. In February-March 2020, there was a sharp decline in stock prices due to the uncertainty and economic disruptions caused by the pandemic. Blueprint Medicines Corp's stock price also experienced a decline during this period, reflecting the overall market sentiment."},{"section":"Post-Pandemic Recovery","text":"Following the initial decline, the stock market began a recovery phase in late March 2020. Blueprint Medicines Corp's stock price also started to rebound during this period, benefiting from the overall market recovery and potential positive prospects for the biotechnology sector."},{"section":"Market Volatility in 2021","text":"In 2021, the stock market witnessed periods of increased volatility due to various factors, including inflation concerns and changing investor sentiment. Blueprint Medicines Corp's stock price may have experienced fluctuations during these periods of market volatility."},{"section":"Current Market Conditions","text":"It is important to note that stock prices are subject to various market factors and company-specific news and events. The performance of Blueprint Medicines Corp's stock may be influenced by a range of factors, including clinical trial outcomes, regulatory decisions, and industry trends."},{"section":"","text":""},{"section":"","text":""}],"tags":["LongSignals","Long","Biotechnology"],"news":[{"category":"company","date":1720508400,"headline":"Biotech Stocks 2024 Second Half Outlook - Buy Biotechs","id":128633774,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1483270209/image_1483270209.jpg?io=getty-c-w1536","symbol":"BPMC","publisher":"SeekingAlpha","summary":"Discover why biotech stocks have been lagging behind in 2024 but may soon see a turnaround with the potential for above market returns.","url":"https://seekingalpha.com/article/4703121-biotech-stocks-2024-second-half-outlook-buy-biotechs"},{"category":"company","date":1720087094,"headline":"CStone and Hengrui Enter into an Exclusive Promotion Agreement of AYVAKIT in Mainland China","id":128585141,"image":"","symbol":"BPMC","publisher":"Finnhub","summary":"Suzhou, China - CStone Pharmaceuticals , an innovation-driven biopharmaceutical company focused on the research and development of anti-cancer therapies, today announced that it has entered into an...","url":"https://finnhub.io/api/news?id=997c50a4f7e3032366ff7107a344096854e49d7d6ca7df4ac1c2876c357bd2ef"},{"category":"company","date":1719561840,"headline":"Expert Ratings For Blueprint Medicines","id":128511426,"image":"","symbol":"BPMC","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3558660228"},{"category":"company","date":1719550560,"headline":"Blueprint Medicines: A Strong Buy on Robust Pipeline and Strategic Growth Opportunities","id":128511427,"image":"","symbol":"BPMC","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3558495329"},{"category":"company","date":1719333574,"headline":"How IBD Stock Of The Day Blueprint Medicines 'Knocked It Out Of The Park'","id":128443016,"image":"https://media.zenfs.com/en/ibd.com/c7964d1e6ef401b565122d2198ad1670","symbol":"BPMC","publisher":"Yahoo","summary":"Blueprint Medicines is Tuesday's IBD Stock Of The Day. Shares are breaking a trendline, giving investors an early entry within a flat base.","url":"https://finance.yahoo.com/m/b1f36977-78a5-3aa9-a3dc-512582063203/how-ibd-stock-of-the-day.html"}]}