{"id":2130,"company":{"country":"US","currency":"USD","exchange":"NEW YORK STOCK EXCHANGE, INC.","ipo":"1907-12-31","marketCap":5150.97,"name":"Brunswick Corp","phone":"18477354700.0","outstanding":69.83,"symbol":"BC","website":"https://www.brunswick.com/","industry":"Leisure Products"},"price":93.06375,"year":2023,"month":12,"day":15,"weekday":"Friday","title":"Ownership Structure of Brunswick Corp Stock","date":"2023-12-15","url":"/posts/2023/12/15/BC","content":[{"section":"Institutional Investors","text":"According to the latest available data, institutional investors hold a significant portion of Brunswick Corp stock. As of the most recent filing, institutional ownership stands at approximately X%. This indicates that large financial institutions, such as mutual funds, pension funds, and investment firms, have a substantial stake in the company."},{"section":"Insider Ownership","text":"Insider ownership refers to the shares of a company held by its executives, directors, and other individuals closely associated with the business. In the case of Brunswick Corp, insider ownership is reported to be approximately X%. This suggests that company insiders have a notable interest in the company's performance and success."},{"section":"Major Shareholders","text":"While specific details may vary, some of the major shareholders of Brunswick Corp stock include institutional investors such as X Fund, Y Asset Management, and Z Capital. These institutions hold significant positions in the company and play a crucial role in shaping its ownership structure and decision-making."},{"section":"Other Shareholders","text":"Apart from institutional investors and insiders, there are also individual retail investors who hold shares of Brunswick Corp stock. The ownership percentage of retail investors varies and can be influenced by factors such as market conditions and investor sentiment."},{"section":"Beneficial Ownership","text":"Beneficial ownership refers to the ultimate ownership of shares, even if held in the name of an intermediary or nominee. It is essential to note that beneficial ownership information may not be readily available or publicly disclosed for all shareholders."},{"section":"Changing Ownership","text":"The ownership structure of Brunswick Corp stock can change over time as institutions buy or sell shares and insiders modify their holdings. Regular filings with regulatory authorities, such as the Securities and Exchange Commission (SEC), provide updates on changes in ownership."},{"section":"Impact on Company","text":"The ownership structure of a company, including the presence of institutional investors and insider ownership, can influence corporate governance practices and decision-making processes. It is crucial for investors to consider the ownership structure when evaluating a company's strategic direction and potential risks."},{"section":"Conclusion","text":"Institutional investors, insiders, and major shareholders play a significant role in the ownership structure of Brunswick Corp stock. Their collective holdings shape the overall ownership landscape and can impact the company's operations and direction."}],"tags":["CrossOver55","Long","Leisure Products"],"news":[{"category":"company","date":1702534980,"headline":"Brunswick Reaches Analyst Target Price","id":124531547,"image":"","symbol":"BC","publisher":"ETF Channel","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3256674963"},{"category":"company","date":1702275720,"headline":"Analysts Are Bullish on These NA Stocks: Brunswick (BC), Macy’s (M)","id":124447732,"image":"","symbol":"BC","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3251244852"},{"category":"company","date":1702196559,"headline":"Dividend Champion, Contender, And Challenger Highlights: Week Of December 10","id":124423322,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1072593728/image_1072593728.jpg?io=getty-c-w1536","symbol":"BC","publisher":"SeekingAlpha","summary":"A weekly summary of dividend activity for Dividend Champions, Contenders, and Challengers. Read more to see the December 10 weekly update.","url":"https://seekingalpha.com/article/4657087-dividend-champion-contender-challenger-week-of-december-10"},{"category":"company","date":1701928694,"headline":"Brunswick Corporation Named by Newsweek Magazine as One of America's Most Responsible Companies for Fourth Consecutive Year","id":124356431,"image":"","symbol":"BC","publisher":"Finnhub","summary":"Brunswick Corporation , the world's largest marine technology company, has been named one of America's Most Responsible Companies by Newsweek for the fourth consecutive year.From the thousands U.S....","url":"https://finnhub.io/api/news?id=d3c516524c6bc0ad30ad3cf68b3ac6d1c94ada1c7b7c9e0d8564350a3f97257b"},{"category":"company","date":1701879300,"headline":"Brunswick Corporation Named by Newsweek Magazine as One of America’s Most Responsible Companies for Fourth Consecutive Year","id":124351662,"image":"https://s.yimg.com/ny/api/res/1.2/IDxYW8y5iS1y9aI8keBgiA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0xODg-/https://media.zenfs.com/en/globenewswire.com/548be94fe5c4a226f4fc4964a31d53bc","symbol":"BC","publisher":"Yahoo","summary":"METTAWA, Ill., Dec. 06, 2023 (GLOBE NEWSWIRE) -- Brunswick Corporation (NYSE:BC), the world’s largest marine technology company, has been named one of America’s Most Responsible Companies by Newsweek for the fourth consecutive year. From the thousands U.S. companies considered for this honor, only 600 made the Newsweek list of honorees. Throughout 2023, Brunswick has been recognized with numerous accolades for its industry-leading environmental, social, and corporate governance (ESG) efforts. Sp","url":"https://finance.yahoo.com/news/brunswick-corporation-named-newsweek-magazine-161500495.html"},{"category":"company","date":1701862020,"headline":"Electric vehicle, boating and RV stocks could benefit as high-interest rate worries fade","id":124335018,"image":"","symbol":"BC","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3244306016"},{"category":"company","date":1701688794,"headline":"Is There Now An Opportunity In Brunswick Corporation (NYSE:BC)?","id":124274544,"image":"https://media.zenfs.com/en/simply_wall_st__316/044527dc303068ac9ca156aafbedfd45","symbol":"BC","publisher":"Yahoo","summary":"Brunswick Corporation ( NYSE:BC ), is not the largest company out there, but it saw a significant share price rise of...","url":"https://finance.yahoo.com/news/now-opportunity-brunswick-corporation-nyse-111954849.html"},{"category":"company","date":1701400140,"headline":"BC Makes Bullish Cross Above Critical Moving Average","id":124246100,"image":"","symbol":"BC","publisher":"Dividend Channel","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3237440029"}]}