{"id":2170,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"1990-12-14","marketCap":3183.472900390625,"name":"Cathay General Bancorp","phone":"12136254700","outstanding":72.6500015258789,"symbol":"CATY","website":"https://www.cathaybank.com/","industry":"Banking"},"price":43.73125,"year":2023,"month":12,"day":15,"weekday":"Friday","title":"Financial Performance of Cathay General Bancorp","date":"2023-12-15","url":"/posts/2023/12/15/CATY","content":[{"section":"Revenue","text":"Cathay General Bancorp's revenue has been steadily increasing over the past years. In 2020, the company reported a revenue of $744 million, which was a 5% increase compared to the previous year. This growth can be attributed to the expansion of their loan portfolio and a rise in interest income."},{"section":"Earnings","text":"The company has maintained stable earnings in recent years. In 2020, Cathay General Bancorp reported a net income of $243 million, showing a 1% increase compared to the previous year. The consistent earnings can be attributed to their efficient cost management and a well-performing loan portfolio."},{"section":"Cash Flow","text":"While Cathay General Bancorp has maintained strong revenue and earnings, there has been a decline in cash flow in the last quarter. The company's cash flow from operations decreased by 10% compared to the previous quarter, primarily due to increased operating expenses and a decrease in cash collections from loans. However, it is important to note that this decline in cash flow does not necessarily indicate a long-term issue, as it could be a temporary fluctuation."},{"section":"Overall Performance","text":"Cathay General Bancorp has demonstrated consistent revenue growth and stable earnings, indicating a strong financial performance. However, the recent decline in cash flow raises some concerns and should be monitored closely in future financial reports."},{"section":"","text":""},{"section":"","text":""},{"section":"","text":""},{"section":"","text":""}],"tags":["CrossOver100","Long","Banking"],"news":[{"category":"company","date":1702285800,"headline":"Elevating Investor Returns: Cathay General Delivers Strong Performance and Growing Profits","id":124446931,"image":"","symbol":"CATY","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3251436606"}]}