{"id":2166,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"1989-06-20","marketCap":2045.57,"name":"First Merchants Corp","phone":"17657471500","outstanding":59.85,"symbol":"FRME","website":"https://ir.firstmerchants.com/","industry":"Banking"},"price":37.46,"year":2023,"month":12,"day":15,"weekday":"Friday","title":"Recent News and Events Impacting First Merchants Corp Stock","date":"2023-12-15","url":"/posts/2023/12/15/FRME","content":[{"section":"1. Q2 2021 Earnings Report","text":"First Merchants Corp recently released its Q2 2021 earnings report, which showed strong financial performance. The company reported earnings per share (EPS) of $1.14, surpassing Wall Street expectations of $0.96. Net income for the quarter was $59.2 million, representing a 30% increase compared to the same period last year. This positive earnings report has had a significant impact on the stock performance, leading to an increase in share price."},{"section":"2. Acquisition of Bank of America Branches","text":"First Merchants Corp announced its acquisition of 14 Bank of America branches in Indiana. This strategic move is expected to expand the company's presence in the state and enhance its market share. The acquisition will add approximately $900 million in deposits to First Merchants Corp's balance sheet. This news has been viewed positively by investors, resulting in an upward trend in the stock price."},{"section":"3. Expansion into Kentucky Market","text":"First Merchants Corp recently announced its expansion into the Kentucky market through the acquisition of Peoples Bancorp Inc. This acquisition will add 20 branches and $1.2 billion in assets to First Merchants Corp's portfolio. It is expected to significantly increase the company's customer base and market presence. This expansion has attracted investor attention and contributed to the positive performance of the stock."},{"section":"4. Increase in Dividend","text":"First Merchants Corp recently announced a 7.7% increase in its quarterly cash dividend, bringing it to $0.28 per share. This dividend increase reflects the company's strong financial position and demonstrates its commitment to returning value to shareholders. The news of the dividend increase has been well-received by investors, contributing to the positive sentiment towards the stock."},{"section":"5. Regulatory Approval for Acquisition","text":"First Merchants Corp received regulatory approval from the Office of the Comptroller of the Currency (OCC) for its acquisition of Peoples Bancorp Inc. This approval is a significant milestone in the acquisition process and demonstrates the company's ability to navigate regulatory requirements. The clearance has provided investors with confidence in the acquisition and its potential benefits, contributing to the positive performance of the stock."}],"tags":["CrossOver100","Long","Banking"],"news":[{"category":"company","date":1702557720,"headline":"First Merchants (FRME) Moves 7.1% Higher: Will This Strength Last?","id":124510894,"image":"https://media.zenfs.com/en/zacks.com/1154d43aaeb65735a640003549116295","symbol":"FRME","publisher":"Yahoo","summary":"First Merchants (FRME) witnessed a jump in share price last session on above-average trading volume. The latest trend in earnings estimate revisions for the stock doesn't suggest further strength down the road.","url":"https://finance.yahoo.com/news/first-merchants-frme-moves-7-124200586.html"},{"category":"company","date":1702536180,"headline":"FRME Crosses Above Average Analyst Target","id":124516522,"image":"","symbol":"FRME","publisher":"ETF Channel","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3256694520"},{"category":"company","date":1702196559,"headline":"Dividend Champion, Contender, And Challenger Highlights: Week Of December 10","id":124423322,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1072593728/image_1072593728.jpg?io=getty-c-w1536","symbol":"FRME","publisher":"SeekingAlpha","summary":"A weekly summary of dividend activity for Dividend Champions, Contenders, and Challengers. Read more to see the December 10 weekly update.","url":"https://seekingalpha.com/article/4657087-dividend-champion-contender-challenger-week-of-december-10"},{"category":"company","date":1701924900,"headline":"First Merchants management to meet with Piper Sandler","id":124375344,"image":"","symbol":"FRME","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3245719825"}]}