{"id":2001,"company":{"country":"FR","currency":"EUR","exchange":"NYSE EURONEXT - EURONEXT PARIS","ipo":"2008-03-19","marketCap":8500.38,"name":"Vivendi SE","phone":"33171713280","outstanding":1011.21,"symbol":"VIVEF","website":"https://www.vivendi.com/","industry":"Media"},"price":10.76375,"year":2023,"month":12,"day":15,"weekday":"Friday","title":"Competitive Positioning of Vivendi SE","date":"2023-12-15","url":"/posts/2023/12/15/VIVEF","content":[{"section":"Market Share","text":"Vivendi SE holds a significant market share within its industry. While precise numbers are not available, the company's various subsidiaries and investments, including Universal Music Group, Canal+ Group, and Gameloft, contribute to its overall market presence."},{"section":"Innovation","text":"Vivendi SE demonstrates a commitment to innovation within its industry. The company continuously explores new business models and technologies in order to adapt to changing consumer preferences and market trends. For instance, Universal Music Group has been at the forefront of digital music distribution and streaming services, staying ahead of competitors by embracing new platforms and partnerships, such as with Spotify and Apple Music."},{"section":"Strategic Acquisitions","text":"Vivendi SE has strategically acquired companies and formed partnerships to strengthen its competitive positioning. For example, its acquisition of Editis, a leading French publishing group, expands the company's presence in the publishing industry. Additionally, Vivendi SE's investment in telecommunications provider Telecom Italia enhances its reach and diversification."},{"section":"Global Reach","text":"Vivendi SE's global reach contributes to its competitive position. Through its subsidiaries and investments, the company has a presence in numerous countries, allowing it to capture a diverse range of markets and expand its customer base. This geographical diversity helps mitigate risks associated with regional market fluctuations."},{"section":"Brand Portfolio","text":"Vivendi SE boasts a strong brand portfolio, encompassing renowned names like Universal Music Group and Canal+. These brands enjoy wide recognition and consumer loyalty, contributing to the company's competitive advantage within the industry. The diversified nature of Vivendi SE's brand portfolio also allows for cross-promotion and synergies."}],"tags":["CrossOver21","Long","Media"],"news":[{"category":"company","date":1702639503,"headline":"UPDATE 1-Vivendi files complaint over Telecom Italia grid sale -sources","id":124536141,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"VIVEF","publisher":"Yahoo","summary":"Telecom Italia (TIM) top investor Vivendi has filed a complaint with a Milan court to challenge a 19-billion-euro ($20.82 billion) sale of the former phone monopoly's domestic fixed-line network to KKR , three sources said on Friday.  In its complaint Vivendi asked for the court to annul the decision by TIM's board to sell the network, two sources said, adding that the filing does not request the immediate suspension of the deal under a fast-track procedure.  Telecom Italia's board agreed on Nov.5 to sell the group's most valuable asset, as part of a plan championed by TIM Chief Executive Pietro Labriola to revive the telecoms group and slash its heavy debt pile.","url":"https://finance.yahoo.com/news/1-vivendi-files-complaint-over-112503100.html"},{"category":"company","date":1702616425,"headline":"The break-up that could reshape Bolloré’s empire","id":124532260,"image":"","symbol":"VIVEF","publisher":"Yahoo","summary":"One thing to start: BP has denied to senior staff that the board was “unduly harsh” in its decision to claw back millions of pounds in pay from Bernard Looney, in a move that underscores unease over the abrupt departure of the former chief executive.  Vincent Bolloré spent years insisting his media conglomerate Vivendi was “a coherent company and not a disparate set of holdings”.  On Wednesday, the company announced it would explore splitting into three separate businesses, an unexpected holiday gift for investors who saw the shares jump more than 10 per cent following the news.","url":"https://finance.yahoo.com/m/846e84ec-0c1d-3b60-bf37-b32898281309/the-break-up-that-could.html"},{"category":"company","date":1702579537,"headline":"Pound jumps as Bank of England warns no interest rate cuts coming soon","id":124516621,"image":"https://www.telegraph.co.uk/content/dam/business/2023/12/14/TELEMMGLPICT000359912611_17025446734460_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQf0Rf_Wk3V23H2268P_XkPxc.jpeg?impolicy=logo-overlay","symbol":"VIVEF","publisher":"Yahoo","summary":"The pound has leapt higher after Bank of England held interest rates at their current 15-year high and signalled cuts were not coming soon.","url":"https://www.telegraph.co.uk/business/2023/12/14/ftse-100-markets-news-interest-rate-decision-bank-england/"},{"category":"company","date":1702578458,"headline":"Vincent Bolloré changes tack with Vivendi break-up plan","id":124519633,"image":"","symbol":"VIVEF","publisher":"Yahoo","summary":"Growing valuation discount since Universal Music spin-out has been source of frustration for French billionaire","url":"https://finance.yahoo.com/m/a7f05417-7088-3a50-8733-58318f9dfac7/vincent-bollor%C3%A9-changes-tack.html"},{"category":"company","date":1702568785,"headline":"Vivendi to Consider Options for Telecom Italia Stake","id":124512614,"image":"https://s.yimg.com/ny/api/res/1.2/lC0t1dVZciUuXQ6EmmS4Ow--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_markets_842/2ca7ca15d3ef4b07fc8ad1aac00ea9ba","symbol":"VIVEF","publisher":"Yahoo","summary":"(Bloomberg) -- Vivendi SE is considering options for its €1.3 billion ($1.4 billion) stake in former phone monopoly Telecom Italia SpA as billionaire Vincent Bolloré explores a reorganization of the French conglomerate, people familiar with the matter said.Most Read from BloombergWall Street Traders Go All-In on Great Monetary Pivot of 2024Citigroup Offers Partial Early Bonuses to Encourage Staff DeparturesOwner of the Philippines’ Largest Malls Says China Feud May Hurt BusinessesRange Rovers Be","url":"https://finance.yahoo.com/news/vivendi-consider-options-telecom-italia-152542145.html"},{"category":"company","date":1702568315,"headline":"Vivendi: break-up would reward Bolloré family with rule of three","id":124514539,"image":"","symbol":"VIVEF","publisher":"Yahoo","summary":"If Vivendi today were the Rolling Stones then Mick Jagger would have already left the band.  Universal Music was the frontman of the French media conglomerate that is controlled by French tycoon Vincent Bolloré.  Fans have abandoned Vivendi’s shares and the conglomerate discount is now close to 40 per cent. The Bolloré family was spurred to act.","url":"https://finance.yahoo.com/m/dbd6e0ce-f48c-3e29-b4c1-f8ec9e803045/vivendi%3A-break-up-would.html"},{"category":"company","date":1702563240,"headline":"Vivendi climbs as media group explores splitting into 3 businesses","id":124512615,"image":"https://s.yimg.com/ny/api/res/1.2/OQUuGQ340vKNswPqNL2mYA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/thestreet.com/224c65128931d37324245adc5acaa53a","symbol":"VIVEF","publisher":"Yahoo","summary":"Vivendi says the split would 'fully unleash the development potential of all its activities.'","url":"https://finance.yahoo.com/m/5ad37a3a-f86e-33f3-bc30-b1e38e91d7e6/vivendi-climbs-as-media-group.html"},{"category":"company","date":1702546911,"headline":"Billionaire Bolloré Eyes Vivendi Breakup in Strategic U-Turn","id":124508508,"image":"https://s.yimg.com/ny/api/res/1.2/IZ2hHXivsCI037Ew40DJ0w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_technology_68/3794954ecf9d062a4a71ecf331923d06","symbol":"VIVEF","publisher":"Yahoo","summary":"(Bloomberg) -- French billionaire Vincent Bolloré is weighing a breakup of his sprawling media and entertainment empire, Vivendi SE, in a strategic reversal aimed at reviving the value of its businesses. The shares surged.Most Read from BloombergCitigroup Offers Partial Early Bonuses to Encourage Staff DeparturesElon Musk Is Planning a New University in AustinJPMorgan Is in a Fight Over Its Client’s Lost $50 Million FortuneFed Pivots to Rate Cuts as Inflation Heads Toward 2% GoalTesla Recalls 2","url":"https://finance.yahoo.com/news/billionaire-bollore-eyes-vivendi-breakup-085704905.html"},{"category":"company","date":1702544706,"headline":"Vivendi shares jump on break-up plan","id":124512617,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"VIVEF","publisher":"Yahoo","summary":"Shares in French media group controlled by Vincent Bolloré increase more than 10 per cent in Paris trading","url":"https://finance.yahoo.com/m/85ec728b-0f4f-39ca-a941-0a823154794a/vivendi-shares-jump-on.html"},{"category":"company","date":1702534260,"headline":"Vivendi shares surge as media conglomerate outlines plans to split","id":124525872,"image":"https://images.mktw.net/im-01931561/social","symbol":"VIVEF","publisher":"MarketWatch","summary":"The French firm said it is exploring plans to split into three separately listed companies, including Havas, Canal+, and an investment firm","url":"https://www.marketwatch.com/story/vivendi-shares-surge-as-media-conglomerate-outlines-plans-to-split-itself-in-three-e53dfa00"},{"category":"company","date":1702525380,"headline":"Vivendi Shares Rise on Breakup Plan","id":124525874,"image":"https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png","symbol":"VIVEF","publisher":"MarketWatch","summary":"By Adria Calatayud Vivendi shares jumped after the French media group said it will explore a possible split into three businesses around Canal+, Havas and an...","url":"https://www.marketwatch.com/story/vivendi-shares-rise-on-breakup-plan-fed8f424"},{"category":"company","date":1702512896,"headline":"PRESS DIGEST- Financial Times - Dec. 14","id":124502238,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"VIVEF","publisher":"Yahoo","summary":"French media conglomerate Vivendi is considering splitting itself up into three businesses that would all be listed separately, in what would be a major overhaul piloted by owner Vincent Bolloré.  - British regulators plan to reintroduce a cap on card fees imposed on transactions between the UK and EU, in a blow to the Visa and Mastercard duopoly that raised charges on businesses more than fivefold since Brexit.  - UK prime minister Rishi Sunak tried to calm tensions in his fractured party over his Rwanda migration policy, as a poll showed that his now as unpopular as Boris Johnson in his final days in office.","url":"https://finance.yahoo.com/news/press-digest-financial-times-dec-001456304.html"},{"category":"company","date":1702502877,"headline":"Vivendi floats plan to split itself up","id":124502239,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"VIVEF","publisher":"Yahoo","summary":"French media group controlled by Vincent Bolloré says it will study break-up option to maximise value","url":"https://finance.yahoo.com/m/85ec728b-0f4f-39ca-a941-0a823154794a/vivendi-floats-plan-to-split.html"},{"category":"company","date":1702501605,"headline":"Vivendi Explores Breakup of Media Empire in Chase for Deals","id":124502240,"image":"https://s.yimg.com/ny/api/res/1.2/i.0jQODZiUaPOx4XfcxgZw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_markets_842/3794954ecf9d062a4a71ecf331923d06","symbol":"VIVEF","publisher":"Yahoo","summary":"(Bloomberg) -- Vivendi SE is considering splitting up its media and entertainment empire into several companies to better take advantage of each unit’s strength.Most Read from BloombergJPMorgan Is in a Fight Over Its Client’s Lost $50 Million FortuneCitigroup Offers Partial Early Bonuses to Encourage Staff DeparturesTesla Recalls 2 Million Cars to Fix Autopilot Safety FlawsFed Pivots to Rate Cuts as Inflation Heads Toward 2% GoalElon Musk Is Planning a New University in AustinSince listing Unive","url":"https://finance.yahoo.com/news/vivendi-explores-breakup-media-empire-210645461.html"},{"category":"company","date":1702501433,"headline":"UPDATE 1-Media giant Vivendi to examine spinning off some units onto stock market","id":124502241,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"VIVEF","publisher":"Yahoo","summary":"French media company Vivendi said it had decided to examine splitting up some of its activities into several entities, each of which would then be listed on the stock market, in order to boost their growth and development.  Vivendi - in which France's billionaire Bollore family holds the biggest individual stake - said the businesses that could be spun off in this way included its TV unit Canal Plus, advertising arm Havas and an investment company holding its stake in French company Lagardere.  \"The investment company would actively support the strategic development of its portfolio companies and would focus on value creation and capital return to its shareholders, through an effective portfolio rotation and a targeted reinvestment policy,\" said Vivendi in a statement.","url":"https://finance.yahoo.com/news/1-media-giant-vivendi-examine-210353854.html"},{"category":"company","date":1702497840,"headline":"Vivendi to Explore Split Into Three Businesses","id":124502242,"image":"https://s.yimg.com/ny/api/res/1.2/oiUKhxp8fJlol4sRZAZ9pw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/c6e16e1346a769af2bfa1ce61b771ce2","symbol":"VIVEF","publisher":"Yahoo","summary":"The French digital entertainment and communications company will examine a possible split into three businesses around Canal+, Havas and an investment company.","url":"https://finance.yahoo.com/m/2d412847-a65e-337f-be52-9744038f0509/vivendi-to-explore-split-into.html"},{"category":"company","date":1702497480,"headline":"Vivendi Will Study a Project to Split Its Activities Into Several Entities","id":124502243,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"VIVEF","publisher":"Yahoo","summary":"PARIS, December 13, 2023--Regulatory News: Since the distribution and listing of Universal Music Group in 2021, Vivendi (Paris:VIV) has endured a significantly high conglomerate discount, substantially reducing its valuation and thereby limiting its ability to carry out external growth transactions for its subsidiaries.","url":"https://finance.yahoo.com/news/vivendi-study-project-split-activities-195800561.html"},{"category":"company","date":1702470597,"headline":"UPDATE 2-Telecom Italia chair set to leave job as Vivendi readies legal battle","id":124486207,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"VIVEF","publisher":"Yahoo","summary":"Telecom Italia (TIM) Chairman Salvatore Rossi will not seek another mandate as head of the former phone monopoly's board when his term ends next year, the executive told Reuters on Wednesday, confirming an earlier source-based report.  Rossi's decision comes after TIM approved a 19-billion euro sale of its prized fixed-line grid to U.S. fund KKR, a move opposed by TIM's top investor Vivendi, which is expected to challenge it in court.  Rossi, a former senior official at the Bank of Italy, is set to inform directors of his plans on Thursday, according to a source briefed on the matter.","url":"https://finance.yahoo.com/news/2-telecom-italia-chair-set-122957232.html"},{"category":"company","date":1702314060,"headline":"Vivendi: Approval of the Extension of the Exercise Period of the Rights to Sell Lagardère Shares to June 15, 2025","id":124440300,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"VIVEF","publisher":"Yahoo","summary":"PARIS, December 11, 2023--Regulatory News :","url":"https://finance.yahoo.com/news/vivendi-approval-extension-exercise-period-170100499.html"}]}