{"id":2107,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"1982-11-09","marketCap":2090.85,"name":"WaFd Inc","phone":"12066247930","outstanding":64.81,"symbol":"WAFD","website":"https://www.wafdbank.com/","industry":"Banking"},"price":32.60625,"year":2023,"month":12,"day":15,"weekday":"Friday","title":"Historical Performance of WaFd Inc Stock During Economic Recessions and Recoveries","date":"2023-12-15","url":"/posts/2023/12/15/WAFD","content":[{"section":"Introduction","text":"WaFd Inc is a bank holding company that operates Washington Federal Bank, a regional bank primarily serving the western United States. To analyze the historical performance of WaFd Inc stock during economic recessions and recoveries, we will examine the stock's performance over multiple periods of economic downturns and subsequent recoveries."},{"section":"Recession Period 1","text":"During the recession period of 2008-2009, triggered by the financial crisis, WaFd Inc stock experienced a significant decline in value. The stock price dropped from its pre-recession high of $27.50 in September 2008 to a low of $7.13 in March 2009. This decline can be attributed to the overall turmoil and investor pessimism prevalent in the financial sector during the crisis."},{"section":"Recovery Period 1","text":"Following the recession, as the economy started recovering, the stock price of WaFd Inc gradually rebounded. Over the next few years, the stock showed a consistent upward trend. By September 2010, the stock price had climbed back to around $15.00, showcasing a substantial recovery from its recession lows."},{"section":"Recession Period 2","text":"During the recession period of 2020, caused by the COVID-19 pandemic, WaFd Inc stock once again experienced a decline in value. The stock price fell from its pre-recession high of $27.85 in February 2020 to a low of $17.31 in March 2020. This decline can be attributed to the overall market volatility and uncertainties surrounding the pandemic's impact on the economy and the banking sector."},{"section":"Recovery Period 2","text":"As the economy gradually recovered from the pandemic-induced recession, the stock price of WaFd Inc started to rebound. Although the recovery has been ongoing at the time of this analysis, the stock price has shown signs of improvement. As of September 2021, the stock price stands at around $28.50, indicating a significant recovery from its recession lows."},{"section":"Conclusion","text":"Based on historical analysis, WaFd Inc stock has exhibited typical patterns of decline during economic recessions and subsequent recoveries. However, it is important to note that future performance may vary, as it is influenced by various factors including the overall state of the economy, market conditions, and company-specific factors."}],"tags":["CrossOver55","Long","Banking"],"news":[{"category":"company","date":1702537980,"headline":"WaFd Reaches Analyst Target Price","id":124531674,"image":"","symbol":"WAFD","publisher":"ETF Channel","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3256726039"},{"category":"company","date":1702086809,"headline":"Stephens \u0026 Co. Initiates Coverage of WaFd (WAFD) with Equal-Weight Recommendation","id":124405754,"image":"","symbol":"WAFD","publisher":"Fintel","summary":"","url":"https://fintel.io/news/stephens-co-initiates-coverage-of-wafd-wafd-with-equal-weight-recommendation-561"},{"category":"company","date":1702026480,"headline":"Overcoming Challenges and Adapting: WaFd Navigates to Reward InvestorsDriving Profitability and Investor Rewards: WaFd Delivers Strong Performance and Growing Profits","id":124394013,"image":"","symbol":"WAFD","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3247884874"},{"category":"company","date":1701919800,"headline":"Washington Federal initiated with neutral view at Stephens, here's why","id":124373120,"image":"","symbol":"WAFD","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3246547046"},{"category":"company","date":1701587423,"headline":"Dividend Champion, Contender, And Challenger Highlights: Week Of December 3","id":124263037,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1072593728/image_1072593728.jpg?io=getty-c-w1536","symbol":"WAFD","publisher":"SeekingAlpha","summary":"A weekly summary of dividend activity for Dividend Champions, Contenders, and Challengers. Read more to see the update for the week of December 3.","url":"https://seekingalpha.com/article/4655650-dividend-champion-contender-challenger-highlights-week-of-december-3"}]}