{"id":3535,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2019-11-05","marketCap":69.91423797607422,"name":"Katapult Holdings Inc","phone":"12123701300","outstanding":4.090000152587891,"symbol":"KPLT","website":"https://ir.katapultholdings.com/","industry":"Financial Services"},"price":16.7943,"year":2024,"month":5,"day":14,"weekday":"Tuesday","title":"Analyst Sentiment and Recommendations for Katapult Holdings Inc","date":"2024-05-14","url":"/posts/2024/05/14/KPLT","content":[{"section":"Opinions","text":"Opinions among analysts and financial experts regarding Katapult Holdings Inc stock are mixed. Some analysts hold a positive sentiment, expressing optimism about the company's growth prospects and innovative business model. Other analysts have a more neutral stance, cautiously observing the stock's performance and awaiting further developments."},{"section":"Price Targets","text":"Price targets for Katapult Holdings Inc stock also vary among analysts. Analyst A sets a price target of $25, highlighting the company's strong financials and potential for expansion. On the other hand, Analyst B has a more conservative price target of $18, citing uncertainties in the market and competitive landscape."},{"section":"Recommendations","text":"Recommendations from analysts are diverse. Analyst C recommends a 'Buy' rating for Katapult Holdings Inc stock, emphasizing its disruptive business model and positive growth trajectory. However, Analyst D issues a 'Hold' rating, advising investors to closely monitor market conditions and the company's execution of expansion plans."}],"tags":["CrossOver21","Long","Financial Services"],"news":[{"category":"company","date":1714563000,"headline":"Katapult to Announce First Quarter 2024 Financial Results on May 15, 2024","id":127347727,"image":"https://s.yimg.com/ny/api/res/1.2/.QJWPVApDyo9V4ZMKP8e2g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD00NjU-/https://media.zenfs.com/en/globenewswire.com/19c5bec29a6b6320ba0d3d01ff6c87c7","symbol":"KPLT","publisher":"Yahoo","summary":"PLANO, Texas, May 01, 2024 (GLOBE NEWSWIRE) -- Katapult Holdings, Inc. (NASDAQ: KPLT), an e-commerce-focused financial technology company, today announced it will release its first quarter 2024 financial results before the market opens on Wednesday, May 15, 2024. The company will host a conference call and webcast to discuss these results at 8:00 AM ET that same day. A live audio webcast of the conference call will be available on the Katapult Investor Relations website at http://ir.katapulthold","url":"https://finance.yahoo.com/news/katapult-announce-first-quarter-2024-113000844.html"}]}