{"id":384,"company":{"country":"US","currency":"USD","exchange":"NEW YORK STOCK EXCHANGE, INC.","ipo":"1962-01-31","marketCap":4188.98193359375,"name":"Vornado Realty Trust","phone":"12128947000.0","outstanding":190.32000732421875,"symbol":"VNO.PRM","website":"https://www.vno.com/","industry":"Real Estate"},"price":14.9075,"year":2023,"month":11,"day":3,"weekday":"Friday","title":"Risks Associated with Investing in Vornado Realty Trust Stock","date":"2023-11-03","url":"/posts/2023/11/03/VNO.PRM","content":[{"section":"1. Economic Downturns","text":"Vornado Realty Trust, being a real estate investment trust (REIT), is highly susceptible to economic downturns. During recessions or periods of economic instability, demand for commercial real estate may decrease, leading to lower occupancy rates and reduced rental income for Vornado. This can negatively impact the company's financial performance and stock price."},{"section":"2. Interest Rate Movements","text":"Interest rate movements can significantly affect Vornado Realty Trust's financials. As a REIT, Vornado relies on borrowing funds to finance its real estate projects. Increases in interest rates can raise the cost of borrowing, potentially decreasing the company's profitability and cash flow. Moreover, higher interest rates may also reduce demand for commercial properties, further impacting Vornado's revenue."},{"section":"3. Competitive Real Estate Market","text":"Vornado operates in a highly competitive real estate market, especially in major cities like New York and Washington, D.C., where it owns substantial properties. Competition from other real estate developers and investors can pose a risk to Vornado's ability to acquire attractive properties or command favorable rental rates. Failure to effectively compete may impact the company's growth prospects and stock performance."},{"section":"4. Property Market Fluctuations","text":"The value of real estate properties fluctuates over time due to various factors, including changes in supply and demand dynamics, macroeconomic conditions, and market sentiment. Vornado's investment portfolio primarily consists of office and retail properties, both of which can experience significant value fluctuations. These fluctuations can affect the company's overall net asset value (NAV) and have an impact on stock prices."},{"section":"5. Regulatory and Legislative Changes","text":"Changes in regulations or legislation related to the real estate industry can pose risks to Vornado Realty Trust. Alterations in tax laws, zoning regulations, environmental policies, or building codes can increase operational costs, limit development opportunities, or impact the demand for certain property types. Consequently, such changes can negatively affect Vornado's financial performance and investor sentiment."},{"section":"6. Tenant Defaults and Lease Renewals","text":"Tenant defaults and lease renewals can impact Vornado's rental income. If tenants fail to fulfill their lease obligations or choose not to renew their leases, Vornado may experience reduced occupancy rates and a decline in cash flow. Tenant defaults can result from economic downturns, corporate downsizing, or other factors that affect the financial stability of Vornado's tenants."},{"section":"7. Capital Market Volatility","text":"Vornado may require external financing for its real estate projects or to refinance existing debts. Capital market volatility, including changes in interest rates, credit availability, or investor sentiment, can impact Vornado's ability to secure funding on favorable terms. Difficulties in accessing capital or higher borrowing costs can limit the company's growth opportunities or strain its financial position."},{"section":"8. COVID-19 Pandemic","text":"The ongoing COVID-19 pandemic has had a significant impact on the real estate sector, including temporary closures of retail spaces, remote working trends reducing office demand, and overall economic uncertainty. These factors can affect Vornado's financial performance, occupancy rates, and rental income. The long-term effects of the pandemic are still uncertain, and investors should carefully consider its potential impact on Vornado's stock."}],"tags":["CrossOver55","Long","Real Estate"],"news":[{"category":"company","date":1698855708,"headline":"Vornado Realty Trust (NYSE:VNO) Q3 2023 Earnings Call Transcript","id":123560955,"image":"https://s.yimg.com/ny/api/res/1.2/QKVtjRq7s_Y1pTmMXG9WsA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/2e44147cc0dd731517c0aa87d15aedfc","symbol":"VNO.PRM","publisher":"Yahoo","summary":"Vornado Realty Trust (NYSE:VNO) Q3 2023 Earnings Call Transcript October 31, 2023 Operator: Good morning, and welcome to the Vornado Realty Trust Third Quarter 2023 Earnings Call. My name is Rocco, and I will be your operator for today’s call. This call is being recorded for replay purposes. All lines are in a listen-only mode. […]","url":"https://finance.yahoo.com/news/vornado-realty-trust-nyse-vno-162148074.html"},{"category":"company","date":1698811618,"headline":"Q3 2023 Alexander's Inc and Vornado Realty Trust Earnings Call","id":123540765,"image":"","symbol":"VNO.PRM","publisher":"Yahoo","summary":"Q3 2023 Alexander's Inc and Vornado Realty Trust Earnings Call","url":"https://finance.yahoo.com/news/q3-2023-alexanders-inc-vornado-040658585.html"},{"category":"company","date":1698787534,"headline":"Vornado Isn’t Placing Any Bets on a Midtown Casino","id":123560957,"image":"https://media.zenfs.com/en/commercial_observer_904/fe37eb152408b257c9531eebc9cefd2f","symbol":"VNO.PRM","publisher":"Yahoo","summary":"Vornado Realty Trust (VNO) is cashing out in its quest for a casino license in Manhattan.  During the company’s third-quarter earnings call, Vornado CEO Steven Roth said the company would focus its efforts on office leasing in the Penn District rather than competing in the crowded field for one of only three available downstate casino licenses.  “It’s highly likely that we will not pursue a casino license,” Roth said Tuesday during a quarterly call.","url":"https://finance.yahoo.com/news/vornado-isn-t-placing-bets-212534866.html"},{"category":"company","date":1698772980,"headline":"Vornado's (VNO) FFO Meets Estimates in Q3, Revenues Miss","id":123526662,"image":"https://media.zenfs.com/en/zacks.com/af8fd4b9c9b0c51ea9545a6b3ba63398","symbol":"VNO.PRM","publisher":"Yahoo","summary":"Vornado's (VNO) Q3 results reflect lower-than-anticipated revenues despite decent leasing activity. Also, higher operating expenses act as a dampener.","url":"https://finance.yahoo.com/news/vornados-vno-ffo-meets-estimates-172300726.html"},{"category":"company","date":1698767348,"headline":"Vornado Realty Trust (VNO) Q3 2023 Earnings Call Transcript","id":123528021,"image":"https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png","symbol":"VNO.PRM","publisher":"SeekingAlpha","summary":"Vornado Realty Trust (NYSE:NYSE:VNO) Q3 2023 Earnings Conference Call October 31, 2023 10:00 AM ETCompany ParticipantsSteve Borenstein â Senior Vice...","url":"https://seekingalpha.com/article/4645560-vornado-realty-trust-vno-q3-2023-earnings-call-transcript"},{"category":"company","date":1698706805,"headline":"Compared to Estimates, Vornado (VNO) Q3 Earnings: A Look at Key Metrics","id":123512327,"image":"https://media.zenfs.com/en/zacks.com/d2f7ed3d1940141716bfd200f5c94c6b","symbol":"VNO.PRM","publisher":"Yahoo","summary":"Although the revenue and EPS for Vornado (VNO) give a sense of how its business performed in the quarter ended September 2023, it might be worth considering how some key metrics compare with Wall Street estimates and the year-ago numbers.","url":"https://finance.yahoo.com/news/compared-estimates-vornado-vno-q3-230005584.html"},{"category":"company","date":1698705607,"headline":"Vornado (VNO) Q3 FFO Meet Estimates","id":123512328,"image":"https://media.zenfs.com/en/zacks.com/7853de8d69faeccb7d1ad6ebba40b8a2","symbol":"VNO.PRM","publisher":"Yahoo","summary":"Vornado (VNO) delivered FFO and revenue surprises of 0% and 1.96%, respectively, for the quarter ended September 2023. Do the numbers hold clues to what lies ahead for the stock?","url":"https://finance.yahoo.com/news/vornado-vno-q3-ffo-meet-224007684.html"},{"category":"company","date":1698703069,"headline":"Vornado Realty Trust (VNO) Q3 2023 Earnings: Net Income Rises to $52.8 Million","id":123512329,"image":"","symbol":"VNO.PRM","publisher":"Yahoo","summary":"Despite a decrease in Funds from Operations, VNO reports a significant increase in net income","url":"https://finance.yahoo.com/news/vornado-realty-trust-vno-q3-215749832.html"},{"category":"company","date":1698697500,"headline":"Vornado Announces Third Quarter 2023 Financial Results","id":123512330,"image":"https://media.zenfs.com/en/globenewswire.com/1abe1b7748e198662d4299a5136c68f8","symbol":"VNO.PRM","publisher":"Yahoo","summary":"NEW YORK, Oct. 30, 2023 (GLOBE NEWSWIRE) -- Vornado Realty Trust (NYSE: VNO) reported today: Quarter Ended September 30, 2023 Financial Results NET INCOME attributable to common shareholders for the quarter ended September 30, 2023 was $52,846,000, or $0.28 per diluted share, compared to $7,769,000, or $0.04 per diluted share, for the prior year's quarter. Adjusting for the items that impact period-to-period comparability listed in the table on the following page, net income attributable to comm","url":"https://finance.yahoo.com/news/vornado-announces-third-quarter-2023-202500431.html"},{"category":"company","date":1698366081,"headline":"Shopify Signs on for 36K SF at 85 10th Avenue","id":123463647,"image":"https://media.zenfs.com/en/commercial_observer_904/d4b3f9ca80bfdbf62303731b3689bac6","symbol":"VNO.PRM","publisher":"Yahoo","summary":"If you work in tech, Chelsea is the place to see and be seen.  Canadian e-commerce start-up Shopify has signed a lease for just under 36,000 square feet on the eighth floor of 85 10th Avenue, according to a source with knowledge of the deal.  Shopify currently has its offices in SoHo and will join several tech companies to make its home in Chelsea.","url":"https://finance.yahoo.com/news/shopify-signs-36k-sf-85-002121254.html"},{"category":"company","date":1698347160,"headline":"Vornado Declares Quarterly Dividends On Preferred Shares","id":123432063,"image":"https://media.zenfs.com/en/globenewswire.com/1abe1b7748e198662d4299a5136c68f8","symbol":"VNO.PRM","publisher":"Yahoo","summary":"NEW YORK, Oct. 26, 2023 (GLOBE NEWSWIRE) -- Vornado Realty Trust (NYSE:VNO) announced today that its Board of Trustees has declared the following quarterly preferred dividends: Series A Convertible$.8125000per shareSeries L Cumulative Redeemable$.3375000per shareSeries M Cumulative Redeemable$.3281250per shareSeries N Cumulative Redeemable$.3281250per shareSeries O Cumulative Redeemable$.2781250per share In each case, dividends are payable on January 2, 2024 to shareholders of record on December","url":"https://finance.yahoo.com/news/vornado-declares-quarterly-dividends-preferred-190600368.html"},{"category":"company","date":1698327180,"headline":"Vornado (VNO) to Report Q3 Earnings: What's in the Cards?","id":123419212,"image":"https://media.zenfs.com/en/zacks.com/76de46512b6b2ed03cb613b33bb84828","symbol":"VNO.PRM","publisher":"Yahoo","summary":"Healthy demand for Vornado's (VNO) premium office assets is likely to have benefited its Q3 earnings. However, higher interest expenses are anticipated to have hurt it.","url":"https://finance.yahoo.com/news/vornado-vno-report-q3-earnings-133300821.html"},{"category":"company","date":1698317800,"headline":"Duquesne Family Office’s 15 New Stock Picks","id":123418573,"image":"https://media.zenfs.com/en/insidermonkey.com/4373cf961e756c708f41c49b42896123","symbol":"VNO.PRM","publisher":"Yahoo","summary":"In this article, we discuss Duquesne Family Office’s 15 new stock picks. If you want to see more stocks in this selection, check out Duquesne Family Office’s 5 New Stock Picks. An imminent collapse and recession was the sentiment echoed by billionaire Stanley Druckenmiller late last year in response to an aggressive monetary policy tightening. The legendary […]","url":"https://finance.yahoo.com/news/duquesne-family-office-15-stock-105640687.html"},{"category":"company","date":1698005851,"headline":"15 Affordable Places to Live Near NYC","id":123330203,"image":"https://media.zenfs.com/en/insidermonkey.com/eac9ebd6d43ee77e9f293d8bcfce6fee","symbol":"VNO.PRM","publisher":"Yahoo","summary":"In this article, we will be navigating through the real estate market in New York City, while covering the 15 affordable places to live near NYC. If you wish to skip our detailed analysis, you can move directly to the 5 Affordable Places to Live Near NYC. The Housing Scenario in NYC New York City […]","url":"https://finance.yahoo.com/news/15-affordable-places-live-near-201731521.html"}]}