{"id":1152,"company":{"country":"CA","currency":"USD","exchange":"TORONTO STOCK EXCHANGE","ipo":"1993-06-22","marketCap":6850.91748046875,"name":"Colliers International Group Inc","phone":"14169609500.0","outstanding":45.85369873046875,"symbol":"CIGI","website":"https://www.collierscanada.com/","industry":"Real Estate"},"price":105.7175,"year":2023,"month":11,"day":22,"weekday":"Wednesday","title":"Impact of corporate earnings reports on Colliers International Group Inc stock's price movements","date":"2023-11-22","url":"/posts/2023/11/22/CIGI","content":[{"section":"Q2 2021 Earnings Report","text":"Colliers International Group Inc released its Q2 2021 earnings report on July 27, 2021. The report showed strong financial performance, with revenue of $946 million, representing an increase of 37% year-over-year. The company also reported adjusted earnings per share (EPS) of $1.20, surpassing analysts' expectations. This positive earnings report led to an immediate increase in Colliers International Group Inc's stock price by 5% on the following trading day."},{"section":"Q1 2021 Earnings Report","text":"On April 27, 2021, Colliers International Group Inc announced its Q1 2021 earnings report. The report revealed that the company generated revenue of $829 million, a growth of 19% compared to the same quarter last year. Additionally, the adjusted EPS stood at $0.90, exceeding analysts' estimates. The market responded positively to these strong results, pushing Colliers International Group Inc's stock price up by 8% in the days following the earnings release."},{"section":"Q4 2020 Earnings Report","text":"Colliers International Group Inc shared its Q4 2020 earnings report on February 9, 2021. The report demonstrated solid financial performance, recording revenue of $852 million, a 9% increase year-over-year. The adjusted EPS for the quarter was reported at $1.15, surpassing market expectations. As a result, Colliers International Group Inc's stock price experienced a significant surge of 12% within a week of the earnings release."},{"section":"Q3 2020 Earnings Report","text":"The Q3 2020 earnings report for Colliers International Group Inc was published on October 27, 2020. The company reported revenue of $695 million for the quarter, representing a decline of 5% compared to the same period in the previous year. However, the adjusted EPS came in at $0.76, which beat analysts' estimates. Despite the slight drop in revenue, the positive earnings surprise led to a 4% increase in Colliers International Group Inc's stock price shortly after the report was released."},{"section":"Q2 2020 Earnings Report","text":"On July 28, 2020, Colliers International Group Inc announced its Q2 2020 earnings report. The report highlighted the challenges faced due to the COVID-19 pandemic, with revenue declining by 24% year-over-year to $444 million. The adjusted EPS for the quarter was reported at $0.30, below analysts' expectations. Consequently, Colliers International Group Inc's stock price dropped by 8% in the days following the earnings release."},{"section":"Q1 2020 Earnings Report","text":"Colliers International Group Inc released its Q1 2020 earnings report on April 28, 2020, during the early stages of the COVID-19 pandemic. The report showed a modest decrease in revenue, amounting to $624 million, a decline of 7% compared to the previous year. The adjusted EPS for the quarter stood at $0.68, which was in line with analysts' expectations. The stock price of Colliers International Group Inc remained relatively stable after the earnings report, reflecting the uncertain market conditions caused by the pandemic."},{"section":"Impact Analysis","text":"Overall, the impact of corporate earnings reports on Colliers International Group Inc's stock price movements has been significant. Positive earnings surprises, such as in Q2 2021, Q1 2021, and Q4 2020, resulted in considerable increases in the stock price. Conversely, instances where earnings fell short of expectations, such as in Q2 2020, led to notable declines in the stock price. It is essential for investors to closely monitor these earnings reports as they provide valuable insights into the company's financial performance and influence stock market reactions."}],"tags":["CrossOver200","Long","Real Estate"],"news":[{"category":"company","date":1700551500,"headline":"Colliers International initiated with a Buy at Stifel","id":124021386,"image":"","symbol":"CIGI","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3222590938"},{"category":"company","date":1700495202,"headline":"Optimism for Colliers International Group (TSE:CIGI) has grown this past week, despite five-year decline in earnings","id":124001860,"image":"https://media.zenfs.com/en/simply_wall_st__316/3c34d9fff82f69d6a0e9da466926e19d","symbol":"CIGI","publisher":"Yahoo","summary":"When we invest, we're generally looking for stocks that outperform the market average. And in our experience, buying...","url":"https://finance.yahoo.com/news/optimism-colliers-international-group-tse-154642566.html"},{"category":"company","date":1699994089,"headline":"Corporate Confidence: 3 Canadian Stocks on a Buyback Spree","id":124009402,"image":"https://media.zenfs.com/en/investorplace_417/959c313fb76ef7e2857c4711e4217d8e","symbol":"CIGI","publisher":"Yahoo","summary":"I read a recent Seeking Alpha article about Cenovus (NYSE:CVE), easily one of Canada’s best energy producers. The author’s focus on CVE’s buyback propensity had me thinking about other Canadian stocks making big share repurchases in 2023. I’m a Canadian who generally writes about American companies. However, Cenovus is listed on the NYSE, so it ought to be of interest to American investors. There are plenty of other NYSE-listed stocks based in Canada. In Canada, we have what is called a “Normal","url":"https://finance.yahoo.com/news/corporate-confidence-3-canadian-stocks-203449446.html"},{"category":"company","date":1699926480,"headline":"Bullish Two Hundred Day Moving Average Cross - CIGI","id":123899680,"image":"","symbol":"CIGI","publisher":"Market News Video","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3212394791"},{"category":"company","date":1699877700,"headline":"Achim Degen appointed to Chief Executive Officer of Colliers in Germany","id":123838885,"image":"https://s.yimg.com/ny/api/res/1.2/TfOVOOt2mXn.XeTUmSKTHQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MTM-/https://media.zenfs.com/en/globenewswire.com/58946337a32c6b309c3a4f1db07a7e81","symbol":"CIGI","publisher":"Yahoo","summary":"Recognised industry expert with 34 years of experience Achim Degen appointed to Chief Executive Officer of Colliers in Germany Leading diversified professional services and investment management company Colliers (NASDAQ and TSX: CIGI) today announced Achim Degen, current Managing Director in Munich, has been appointed Chief Executive Officer (CEO) of Colliers in Germany, effective immediately, reporting to Davoud Amel-Azizpour, CEO, EMEA. LONDON, Nov. 13, 2023 (GLOBE NEWSWIRE) -- Leading diversi","url":"https://finance.yahoo.com/news/achim-degen-appointed-chief-executive-121500954.html"},{"category":"company","date":1699448400,"headline":"Logistics warehouse automation to continue apace despite construction slowdown","id":123719180,"image":"https://media.zenfs.com/en/freightwaves_373/a547ad226ca252315a96f5a977c54b41","symbol":"CIGI","publisher":"Yahoo","summary":"Embedding existing warehouses with new automation offers great potential as well as some risks, according to experts. The post Logistics warehouse automation to continue apace despite construction slowdown appeared first on FreightWaves.","url":"https://finance.yahoo.com/news/logistics-warehouse-automation-continue-apace-130000455.html"}]}