{"id":2671,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2019-07-17","marketCap":44.32758712768555,"name":"First Seacoast Bancorp Inc","phone":"16037424680","outstanding":5.079999923706055,"symbol":"FSEA","website":"https://www.firstseacoastbank.com/","industry":"Banking"},"price":8.6984,"year":2024,"month":1,"day":20,"weekday":"Saturday","title":"Corporate Governance Practices of First Seacoast Bancorp Inc","date":"2024-01-20","url":"/posts/2024/01/20/FSEA","content":[{"section":"Board Composition","text":"First Seacoast Bancorp Inc has a diverse board composition, with directors from different backgrounds and areas of expertise. The board consists of 10 members, comprised of both internal and external directors. This mix of directors brings a range of perspectives and knowledge to the decision-making process."},{"section":"Board Independence","text":"The majority of the board members at First Seacoast Bancorp Inc are independent directors, which ensures a higher level of oversight and objectivity in the decision-making process. The board includes independent directors who have no material relationship with the company or its management, enhancing their ability to act in the best interests of shareholders."},{"section":"Executive Compensation","text":"First Seacoast Bancorp Inc follows a structured and transparent approach to executive compensation. The company discloses executive compensation packages, including base salary, performance bonuses, and long-term incentives. This transparency allows shareholders to assess the alignment of executive pay with company performance."},{"section":"Compensation Committee","text":"To ensure fairness and objectivity in executive compensation decisions, First Seacoast Bancorp Inc has a dedicated compensation committee. The committee is responsible for reviewing and approving executive compensation packages, as well as evaluating the performance of senior executives. This committee is comprised of independent directors, enhancing its independence and credibility."},{"section":"Shareholder Rights","text":"First Seacoast Bancorp Inc recognizes the importance of protecting shareholder rights. The company ensures that shareholders have the opportunity to participate and vote in major corporate decisions, such as the election of directors and approval of significant transactions. Shareholders are also provided with timely and comprehensive information to make informed decisions."},{"section":"Code of Ethics","text":"First Seacoast Bancorp Inc has a well-defined code of ethics that outlines the expected standards of conduct for directors, executives, and employees. This code promotes integrity, honesty, and ethical behavior throughout the organization. The company also has mechanisms in place for reporting and addressing any violations of the code of ethics."},{"section":"Risk Management","text":"First Seacoast Bancorp Inc has a robust risk management framework in place. The board oversees the company's risk profile and ensures that appropriate risk management strategies are implemented. The company regularly assesses and monitors potential risks, taking necessary actions to mitigate them and protect the interests of shareholders."},{"section":"Conclusion","text":"First Seacoast Bancorp Inc demonstrates strong corporate governance practices through its diverse board composition, independent directors, transparent executive compensation, dedicated compensation committee, protection of shareholder rights, well-defined code of ethics, and robust risk management. These practices contribute to the overall effectiveness and accountability of the company's governance structure."}],"tags":["CrossOver21","Long","Banking"],"news":[{"category":"company","date":1705178756,"headline":"Bank Buzz: NB Bancorp Looks Inexpensive With Multiple Catalysts To Deliver Returns","id":125058978,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/522876116/image_522876116.jpg?io=getty-c-w1536","symbol":"FSEA","publisher":"SeekingAlpha","summary":"NB Bancorp, trading at 77% of TBV, is expected to repurchase shares and potentially issue dividends. Click here to read why we view NBBK stock as a Buy.","url":"https://seekingalpha.com/article/4662703-bank-buzz-nb-bancorp-looks-inexpensive-with-multiple-catalysts-to-deliver-returns"}]}