{"id":3556,"company":{"country":"US","currency":"USD","exchange":"NEW YORK STOCK EXCHANGE, INC.","ipo":"1946-09-13","marketCap":23170.29296875,"name":"FirstEnergy Corp","phone":"13307617837","outstanding":575.52001953125,"symbol":"FE","website":"https://www.firstenergycorp.com/","industry":"Utilities"},"price":40.2975,"year":2024,"month":5,"day":16,"weekday":"Thursday","title":"Analyzing the Performance of FirstEnergy Corp Stock in the Past Year","date":"2024-05-16","url":"/posts/2024/05/16/FE","content":[{"section":"Introduction","text":"FirstEnergy Corp, a major electric utility company, has experienced a dynamic performance in the stock market over the past year. This article aims to analyze the company's performance by examining key financial indicators."},{"section":"Stock Price","text":"FirstEnergy Corp's stock price has displayed notable volatility throughout the year. Despite starting the year at a strong level, the stock experienced a severe decline in the first quarter due to various factors including regulatory pressures and market conditions. However, it managed to gradually recover over the subsequent months. Investors should note that the stock price remains below its year-begin level, indicating a challenging year for shareholders."},{"section":"Revenue","text":"FirstEnergy Corp's revenue figures have shown mixed results over the past year. In the first half of the year, the company witnessed a moderate decline in revenue compared to the previous year, primarily influenced by lower demand for electricity due to the COVID-19 pandemic. However, the latter half of the year showcased signs of recovery as demand rebounded. Overall, revenue for the year experienced only a slight decrease."},{"section":"Profitability","text":"The profitability of FirstEnergy Corp has faced considerable challenges in the past year. The company reported a decline in its net income compared to the prior year, mainly due to higher operating expenses and legal costs associated with ongoing regulatory investigations. This impacted the company's earnings per share and shareholders' returns."},{"section":"Dividends","text":"FirstEnergy Corp has historically been known for providing stable dividends to its shareholders. Despite the challenges faced in recent times, the company maintained its dividend payouts over the past year. However, it is important to note that dividend growth has been limited, and investors may have concerns about sustainability given the profitability challenges."},{"section":"Outlook","text":"Looking ahead, FirstEnergy Corp faces a range of uncertainties. The outcome of ongoing regulatory investigations and potential legal penalties could have future financial implications for the company. Additionally, the transition towards renewable energy sources and increasing competition in the utility sector pose challenges. Investors should carefully evaluate these factors before making investment decisions."},{"section":"Conclusion","text":"In conclusion, FirstEnergy Corp's stock performance over the past year has been volatile and challenging. While the stock price has shown some recovery from its lowest point, it remains below its year-begin level. Revenue has been somewhat resilient, but profitability has faced hardships due to increased expenses and legal costs. Investors should exercise caution and consider the potential risks and uncertainties surrounding the company."}],"tags":["LongSignals","Long","Utilities"],"news":[{"category":"company","date":1715791980,"headline":"Tree-Trimming Work Underway to Help Prevent or Minimize Power Outages Across Ohio Edison's Service Area","id":127710938,"image":"https://media.zenfs.com/en/prnewswire.com/9fad53caef1a0566243e200d17ee7f28","symbol":"FE","publisher":"Yahoo","summary":"Ohio Edison, a FirstEnergy Corp. (NYSE: FE) subsidiary, is conducting tree trimming and other vegetation management work in communities across northeast and northcentral Ohio as part of the company's ongoing efforts to help enhance electric service reliability. This year's $26 million tree-trimming program will help keep power flowing to customers by helping to prevent tree-related outages, such as those that can occur during the spring and summer storm season.","url":"https://finance.yahoo.com/news/tree-trimming-underway-help-prevent-165300692.html"},{"category":"company","date":1715791980,"headline":"Tree-Trimming Work Underway to Help Prevent or Minimize Power Outages Across Greater Cleveland","id":127710936,"image":"https://media.zenfs.com/en/prnewswire.com/55edab2b38ca45493f831dc7e1771ca2","symbol":"FE","publisher":"Yahoo","summary":"The Illuminating Company, a FirstEnergy Corp. (NYSE: FE) subsidiary, is conducting tree trimming and other vegetation management work in communities across its northeast Ohio service area as part of its ongoing efforts to help enhance electric service reliability. This year's $19.7 million tree-trimming program will help keep power flowing to customers by helping to prevent tree-related outages, such as those that can occur during the spring and summer storm season.","url":"https://finance.yahoo.com/news/tree-trimming-underway-help-prevent-165300449.html"},{"category":"company","date":1715791980,"headline":"Tree-Trimming Work Underway to Help Prevent or Minimize Power Outages Across Northwest Ohio","id":127710934,"image":"https://media.zenfs.com/en/prnewswire.com/de2c032fb490e95a601c556d6ee0a50b","symbol":"FE","publisher":"Yahoo","summary":"Toledo Edison, a FirstEnergy Corp. (NYSE: FE) subsidiary, is conducting tree trimming and other vegetation management work in communities across northwest Ohio as part of the company's ongoing efforts to help enhance electric service reliability. This year's $7 million tree-trimming program will help keep power flowing to customers by helping to prevent tree-related outages, such as those that can occur during the spring and summer storm season.","url":"https://finance.yahoo.com/news/tree-trimming-underway-help-prevent-165300740.html"},{"category":"company","date":1715758224,"headline":"FirstEnergy Corp. - Tree-Trimming Work Underway to Help Prevent or Minimize Power Outages in Maryland","id":127704652,"image":"","symbol":"FE","publisher":"Finnhub","summary":"WILLIAMSPORT - FirstEnergy Corp. subsidiary Potomac Edison is conducting tree trimming and other vegetation management work in communities across its Maryland service area as part of its ongoing...","url":"https://finnhub.io/api/news?id=b03010193717bc6299524a1fc8be0ef0e928317fcda01b714685abf1143fd376"},{"category":"company","date":1715758224,"headline":"FirstEnergy Corp. - Installation of 1,650 New LED Streetlights to Brighten the City of Sylvania","id":127704650,"image":"","symbol":"FE","publisher":"Finnhub","summary":"TOLEDO, Ohio - FirstEnergy Corp. electric company Toledo Edison recently kicked off the City of Sylvania's $342,000 streetlight conversion project in Lucas County by installing the first of 1,650...","url":"https://finnhub.io/api/news?id=e0f791f562060da81f89e3aa111a8bcfc7eab2c96967bd67cf4915f734d9e27f"},{"category":"company","date":1715747040,"headline":"Carl Icahn's Fund trims stakes in Icahn Enterprises, exits FirstEnergy and Newell among Q1 buy/sell","id":127718213,"image":"","symbol":"FE","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3497467239"},{"category":"company","date":1715745660,"headline":"Icahn takes stakes in CVR Partners and JetBlue, exits position in FirstEnergy","id":127716083,"image":"","symbol":"FE","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3497430832"},{"category":"company","date":1715703960,"headline":"Tree-Trimming Work Underway to Help Prevent or Minimize Power Outages in Maryland","id":127688752,"image":"https://media.zenfs.com/en/prnewswire.com/3b19490cc2b1a0008a87bab4c7343d17","symbol":"FE","publisher":"Yahoo","summary":"FirstEnergy Corp. (NYSE: FE) subsidiary Potomac Edison is conducting tree trimming and other vegetation management work in communities across its Maryland service area as part of its ongoing efforts to help enhance electric service reliability. This year's $14.7 million tree-trimming program will help keep power flowing to customers by helping to prevent tree-related outages, such as those that can occur during the spring and summer storm season.","url":"https://finance.yahoo.com/news/tree-trimming-underway-help-prevent-162600193.html"},{"category":"company","date":1715698620,"headline":"Installation of 1,650 New LED Streetlights to Brighten the City of Sylvania","id":127688753,"image":"https://media.zenfs.com/en/prnewswire.com/de2c032fb490e95a601c556d6ee0a50b","symbol":"FE","publisher":"Yahoo","summary":"FirstEnergy electric company (NYSE: FE) Toledo Edison recently kicked off the City of Sylvania's $342,000 streetlight conversion project in Lucas County by installing the first of 1,650 LED streetlight fixtures to replace existing lights.","url":"https://finance.yahoo.com/news/installation-1-650-led-streetlights-145700751.html"},{"category":"company","date":1715576888,"headline":"FirstEnergy Using Helicopters and Infrared Technology for Vegetation Management Inspections","id":127654640,"image":"","symbol":"FE","publisher":"Finnhub","summary":"AKRON, Ohio -- To keep power flowing safely and reliably, FirstEnergy Corp. is conducting proactive aerial inspections of nearly 7,000 miles of transmission lines in its service territory using...","url":"https://finnhub.io/api/news?id=c762cb8b4cc513bd2401862940abddc3b5b0b287477cf3459b6bd72a5cd78dc6"},{"category":"company","date":1715320839,"headline":"Work Underway to Upgrade High-Voltage Power System in Northwest Ohio","id":127598635,"image":"","symbol":"FE","publisher":"Finnhub","summary":"* New substation equipment and line upgrades to benefit 23,000 Toledo Edison customersAKRON, Ohio - American Transmission Systems, Inc. , a subsidiary of FirstEnergy Corp. , has started construction...","url":"https://finnhub.io/api/news?id=b2729d2bc64ea65a3e0adee4a3a58afa8e46dbdde7768ce7420b3dc5d710f36b"},{"category":"company","date":1715257980,"headline":"Looking Into FirstEnergy's Recent Short Interest","id":127625911,"image":"","symbol":"FE","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3486951246"},{"category":"company","date":1715186619,"headline":"Calfrac Well Services Maintained at Hold at Stifel FirstEnergy Following Q1 Results; Price Target Cut to C$4.50","id":127542765,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"FE","publisher":"Yahoo","summary":"Calfrac Well Services Maintained at Hold at Stifel FirstEnergy Following Q1 Results; Price Target Cut to C$4.50","url":"https://finance.yahoo.com/news/calfrac-well-services-maintained-hold-164339887.html"},{"category":"company","date":1715161020,"headline":"Interesting FE Put And Call Options For June 2025","id":127561642,"image":"","symbol":"FE","publisher":"Stock Options Channel","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3484179113"},{"category":"company","date":1715141520,"headline":"FirstEnergy Corp. stock underperforms Wednesday when compared to competitors despite daily gains","id":127561643,"image":"","symbol":"FE","publisher":"MarketWatch","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3484929180"},{"category":"company","date":1714993503,"headline":"FirstEnergy Corp's Dividend Analysis","id":127478483,"image":"https://s.yimg.com/ny/api/res/1.2/knL4NW0yg2kCOMwDRQj52w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NjU-/https://media.zenfs.com/en/us.finance.gurufocus/630ce44b962600b97a19b00dac7524f0","symbol":"FE","publisher":"Yahoo","summary":"FirstEnergy Corp (NYSE:FE) recently announced a dividend of $0.43 per share, payable on June 1, 2024, with the ex-dividend date set for May 6, 2024.  As investors anticipate this forthcoming payment, it is crucial to explore the company's dividend history, yield, and growth rates.  Utilizing data from GuruFocus, this article delves into FirstEnergy Corp's dividend track record and evaluates its sustainability.","url":"https://finance.yahoo.com/news/firstenergy-corps-dividend-analysis-110503355.html"},{"category":"company","date":1714680660,"headline":"Dominion Energy (D) Q1 Earnings \u0026 Revenues Beat Estimates","id":127403235,"image":"https://media.zenfs.com/en/zacks.com/2c0b0a5e9930699d14198b67a02a01aa","symbol":"FE","publisher":"Yahoo","summary":"Dominion Energy's (D) first-quarter earnings are better than estimates. The company reiterates its long-term annual earnings growth guidance in the range of 5-7%.","url":"https://finance.yahoo.com/news/dominion-energy-d-q1-earnings-201100699.html"},{"category":"company","date":1714671540,"headline":"Mon Power Selected by U.S. Department of Energy for Reliability Project Grant","id":127389098,"image":"https://media.zenfs.com/en/prnewswire.com/7593410cb2db7d7c517d29f70345cd8d","symbol":"FE","publisher":"Yahoo","summary":"FirstEnergy Corp. (NYSE: FE) subsidiary Mon Power has been selected by the Department of Energy to begin award negotiations for up to $5 million in federal funding for a project that will boost electric reliability for customers in parts of rural West Virginia. The funding is part of the Energy Improvements in Rural or Remote Areas (ERA) program established by the Bipartisan Infrastructure Law.","url":"https://finance.yahoo.com/news/mon-power-selected-u-department-173900966.html"}]}