{"id":2674,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2019-10-24","marketCap":2999.53076171875,"name":"BRP Group Inc","phone":"18662790698","outstanding":116.75,"symbol":"BRP","website":"https://baldwinriskpartners.com/","industry":"Insurance"},"price":25.195,"year":2024,"month":1,"day":20,"weekday":"Saturday","title":"Recent News and Events Impacting BRP Group Inc Stock","date":"2024-01-20","url":"/posts/2024/01/20/BRP","content":[{"section":"1. Acquisition of FounderShield LLC","text":"In August 2021, BRP Group Inc announced the acquisition of FounderShield LLC, a specialist insurance broker focused on venture-backed high-growth technology firms. This strategic acquisition expands BRP's presence in the technology sector and enhances its capabilities to serve clients in this niche market."},{"section":"2. Strong Q2 2021 Financial Results","text":"BRP Group Inc reported its Q2 2021 financial results in August, showcasing strong performance. The company achieved total revenue of $137.2 million, representing a 55.7% increase year-over-year. Adjusted EBITDA also grew significantly by 84.6% to reach $28.3 million. These positive results indicate the company's ability to generate strong financial growth."},{"section":"3. Expansion of Total Addressable Market","text":"BRP Group Inc expanded its total addressable market by launching its mortgage services platform in August 2021. This new offering allows the company to provide mortgage services to complement its existing insurance services, creating a more comprehensive solution for clients. By diversifying its product offerings, BRP Group Inc opens up new growth opportunities."},{"section":"4. Release of Q3 2021 Guidance","text":"In September 2021, BRP Group Inc released its Q3 2021 guidance. The company expects total revenue to be in the range of $139 million to $143 million, representing a year-over-year increase of approximately 41.2% to 45.1%. This positive outlook indicates the company's confidence in its ability to continue delivering strong financial performance."},{"section":"5. Expansion into Colorado Market","text":"BRP Group Inc expanded its presence in the Colorado market through the acquisition of Stewart-Little Agency, a Colorado-based full-service insurance agency. This expansion allows BRP to extend its reach and capabilities in serving clients in the region. By increasing its geographic footprint, BRP Group Inc aims to capture additional market share and drive growth."},{"section":"6. Insider Selling Activity","text":"There have been instances of insider selling activity related to BRP Group Inc stock. In August 2021, a director sold approximately 161,100 shares, highlighting a potential decrease in insider confidence. Investors may monitor such activities as they can impact the stock's performance."},{"section":"7. Analyst Coverage and Ratings","text":"Several analyst firms have initiated or updated their coverage of BRP Group Inc stock. For example, Wells Fargo initiated coverage with an overweight rating in August 2021. Such coverage and ratings can influence investor sentiment and potentially impact the stock's performance."}],"tags":["CrossOver21","Long","Insurance"],"news":[{"category":"company","date":1705672800,"headline":"BRP Group, Inc. Announces Executive Appointments","id":125176997,"image":"https://media.zenfs.com/en/business-wire.com/fad6ec60e839f2001f648030e674625b","symbol":"BRP","publisher":"Yahoo","summary":"TAMPA, Fla., January 19, 2024--BRP Group, Inc. (\"BRP Group\") (NASDAQ: BRP), an independent insurance distribution firm delivering tailored insurance solutions to a wide range of personal and commercial Clients, today announced executive appointments for the next phase of the firm’s growth.","url":"https://finance.yahoo.com/news/brp-group-inc-announces-executive-140000037.html"},{"category":"company","date":1705653120,"headline":"BRP Group appoints Roche and Galbraith as co-presidents","id":125191479,"image":"","symbol":"BRP","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3307679845"},{"category":"company","date":1705404480,"headline":"3 Best Stocks to Buy Now, 1/17/2024, According to Top Analysts","id":125107431,"image":"","symbol":"BRP","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3303681853"},{"category":"company","date":1705393260,"headline":"BRP Group price target raised by $3 at BofA, here's why","id":125107432,"image":"","symbol":"BRP","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3302118364"},{"category":"company","date":1705007700,"headline":"BRP Group, Inc. to Report Fourth Quarter 2023 Results on Wednesday, February 28, 2024","id":125003445,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"BRP","publisher":"Yahoo","summary":"TAMPA, Fla., January 11, 2024--BRP Group, Inc. (\"BRP Group\" or the \"Company\") (NASDAQ: BRP), an independent insurance distribution firm delivering tailored insurance solutions to a wide range of personal and commercial Clients, announced today that it will report its fourth quarter 2023 financial results after the market closes on Wednesday, February 28, 2024.","url":"https://finance.yahoo.com/news/brp-group-inc-report-fourth-211500993.html"},{"category":"company","date":1704954600,"headline":"BRP Group (BRP) Gets a Hold from Wells Fargo","id":124991693,"image":"","symbol":"BRP","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3295672630"}]}