{"id":49,"company":{"country":"US","currency":"USD","exchange":"OTC MARKETS","ipo":"2015-05-22","marketCap":1.54868,"name":"Yuenglings Ice Cream Corp","phone":"14048856045.0","outstanding":262.49,"symbol":"YCRM","website":"https://imevelyn.com/","industry":"N/A"},"direction":"Long","price":0.007375,"year":2023,"month":9,"day":28,"weekday":"Thursday","title":"Market Capitalization and Valuation Metrics of Yuenglings Ice Cream Corp stock","date":"2023-09-28","url":"/posts/2023/09/28/YCRM","content":[{"section":"Market Capitalization","text":"The market capitalization of a company represents the total value of its outstanding shares. To compare Yuenglings Ice Cream Corp stock to industry benchmarks, we need to analyze its market capitalization. As of the latest available data, the market capitalization of Yuenglings Ice Cream Corp is $X million. However, we will also need to compare this to the market capitalization of other companies in the ice cream industry to fully assess its relative value."},{"section":"Valuation Ratios","text":"Valuation ratios provide insight into how the market values a company's stock. Some common valuation ratios include Price-to-Earnings (P/E) ratio, Price-to-Book (P/B) ratio, and Price-to-Sales (P/S) ratio. Let's examine these ratios for Yuenglings Ice Cream Corp:"},{"section":"Price-to-Earnings (P/E) Ratio","text":"The P/E ratio compares a company's stock price to its earnings per share (EPS). A higher P/E ratio suggests that investors are willing to pay a premium for the company's earnings. To fully evaluate Yuenglings Ice Cream Corp's P/E ratio, we need to compare it to the industry benchmarks."},{"section":"Price-to-Book (P/B) Ratio","text":"The P/B ratio compares a company's stock price to its book value per share. It indicates whether the stock is trading at a premium or discount relative to the company's net assets. Comparing Yuenglings Ice Cream Corp's P/B ratio to industry benchmarks will give us a better understanding of its valuation."},{"section":"Price-to-Sales (P/S) Ratio","text":"The P/S ratio compares a company's stock price to its revenue per share. It shows how much investors are willing to pay for each dollar of a company's sales. Analyzing Yuenglings Ice Cream Corp's P/S ratio relative to industry benchmarks will help us assess its market valuation."}],"tags":["stock","Other"],"news":[{"category":"company","date":1695906360,"headline":"Yuengling and PickleJar Announce Update to Complete Proposed Business Combination","id":122836896,"image":"https://media.zenfs.com/en/globenewswire.com/028a9f5a5c9715630ae7ddf55fad643e","symbol":"YCRM","publisher":"Yahoo","summary":"ATLANTA, GA, Sept. 28, 2023 (GLOBE NEWSWIRE) -- via NewMediaWire – Yuengling’s Ice Cream Corporation (“Yuengling’s”) (OTC: YCRM) in a joint statement with PickleJar Holdings, Inc (“PickleJar”), a Texas-based music and entertainment software company, announced the parties have mutually agreed to extend the time to complete an initial business combination (the “Deadline Date”) from September 30, 2023 to November 15, 2023. Yuengling’s further announced that PickleJar will deposit $150,000 into a tr","url":"https://finance.yahoo.com/news/yuengling-picklejar-announce-complete-proposed-130600375.html"}]}