{"id":755,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"1987-12-29","marketCap":745.0133666992188,"name":"Community Trust Bancorp Inc","phone":"16064334643.0","outstanding":17.989999771118164,"symbol":"CTBI","website":"https://investors.ctbi.com/overview/default.aspx","industry":"Banking"},"price":40.75,"year":2023,"month":11,"day":15,"weekday":"Wednesday","title":"Historical Stock Price Performance of Community Trust Bancorp Inc During Significant Market Events","date":"2023-11-15","url":"/posts/2023/11/15/CTBI","content":[{"section":"Stock Price Performance during the 2008 Financial Crisis","text":"During the 2008 financial crisis, Community Trust Bancorp Inc experienced a significant decline in its stock price. In 2007, prior to the crisis, the stock was trading at around $60. However, by early 2009, the stock had plummeted to a low of around $20, reflecting a decrease of nearly 67% from its pre-crisis levels. This decline was in line with the broader market trend, as the crisis had a severe impact on the financial sector."},{"section":"Stock Price Performance during the COVID-19 Pandemic","text":"The COVID-19 pandemic, which began in early 2020, also had notable effects on the stock price of Community Trust Bancorp Inc. In January 2020, the stock was trading at around $40. However, as the pandemic spread and lockdown measures were implemented, the stock experienced a decline, reaching a low of around $20 in March 2020. This decline of 50% was driven by market uncertainty and the economic impact of the pandemic."},{"section":"Stock Price Performance during Market Rallies","text":"Community Trust Bancorp Inc has also participated in market rallies, experiencing an increase in its stock price during bullish periods. For example, during the post-financial crisis recovery period from 2009 to 2010, the stock price recovered from its lows and reached a high of around $40, representing a 100% increase from its crisis low. Similarly, during the market recovery following the initial COVID-19 decline, the stock price rebounded to around $40, demonstrating a 100% increase from its pandemic low in March 2020."},{"section":"Context of Market Events","text":"The 2008 financial crisis was triggered by the collapse of Lehman Brothers and the subsequent subprime mortgage crisis. It led to a global recession and severe financial market turmoil. The COVID-19 pandemic caused widespread economic disruptions, with lockdowns and restrictions imposed to contain the virus's spread. Both events had significant impacts on stock markets worldwide, leading to volatility and price fluctuations."}],"tags":["CrossOver55","Long","Banking"],"news":null}