{"id":3232,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2005-09-27","marketCap":42.80695343017578,"name":"Viracta Therapeutics Inc","phone":"18584008470","outstanding":39.27000045776367,"symbol":"VIRX","website":"https://www.viracta.com/","industry":"Biotechnology"},"price":1.0918,"year":2024,"month":4,"day":3,"weekday":"Wednesday","title":"Sentiment Analysis of Analysts on Viracta Therapeutics Inc Stock","date":"2024-04-03","url":"/posts/2024/04/03/VIRX","content":[{"section":"Analyst Opinions","text":"Most analysts and financial experts have a positive sentiment toward Viracta Therapeutics Inc stock. They believe that the company has strong growth potential and a promising pipeline. The stock is often recommended as a buy or a strong buy."},{"section":"Price Targets","text":"The price targets provided by analysts for Viracta Therapeutics Inc stock are generally optimistic. The targets range from $20 to $30 per share, indicating a potential upside for investors."},{"section":"Recommendations","text":"Several analysts and financial experts recommend buying Viracta Therapeutics Inc stock. They highlight the company's innovative therapies and potential for future success. The stock is often considered a good long-term investment."}],"tags":["CrossOver21","Long","Biotechnology"],"news":[{"category":"company","date":1711974600,"headline":"Viracta Therapeutics to Present Topline Nana-val Results from Stage 1 of the NAVAL-1 Trial at the 2024 Annual Congress of The Hematology Society of Taiwan","id":126774499,"image":"https://media.zenfs.com/en/globenewswire.com/807a0b26c286237107e0976ff86050fd","symbol":"VIRX","publisher":"Yahoo","summary":"The oral presentation will focus on topline Stage 1 data from both arms of the relapsed or refractory EBV+ peripheral T-cell lymphoma cohort (in patients randomized to either nanatinostat monotherapy [n=10] or to nanatinostat in combination with valganciclovir [Nana-val, n=10]), with an aim to clearly delineate the differentiation of Nana-val’s ‘Kick and Kill’ mechanism of actionSAN DIEGO, April 01, 2024 (GLOBE NEWSWIRE) -- Viracta Therapeutics, Inc. (Nasdaq: VIRX), a clinical-stage precision on","url":"https://finance.yahoo.com/news/viracta-therapeutics-present-topline-nana-123000350.html"},{"category":"company","date":1711038600,"headline":"LENZ Therapeutics Announces Completion of Merger with Graphite Bio and Provides Update on Recent Clinical and Corporate Progress","id":126628822,"image":"","symbol":"VIRX","publisher":"Business Wire","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=4tg2y594xn"},{"category":"company","date":1710906780,"headline":"Viracta Therapeutics CFO Resigns, Interim Successor Appointed","id":126604738,"image":"","symbol":"VIRX","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3407305824"}]}