{"id":2620,"company":{"country":"DK","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2021-11-05","marketCap":131.10301208496094,"name":"IO Biotech Inc","phone":"4570702980","outstanding":65.87999725341797,"symbol":"IOBT","website":"https://www.iobiotech.com/","industry":"Biotechnology"},"price":2.0025,"year":2024,"month":1,"day":10,"weekday":"Wednesday","title":"IO Biotech Inc Stock Valuation and Market Capitalization","date":"2024-01-10","url":"/posts/2024/01/10/IOBT","content":[{"section":"Market Capitalization","text":"IO Biotech Inc's market capitalization is the total value of its outstanding shares. As of the latest available data, its market capitalization is $X, which is above/below the industry average of $Y."},{"section":"Valuation Metrics","text":"Valuation ratios provide insights into the relative value of a company's stock compared to its financial performance and industry peers. IO Biotech Inc's valuation ratios include:"},{"section":"Price-to-Earnings (P/E) Ratio","text":"The P/E ratio measures the price investors are willing to pay for each dollar of IO Biotech Inc's earnings. IO Biotech Inc has a P/E ratio of X, whereas the industry average is Y. This indicates that IO Biotech Inc may be considered overvalued/undervalued compared to its peers."},{"section":"Price-to-Sales (P/S) Ratio","text":"The P/S ratio compares the market value of IO Biotech Inc's stock to its annual sales. IO Biotech Inc's P/S ratio is X, while the industry average is Y. This suggests that IO Biotech Inc may be overvalued/undervalued based on its sales performance compared to its industry peers."},{"section":"Price-to-Book (P/B) Ratio","text":"The P/B ratio compares the market value of IO Biotech Inc's stock to its book value (total assets minus liabilities). IO Biotech Inc's P/B ratio is X, while the industry average is Y. This indicates that IO Biotech Inc may be overvalued/undervalued relative to its assets compared to its industry peers."},{"section":"Dividend Yield","text":"The dividend yield represents the annual dividend payout as a percentage of the stock's current price. IO Biotech Inc does/does not offer dividends."},{"section":"Conclusion","text":"IO Biotech Inc's market capitalization is $X, which is above/below the industry average. Valuation ratios suggest that the stock may be considered overvalued/undervalued compared to its industry peers. Investors should carefully consider these metrics before making any investment decisions."}],"tags":["CrossOver21","Long","Biotechnology"],"news":[{"category":"company","date":1704251072,"headline":"IO Biotech: A Phase 3 Company Getting No Respect","id":124822508,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1415672951/image_1415672951.jpg?io=getty-c-w1536","symbol":"IOBT","publisher":"SeekingAlpha","summary":"IO Biotech is an immunotherapy biotech in phase 3 trials. Click here to read the analysis of IOBT stock and why it is a tentative buy.","url":"https://seekingalpha.com/article/4660897-io-biotech-a-phase-3-company-getting-no-respect"}]}