{"id":1923,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"1995-11-01","marketCap":1799.4967041015625,"name":"Banner Corp","phone":"15095273636","outstanding":34.349998474121094,"symbol":"BANR","website":"https://investor.bannerbank.com/","industry":"Banking"},"price":51.0325,"year":2023,"month":12,"day":14,"weekday":"Thursday","title":"Impact of corporate earnings reports on Banner Corp stock's price movements","date":"2023-12-14","url":"/posts/2023/12/14/BANR","content":[{"section":"Example 1: Positive Earnings Surprise","text":"On April 28, 2021, Banner Corp reported first-quarter earnings that exceeded analysts' expectations. The company announced earnings per share (EPS) of $1.39, compared to the consensus estimate of $0.96. This positive earnings surprise resulted in a significant increase in Banner Corp stock's price. After the earnings report was released, the stock jumped by 7.5% in one trading session."},{"section":"Example 2: Negative Earnings Surprise","text":"In contrast to the first example, on January 28, 2021, Banner Corp reported fourth-quarter earnings that fell short of analysts' expectations. The company announced EPS of $1.22, below the consensus estimate of $1.30. This negative earnings surprise led to a sharp decline in Banner Corp stock's price. Following the earnings report, the stock dropped by 8.2% in one trading session."},{"section":"Example 3: Strong Revenue Growth","text":"Another factor that can impact Banner Corp stock's price movements is the company's revenue growth. On July 22, 2021, Banner Corp reported second-quarter earnings with strong revenue growth. The company's total revenue increased by 20% compared to the same period last year, reaching $136.4 million. This positive revenue growth contributed to a rise in Banner Corp stock's price. The stock gained 4.6% in the trading session following the earnings report."},{"section":"Example 4: Lower-than-expected Revenue","text":"On October 22, 2020, Banner Corp reported third-quarter earnings with lower-than-expected revenue. The company's total revenue for the quarter was $133.1 million, missing the consensus estimate of $136.5 million. This disappointing revenue result led to a decline in Banner Corp stock's price. The stock dropped by 5.1% in the trading session after the earnings report was released."},{"section":"Conclusion","text":"Corporate earnings reports have a significant impact on Banner Corp stock's price movements. Positive earnings surprises and strong revenue growth tend to result in price increases, while negative earnings surprises and lower-than-expected revenue can lead to price declines. Investors closely monitor these reports to make informed decisions regarding their investment in Banner Corp stock."}],"tags":["CrossOver100","Long","Banking"],"news":[{"category":"company","date":1702033641,"headline":"Positive week for Banner Corporation (NASDAQ:BANR) institutional investors who lost 22% over the past year","id":124393973,"image":"https://media.zenfs.com/en/simply_wall_st__316/a192a90509b207df974cc973e0c18172","symbol":"BANR","publisher":"Yahoo","summary":"Key Insights Given the large stake in the stock by institutions, Banner's stock price might be vulnerable to their...","url":"https://finance.yahoo.com/news/positive-week-banner-corporation-nasdaq-110721841.html"},{"category":"company","date":1701742320,"headline":"Banner (BANR) Passes Through 4% Yield Mark","id":124321933,"image":"","symbol":"BANR","publisher":"Dividend Channel","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3242680510"}]}