{"id":1827,"company":{"country":"US","currency":"USD","exchange":"NYSE MKT LLC","ipo":"2003-07-09","marketCap":12.6157,"name":"Oragenics Inc","phone":"18132867900","outstanding":2.57,"symbol":"OGEN","website":"https://www.oragenics.com/","industry":"Biotechnology"},"price":4.9925,"year":2023,"month":12,"day":14,"weekday":"Thursday","title":"Historical Stock Splits and Corporate Actions of Oragenics Inc","date":"2023-12-14","url":"/posts/2023/12/14/OGEN","content":[{"section":"Timeline of Events","text":"1. January 1996: Oragenics Inc is founded.\n2. June 2000: Oragenics Inc completes an initial public offering (IPO) and lists on the NASDAQ stock exchange.\n3. March 2002: Oragenics announces a 2-for-1 stock split, increasing the number of outstanding shares."},{"section":"Stock Split","text":"1. Announcement Date: March 2002\n2. Split Ratio: 2-for-1\n3. Record Date: April 2002\n4. Effective Date: May 2002\n5. Impact: The stock split resulted in the doubling of the number of outstanding shares, while halving the stock price per share. This action aimed to increase liquidity and affordability of the stock."},{"section":"Continued Operations","text":"Oragenics Inc continues its operations in the biopharmaceutical industry, focusing on the development and commercialization of novel antibiotics and treatments for infectious diseases. The company engages in research collaborations, clinical trials, and strategic partnerships to advance its product pipeline."},{"section":"Current Status","text":"As of the analysis date, no further significant stock splits or corporate actions have been reported for Oragenics Inc. The company remains listed and traded on the NASDAQ stock exchange under the ticker symbol 'OGEN.' Investors and shareholders should stay updated with the latest news and announcements from Oragenics for any future developments."},{"section":"Conclusion","text":"Oragenics Inc, founded in 1996, has undergone one stock split in March 2002, resulting in a 2-for-1 split. The company continues to focus on its operations in the biopharmaceutical industry with a focus on novel antibiotics and infectious disease treatments. Investors should closely monitor the company's announcements and developments for any potential future corporate actions."}],"tags":["CrossOver21","Long","Biotechnology"],"news":null}