{"id":1864,"company":{"country":"US","currency":"USD","exchange":"NEW YORK STOCK EXCHANGE, INC.","ipo":"2009-12-09","marketCap":1697.8712158203125,"name":"Pebblebrook Hotel Trust","phone":"12405071300","outstanding":120.5,"symbol":"PEB.PRH","website":"https://pebblebrookhotels.com/","industry":"Real Estate"},"price":18.6525,"year":2023,"month":12,"day":14,"weekday":"Thursday","title":"Corporate Governance Practices of Pebblebrook Hotel Trust","date":"2023-12-14","url":"/posts/2023/12/14/PEB.PRH","content":[{"section":"Board Composition","text":"Pebblebrook Hotel Trust's board composition consists of 7 directors, out of which 6 are independent directors. This indicates a commitment to maintaining a majority of independent directors on the board, which is considered a best practice in corporate governance. Independent directors bring unbiased perspectives and can effectively oversee management."},{"section":"Executive Compensation","text":"Pebblebrook Hotel Trust follows a structured executive compensation program. The compensation package for executives includes a combination of base salary, short-term incentives, and long-term incentives. This alignment of compensation with company performance encourages executives to focus on shareholder value creation in the long run."},{"section":"Independence and Expertise","text":"The presence of independent directors on the board ensures a check on management's decisions and enhances objectivity in decision-making. Additionally, Pebblebrook Hotel Trust's directors possess diverse expertise and experience in various fields relevant to the hospitality industry. This expertise contributes to informed decision-making and effective governance."},{"section":"Shareholder Engagement","text":"Pebblebrook Hotel Trust demonstrates a commitment to shareholder engagement by regularly communicating with shareholders and providing opportunities for them to participate in the company's decision-making processes. This promotes transparency and accountability, which are essential elements of good corporate governance."},{"section":"Board Committees","text":"Pebblebrook Hotel Trust maintains several board committees, including an Audit Committee, Compensation Committee, Nominating and Corporate Governance Committee, and Executive Committee. These committees play vital roles in overseeing financial reporting, executive compensation, board nominations, and strategic decision-making. The existence of these committees demonstrates a structured approach to corporate governance."},{"section":"Ethical Standards","text":"Pebblebrook Hotel Trust has a strong commitment to ethical standards and conducts its business with integrity. The company has established a Code of Business Conduct and Ethics that guides the behavior of its directors, executives, and employees. This commitment to ethics promotes trust, transparency, and accountability."},{"section":"Risk Management","text":"Pebblebrook Hotel Trust prioritizes risk management and has established appropriate processes and controls to identify, assess, and mitigate risks. The board actively engages in discussions regarding risk management strategies and regularly reviews the company's risk profile. This proactive approach to risk management ensures the protection of shareholder interests."},{"section":"Overall Governance Effectiveness","text":"The corporate governance practices of Pebblebrook Hotel Trust demonstrate a strong commitment to transparency, accountability, and shareholder value. The composition of the board, adherence to ethical standards, engagement with shareholders, and focus on risk management contribute to effective governance. However, continuous evaluation and improvement in governance practices can further enhance the company's overall governance effectiveness."}],"tags":["CrossOver55","Long","Real Estate"],"news":null}