{"id":855,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2013-02-22","marketCap":155.41323852539062,"name":"First Internet Bancorp","phone":"13175327900.0","outstanding":8.670000076293945,"symbol":"INBK","website":"https://www.firstinternetbancorp.com/","industry":"Banking"},"price":18.129974,"year":2023,"month":11,"day":16,"weekday":"Thursday","title":"Historical Stock Price Performance of First Internet Bancorp During Significant Market Events","date":"2023-11-16","url":"/posts/2023/11/16/INBK","content":[{"section":"Market Crash: Dotcom Bubble Burst (2000)","text":"During the dotcom bubble burst in 2000, many internet companies experienced significant declines in their stock prices. First Internet Bancorp, being an internet-focused bank, also faced a downturn. Its stock price dropped from around $50 in early 2000 to below $5 by the end of the year."},{"section":"Market Rally: Recovery from 2008 Financial Crisis","text":"After the 2008 financial crisis, the overall market went through a period of recovery. First Internet Bancorp's stock price reflected this positive trend and showed a steady increase from around $3 in early 2009 to $17 by the end of 2010."},{"section":"Market Crash: Great Recession (2008)","text":"During the Great Recession, First Internet Bancorp's stock price also experienced a decline, like most financial institutions. It went from around $20 in early 2008 to less than $3 by early 2009, reflecting the impact of the economic downturn."},{"section":"Market Rally: COVID-19 Recovery (2020)","text":"In 2020, the COVID-19 pandemic caused a sharp market downturn. However, First Internet Bancorp's stock price demonstrated resilience. After a temporary dip to around $15 in March 2020, it quickly rebounded and reached a new all-time high of over $45 by the end of the year, reflecting the bank's ability to adapt to changing market conditions."},{"section":"Market Crash: Financial Crisis (2008)","text":"During the global financial crisis in 2008, First Internet Bancorp's stock price faced significant volatility. It dropped from around $20 in early 2008 to below $4 in late 2008. The market crash greatly impacted the banking sector, including First Internet Bancorp."},{"section":"Market Rally: Tech Sector Surge (2020)","text":"While the COVID-19 pandemic had a negative impact on many industries, the tech sector experienced a surge in market interest. First Internet Bancorp, being an internet-focused bank, benefited from this trend. Its stock price climbed from around $20 in March 2020 to over $45 by the end of the year, reflecting the positive sentiment towards tech companies during the pandemic."}],"tags":["CrossOver200","Long","Banking"],"news":[{"category":"company","date":1699298498,"headline":"Ten Community Banks Trading At More Than 35% Below Tangible Book","id":123672664,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/625912496/image_625912496.jpg?io=getty-c-w1536","symbol":"INBK","publisher":"SeekingAlpha","summary":"Bank stocks started rallying in May but then fell back creating new opportunities. Read my analysis of 10 bank stocks and find out which ones I recommend.","url":"https://seekingalpha.com/article/4648173-ten-community-banks-trading-at-more-than-35-percent-below-tangible-book"},{"category":"company","date":1699143860,"headline":"First Internet Bancorp: Management Optimistic About Future, I A Little Less So","id":123641905,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1540766455/image_1540766455.jpg?io=getty-c-w1536","symbol":"INBK","publisher":"SeekingAlpha","summary":"First Internet stock has lost about 28% in 2023 due to rising interest rates and the banking crisis. Find out why INBK stock is a Hold.","url":"https://seekingalpha.com/article/4647684-first-internet-bancorp-management-optimistic-about-future-i-a-little-less-so"}]}