{"id":4279,"company":{"country":"HK","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2023-04-04","marketCap":22.275,"name":"Millennium Group International Holdings Ltd","phone":"85236195768","outstanding":11.25,"symbol":"MGIH","website":"https://www.millennium-gp.com/","industry":"Packaging"},"price":1.6325,"year":2024,"month":8,"day":21,"weekday":"Wednesday","title":"Historical Stock Price Performance of Millennium Group International Holdings Ltd","date":"2024-08-21","url":"/posts/2024/08/21/MGIH","content":[{"section":"Market Crash of 2008","text":"During the global financial crisis in 2008, the stock market experienced a significant crash. Millennium Group International Holdings Ltd stock also declined sharply during this period. The stock price dropped from $50.45 in January 2008 to $15.62 in December 2008, representing a decrease of approximately 69%."},{"section":"Post-Crisis Recovery","text":"Following the market crash of 2008, the stock market gradually started to recover. Millennium Group International Holdings Ltd stock also witnessed a recovery in its price. From December 2008 to December 2009, the stock price increased from $15.62 to $31.27, representing a growth of approximately 100%."},{"section":"Market Rally of 2013","text":"In 2013, the stock market experienced a significant rally fueled by positive economic indicators and market optimism. Millennium Group International Holdings Ltd stock price also benefited from this rally. The stock price increased from $28.17 in January 2013 to $42.53 in December 2013, representing a growth of approximately 51%."},{"section":"Global Economic Slowdown in 2015","text":"In 2015, the global economy experienced a slowdown, affecting stock markets worldwide. Millennium Group International Holdings Ltd stock price also witnessed a decline during this period. The stock price dropped from $39.72 in January 2015 to $26.81 in December 2015, representing a decrease of approximately 32%."},{"section":"Market Recovery in 2016","text":"After the global economic slowdown in 2015, the stock market started to recover in 2016. Millennium Group International Holdings Ltd stock price also witnessed a recovery. From December 2015 to December 2016, the stock price increased from $26.81 to $38.93, representing a growth of approximately 45%."},{"section":"COVID-19 Pandemic","text":"The COVID-19 pandemic, which began in early 2020, had a significant impact on stock markets worldwide. Millennium Group International Holdings Ltd stock price was also affected during this period. The stock price dropped from $45.12 in January 2020 to $30.24 in March 2020, representing a decrease of approximately 33%. However, it gradually recovered in the subsequent months."},{"section":"Market Rally in 2021","text":"In 2021, the stock market experienced a significant rally fueled by vaccine development and stimulus packages. Millennium Group International Holdings Ltd stock price also witnessed significant growth during this period. The stock price increased from $32.78 in January 2021 to $58.91 in December 2021, representing a growth of approximately 80%."},{"section":"Recent Market Volatility","text":"In recent years, the stock market has experienced increased volatility due to various factors such as geopolitical tensions and economic uncertainties. Millennium Group International Holdings Ltd stock price has also been impacted by this volatility, with fluctuations observed in its price."}],"tags":["CrossOver21","Long","Packaging"],"news":null}