{"id":938,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"1994-03-15","marketCap":113.64673614501953,"name":"NN Inc","phone":"19802644300.0","outstanding":47.02000045776367,"symbol":"NNBR","website":"https://www.nninc.com/","industry":"Machinery"},"price":2.38,"year":2023,"month":11,"day":18,"weekday":"Saturday","title":"Corporate Governance Practices of NN Inc","date":"2023-11-18","url":"/posts/2023/11/18/NNBR","content":[{"section":"Board Composition","text":"NN Inc has a diverse and experienced board of directors consisting of individuals with varied backgrounds and expertise. The board consists of both independent directors and members of management. This composition ensures a balance of perspectives and avoids excessive concentration of power."},{"section":"Executive Compensation","text":"NN Inc follows a structured and transparent approach to executive compensation. The company's compensation committee, comprised of independent board members, determines executive salaries, bonuses, and stock-based incentives. The committee ensures that compensation is aligned with company performance and industry benchmarks, and takes into consideration individual achievements and market conditions."},{"section":"Performance Evaluation","text":"NN Inc regularly evaluates the performance of its board of directors and executive management. This evaluation process includes assessing individual performance, the effectiveness of decision-making processes, and the overall alignment of actions with the company's strategic goals. The evaluations help identify areas for improvement and ensure that the board remains accountable to shareholders."},{"section":"Shareholder Engagement","text":"NN Inc actively engages with its shareholders and encourages their participation in the company's decision-making processes. The company holds regular shareholder meetings where investors can ask questions, provide feedback, and express their concerns. Additionally, NN Inc provides comprehensive and transparent disclosures about its governance practices, financial performance, and future plans."},{"section":"Risk Management","text":"NN Inc has robust risk management processes in place to identify, assess, and mitigate potential risks. The board of directors oversees the company's risk management framework and regularly reviews and updates it to address emerging risks. This proactive approach helps safeguard the interests of shareholders and ensures the long-term sustainability of the company."},{"section":"Code of Ethics","text":"NN Inc has established a code of ethics that sets out the standards of conduct expected from all employees and directors. The code emphasizes integrity, transparency, and ethical behavior in all business dealings. Regular training programs and awareness campaigns are conducted to ensure that employees and directors understand and adhere to the code of ethics."},{"section":"Transparency","text":"NN Inc values transparency and strives to provide clear and timely information to its stakeholders. The company regularly discloses financial statements, annual reports, and other relevant information on its website and through regulatory filings. This transparency builds trust and confidence among shareholders and helps them make informed investment decisions."},{"section":"Conclusion","text":"NN Inc demonstrates strong corporate governance practices through a well-composed and diverse board of directors, a fair and transparent executive compensation structure, regular performance evaluations, shareholder engagement, robust risk management, a code of ethics, and transparency in disclosures. These practices contribute to the company's overall governance framework, ensuring accountability, and alignment with shareholder interests."}],"tags":["CrossOver55","Long","Machinery"],"news":[{"category":"company","date":1699970100,"headline":"Sidoti Events, LLC’s Virtual November Micro-Cap Conference","id":123859325,"image":"https://media.zenfs.com/en/accesswire.ca/459583ef6dba47f36dfb6b1676fb6f26","symbol":"NNBR","publisher":"Yahoo","summary":"NEW YORK, NY / ACCESSWIRE / November 14, 2023 / Sidoti Events, LLC, an affiliate of Sidoti \u0026 Company, LLC, has released the presentation schedule and weblinks for its two-day November Micro-Cap Conference taking place Wednesday and Thursday, November ...","url":"https://finance.yahoo.com/news/sidoti-events-llc-virtual-november-135500632.html"},{"category":"company","date":1699965000,"headline":"NN, Inc. Executive Management to Participate in the Sidoti Virtual Micro-Cap Investor Conference","id":123860028,"image":"https://media.zenfs.com/en/globenewswire.com/ed09f2b7c9a62717c0feb6c50e90c3d9","symbol":"NNBR","publisher":"Yahoo","summary":"CHARLOTTE, N.C., Nov. 14, 2023 (GLOBE NEWSWIRE) -- NN, Inc. (NASDAQ: NNBR), a global diversified industrial company that manufactures high-precision components and assemblies, announced today that Harold Bevis, President and Chief Executive Officer, and Michael Felcher, Senior Vice President and Chief Financial Officer, will present virtually at the Sidoti Micro-Cap Virtual Conference on November 15, 2023, at 2:30 p.m. ET. A link to the webcast and associated presentation materials can be access","url":"https://finance.yahoo.com/news/nn-inc-executive-management-participate-123000423.html"},{"category":"company","date":1699536000,"headline":"NNBR: NN Inc. released 3rd quarter 2023 results which showed improved free cash flow generation and progress towards its strategic transformation initiatives.","id":123776940,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"NNBR","publisher":"Yahoo","summary":"By Thomas Kerr, CFA NASDAQ:NNBR READ THE FULL NNBR RESEARCH REPORT NN Inc. (NASDAQ:NNBR) reported 3rd quarter 2023 financial results on November 6, 2023 which showed improved profitability and free cash flow generation as well as progress towards strategic transformation initiatives. Sales decreased 2.2% to $124.4 million compared to the prior year period which was largely driven by reduced","url":"https://finance.yahoo.com/news/nnbr-nn-inc-released-3rd-132000296.html"},{"category":"company","date":1699467577,"headline":"NN, Inc. (NASDAQ:NNBR) Q3 2023 Earnings Call Transcript","id":123732679,"image":"https://s.yimg.com/ny/api/res/1.2/LuRnmtQVrUMwJS8GkdQlSw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/4455d1814cbe54e2f0eb235b3e9e36d4","symbol":"NNBR","publisher":"Yahoo","summary":"NN, Inc. (NASDAQ:NNBR) Q3 2023 Earnings Call Transcript November 7, 2023 Operator: Good morning and welcome to the NN, Inc. Third Quarter 2023 Earnings Call. All participants will be in a listen-only mode. [Operator Instructions]. After today’s presentation, there will be an opportunity to ask questions. [Operator Instructions]. Please also note this event is being […]","url":"https://finance.yahoo.com/news/nn-inc-nasdaq-nnbr-q3-181937289.html"},{"category":"company","date":1699372222,"headline":"NN, Inc. (NNBR) Q3 2023 Earnings Call Transcript","id":123695838,"image":"https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png","symbol":"NNBR","publisher":"SeekingAlpha","summary":"NN, Inc. (NASDAQ:NASDAQ:NNBR) Q3 2023 Earnings Call Transcript November 7, 2023 9:00 AM ETCompany ParticipantsAlec Steinberg - Investor RelationsHarold...","url":"https://seekingalpha.com/article/4648702-nn-inc-nnbr-q3-2023-earnings-call-transcript"},{"category":"company","date":1699370132,"headline":"NN, Inc. 2023 Q3 - Results - Earnings Call Presentation","id":123694951,"image":"https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png","symbol":"NNBR","publisher":"SeekingAlpha","summary":"The following slide deck was published by NN, Inc. in conjunction with their 2023 Q3 earnings call.","url":"https://seekingalpha.com/article/4648679-nn-inc-2023-q3-results-earnings-call-presentation"},{"category":"company","date":1699311003,"headline":"NN Inc (NNBR) Reports Q3 2023 Financial Results: Net Sales Down 2. ...","id":123670875,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"NNBR","publisher":"Yahoo","summary":"Company's Transformation Plan Drives Margin Expansion and Adjusted EBITDA Growth","url":"https://finance.yahoo.com/news/nn-inc-nnbr-reports-q3-225003820.html"},{"category":"company","date":1699308000,"headline":"NN, Inc. Reports Financial Results for Third Quarter 2023","id":123670876,"image":"https://media.zenfs.com/en/globenewswire.com/ed09f2b7c9a62717c0feb6c50e90c3d9","symbol":"NNBR","publisher":"Yahoo","summary":"Execution against the transformation plan drives margin expansion, adjusted EBITDA growth, and strong free cash flow Company launches longer-term value improvement initiatives to refocus growth programs, enhance sales teams, reenter the medical market, and implement Total Cost Productivity program globally CHARLOTTE, N.C., Nov. 06, 2023 (GLOBE NEWSWIRE) -- NN, Inc. (NASDAQ: NNBR), a global diversified industrial company that manufactures high-precision components and assemblies, today reported i","url":"https://finance.yahoo.com/news/nn-inc-reports-financial-results-220000434.html"},{"category":"company","date":1699255620,"headline":"Earnings Scheduled For November 6, 2023","id":123658977,"image":"","symbol":"NNBR","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3197554171"},{"category":"company","date":1699243740,"headline":"NN Non-GAAP EPS of $0.01 beats by $0.07, revenue of $124.44M beats by $3.84M","id":123691651,"image":"","symbol":"NNBR","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3198355013"}]}