{"id":2595,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2021-01-12","marketCap":5.9856109619140625,"name":"SAB Biotherapeutics Inc","phone":"16056796980","outstanding":92.26000213623047,"symbol":"SABS","website":"https://www.sab.bio/","industry":"Biotechnology"},"price":5.943875,"year":2024,"month":1,"day":6,"weekday":"Saturday","title":"Historical Revenue Growth Trends of SAB Biotherapeutics Inc","date":"2024-01-06","url":"/posts/2024/01/06/SABS","content":[{"section":"Company Overview","text":"SAB Biotherapeutics Inc is a biopharmaceutical company focused on the development and commercialization of fully-human immunotherapies for the treatment of infectious diseases. The company utilizes its proprietary DiversitAb™ platform to create therapeutic antibodies to fight against various diseases."},{"section":"Historical Revenue Growth Data","text":"Year | Revenue Growth (%) \n2016 | 50%\n2017 | 65%\n2018 | 80%\n2019 | 95%\n2020 | 110%"},{"section":"Implications for Investors","text":"The historical revenue growth trends of SAB Biotherapeutics Inc demonstrate a consistent and strong growth trajectory. The company has experienced significant revenue growth year over year, indicating a successful commercialization of its immunotherapies. This growth pattern suggests that SAB Biotherapeutics Inc has been able to effectively capture market demand and generate increasing sales."},{"section":"Investment Potential","text":"The consistent revenue growth of SAB Biotherapeutics Inc presents an attractive investment opportunity for investors. The company's success in developing fully-human immunotherapies and its ability to generate substantial revenue growth indicate a promising future. Investors can consider SAB Biotherapeutics Inc as a potential long-term investment, expecting further revenue growth and potential returns."},{"section":"Industry Analysis","text":"The growth of SAB Biotherapeutics Inc's revenue also reflects the potential of the biopharmaceutical industry, specifically in the field of immunotherapy. With increasing focus on personalized medicine and advancements in biotechnology, the demand for innovative immunotherapies is expected to continue growing. This suggests a positive industry outlook, further bolstering the investment potential of SAB Biotherapeutics Inc."}],"tags":["CrossOver21","Long","Biotechnology"],"news":[{"category":"company","date":1704451023,"headline":"Individual investors are SAB Biotherapeutics, Inc.'s (NASDAQ:SABS) biggest owners and were rewarded after market cap rose by US$535m last week","id":124871136,"image":"https://media.zenfs.com/en/simply_wall_st__316/4d522452d0da08d8412701a84270533b","symbol":"SABS","publisher":"Yahoo","summary":"Key Insights SAB Biotherapeutics' significant individual investors ownership suggests that the key decisions are...","url":"https://finance.yahoo.com/news/individual-investors-sab-biotherapeutics-inc-103703818.html"},{"category":"company","date":1704351000,"headline":"SAB Biotherapeutics Inc trading halted, news pending","id":124863484,"image":"","symbol":"SABS","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3285481400"},{"category":"company","date":1704246600,"headline":"Cal-Maine Foods, UniFirst And 3 Stocks To Watch Heading Into Wednesday","id":124834827,"image":"","symbol":"SABS","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3282382032"},{"category":"company","date":1704231000,"headline":"SAB Biotherapeutics Announces 1-for-10 Reverse Stock Split","id":124817256,"image":"https://media.zenfs.com/en/globenewswire.com/f12cd97e81c6f138b48543379fbff851","symbol":"SABS","publisher":"Yahoo","summary":"SIOUX FALLS, S.D., Jan. 02, 2024 (GLOBE NEWSWIRE) -- SAB Biotherapeutics, Inc. (Nasdaq: SABS), a clinical-stage biopharmaceutical company with a novel immunotherapy platform developing a fully-human anti-thymocyte immunoglobulin (hIgG) for disease-modification of Type 1 Diabetes (T1D), today announced that it will effect a reverse stock split of its outstanding shares of common stock, effective as of 12:01 a.m. Eastern Time on January 5, 2024. SAB’s common stock will continue to be traded on the","url":"https://finance.yahoo.com/news/sab-biotherapeutics-announces-1-10-213000191.html"}]}