{"id":2647,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2015-04-15","marketCap":141.532,"name":"XBiotech Inc","phone":"15123862900","outstanding":30.44,"symbol":"XBIT","website":"http://www.xbiotech.com/","industry":"Biotechnology"},"price":4.702525,"year":2024,"month":1,"day":13,"weekday":"Saturday","title":"Corporate Governance Practices of XBiotech Inc","date":"2024-01-13","url":"/posts/2024/01/13/XBIT","content":[{"section":"Board Composition","text":"XBiotech Inc has a board of directors consisting of highly experienced individuals with diverse backgrounds in the biotechnology industry. The board is composed of both independent directors and company executives, ensuring a balance of external oversight and internal expertise. The board includes individuals with expertise in areas such as clinical development, regulatory affairs, finance, and strategic planning."},{"section":"Independent Directors","text":"XBiotech Inc emphasizes the importance of independent directors on their board. These directors are not affiliated with the company and provide an objective viewpoint in decision-making. Independent directors play a crucial role in ensuring effective corporate governance, conducting thorough evaluations of management performance, and safeguarding the interests of shareholders."},{"section":"Executive Compensation","text":"XBiotech Inc follows a transparent approach to executive compensation. The company's compensation structure is designed to align the interests of executives with shareholders. It includes components such as base salary, annual performance bonuses tied to specific targets, and long-term incentives such as stock options or restricted stock units. This compensation structure motivates executives to drive the company's long-term success while also considering short-term performance."},{"section":"Performance-based Incentives","text":"XBiotech Inc's executive compensation includes performance-based incentives to ensure executives are rewarded for achieving key corporate objectives and delivering value to shareholders. These incentives are based on predefined performance metrics linked to financial performance, clinical trial milestones, and regulatory achievements. Companies that employ performance-based incentives typically encourage a focus on sustained growth and shareholder value creation."},{"section":"Say-on-Pay Policy","text":"XBiotech Inc has implemented a say-on-pay policy, allowing shareholders to vote on executive compensation packages. This policy gives shareholders a voice in determining whether the executive compensation aligns with the company's performance and shareholder interests. By providing this avenue for shareholder input, XBiotech Inc promotes transparency and accountability in its corporate governance practices."},{"section":"Board Committees","text":"XBiotech Inc has established various board committees to enhance corporate governance. These committees include the Audit Committee, Compensation Committee, and Nominating and Corporate Governance Committee. Each committee consists of a combination of independent directors and company executives, ensuring adequate expertise and oversight in critical areas of the company's operations."},{"section":"Risk Management","text":"XBiotech Inc places a strong emphasis on risk management as a part of its corporate governance practices. The board actively participates in the identification, assessment, and mitigation of risks that could impact the company's operations and strategic objectives. This proactive approach to risk management enhances transparency, accountability, and overall governance effectiveness."},{"section":"Disclosure and Transparency","text":"XBiotech Inc prioritizes disclosure and transparency in its corporate governance practices. The company regularly communicates with shareholders through quarterly and annual reports, providing comprehensive information on financial performance, strategic initiatives, and governance practices. This commitment to transparency helps foster trust and confidence among shareholders and the broader investment community."}],"tags":["CrossOver21","Long","Biotechnology"],"news":[{"category":"company","date":1704376800,"headline":"XBiotech to Begin Constructing New R\u0026D Facility on its 48-acre Campus","id":124847142,"image":"https://media.zenfs.com/en/globenewswire.com/a26eb06fbe4cabfff59a786726780ac4","symbol":"XBIT","publisher":"Yahoo","summary":"XBiotech Architectural Rendition of XBiotech’s Planned R\u0026D Facility XBiotech Architectural Rendition of XBiotech’s Planned R\u0026D Facility AUSTIN, Texas, Jan. 04, 2024 (GLOBE NEWSWIRE) -- XBiotech Inc. today announced that it plans to expand it’s campus headquarters with the construction of a new, state-of-the-art research and development facility. XBiotech has received City of Austin approval to begin excavation for site preparation and groundwork is expected to begin 1st quarter 2024. The new fou","url":"https://finance.yahoo.com/news/xbiotech-begin-constructing-r-d-140000585.html"},{"category":"company","date":1704356040,"headline":"XBiotech to begin constructing new R\u0026D facility on 48-acre campus","id":124866803,"image":"","symbol":"XBIT","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3284470752"}]}