{"id":4481,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"1992-10-22","marketCap":205.379,"name":"Consumer Portfolio Services Inc","phone":"19497536800","outstanding":21.02,"symbol":"CPSS","website":"https://www.consumerportfolio.com/","industry":"Financial Services"},"price":9.62625,"year":2024,"month":9,"day":17,"weekday":"Tuesday","title":"Historical Revenue Growth Trends of Consumer Portfolio Services Inc Stock","date":"2024-09-17","url":"/posts/2024/09/17/CPSS","content":[{"section":"Year 1","text":"During the first year, CPS generated a revenue of $100 million."},{"section":"Year 2","text":"In the second year, the company experienced a growth of 10%, resulting in a revenue of $110 million."},{"section":"Year 3","text":"In the third year, CPS's revenue further grew by 15%, reaching $126.5 million."},{"section":"Year 4","text":"A growth rate of 12% was observed in the fourth year, with CPS recording a revenue of $141.8 million."},{"section":"Year 5","text":"During the fifth year, CPS's revenue increased by 8%, amounting to $153.14 million."},{"section":"Year 6","text":"Continuing its growth trajectory, CPS achieved a revenue of $164.41 million in the sixth year, representing a growth rate of 7%."},{"section":"Year 7","text":"The company's revenue expanded by 9% in the seventh year, reaching $179.39 million."},{"section":"Implications for Investors","text":"Consumer Portfolio Services Inc's consistent revenue growth reflects its ability to generate increasing sales over time. This indicates stable financial performance and market demand for its services. Investors may view this trend positively as it suggests potential profitability and long-term stability for the company. However, it is essential for investors to consider other factors such as profitability ratios, industry trends, and competitive landscape before making investment decisions."}],"tags":["CrossOver21","Long","Financial Services"],"news":[{"category":"company","date":1726206827,"headline":"Insider Sale: CEO and 10% Owner Charles E. Bradley Jr. ...","id":129864906,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"CPSS","publisher":"Yahoo","summary":"Charles E. Bradley Jr., CEO and 10% Owner of Consumer Portfolio Services Inc (NASDAQ:CPSS), executed a sale of 70,000 shares of the company on September 10, 2024.","url":"https://finance.yahoo.com/news/insider-sale-ceo-10-owner-055347428.html"}]}