{"id":634,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"1993-10-27","marketCap":283.33441162109375,"name":"Fidelity D\u0026D Bancorp Inc","phone":"15703428281.0","outstanding":5.699999809265137,"symbol":"FDBC","website":"https://bankatfidelity.q4ir.com/corporate-profile/default.aspx","industry":"Banking"},"price":49.17935,"year":2023,"month":11,"day":11,"weekday":"Saturday","title":"Ownership Structure of Fidelity D\u0026D Bancorp Inc Stock","date":"2023-11-11","url":"/posts/2023/11/11/FDBC","content":[{"section":"Institutional Investors","text":"As of the latest available data, institutional investors hold a significant portion of Fidelity D\u0026D Bancorp Inc stock. This indicates the confidence of big investment firms in the company's prospects. The exact ownership percentage and the specific institutional investors holding the stock are not mentioned in the available sources."},{"section":"Insider Ownership","text":"Insider ownership refers to the shares of a company's stock owned by its executives, directors, or other insiders. It is usually considered a positive sign when insiders own a significant stake in the company, as it aligns their interests with those of the shareholders. However, the specific data on insider ownership in Fidelity D\u0026D Bancorp Inc is not provided in the available sources."},{"section":"Major Shareholders","text":"The information about major shareholders of Fidelity D\u0026D Bancorp Inc is also not mentioned in the available sources. The identity and ownership percentages of any significant shareholders like individual investors, investment firms, or other entities with a large stake in the company are not provided."}],"tags":["CrossOver55","Long","Banking"],"news":[{"category":"company","date":1699510632,"headline":"18 Upcoming Dividend Increases Including A Dividend King","id":123752354,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1198972656/image_1198972656.jpg?io=getty-c-w1536","symbol":"FDBC","publisher":"SeekingAlpha","summary":"My investment strategy involves finding stocks combining increasing dividends and consistently outperforming the market. Click here for a detailed analysis.","url":"https://seekingalpha.com/article/4649641-18-upcoming-dividend-increases-including-a-dividend-king"}]}