{"id":1596,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2021-07-22","marketCap":214.68788146972656,"name":"Absci Corp","phone":"13609491041","outstanding":92.94000244140625,"symbol":"ABSI","website":"https://www.absci.com/","industry":"Biotechnology"},"price":2.255,"year":2023,"month":12,"day":12,"weekday":"Tuesday","title":"The Role of Innovation and Technology Adoption in Absci Corp's Growth Strategy","date":"2023-12-12","url":"/posts/2023/12/12/ABSI","content":[{"section":"Investment in Research and Development","text":"Absci Corp prioritizes research and development (R\u0026D) activities to promote innovation. By allocating considerable resources towards R\u0026D, the company aims to develop new and improved technologies, products, and services. This focus on R\u0026D enables Absci Corp to create novel solutions that meet the evolving needs of its customers and gain a competitive edge in the market."},{"section":"Adoption of Cutting-Edge Technologies","text":"Absci Corp actively seeks to adopt cutting-edge technologies to enhance its capabilities and offerings. By leveraging technologies such as artificial intelligence (AI), machine learning, and automation, Absci Corp streamlines its workflows, accelerates processes, and improves efficiency. This technology adoption allows the company to provide faster and more accurate results to its clients, thereby increasing customer satisfaction and attracting new business opportunities."},{"section":"Innovation in Drug Discovery","text":"Absci Corp focuses on innovative approaches to drug discovery. By utilizing its proprietary AI-driven platform, named SoluPro, Absci Corp is able to rapidly design and engineer novel protein therapeutics. This platform combines bioinformatics and deep learning algorithms to predict protein stability, solubility, and developability, enabling the efficient creation of bioactive molecules. Such innovation in drug discovery allows Absci Corp to address unmet medical needs and potentially develop breakthrough treatments for various diseases."},{"section":"Biomanufacturing Advancements","text":"Absci Corp is dedicated to advancing biomanufacturing processes. Through the integration of cutting-edge technologies like AI and automation, Absci Corp aims to optimize production efficiency, reduce manufacturing costs, and minimize time-to-market for biotherapeutics. The company's innovative approach to biomanufacturing positions it as a significant player in the rapidly growing field of biopharmaceuticals."},{"section":"Partnerships and Collaborations","text":"Absci Corp actively engages in strategic partnerships and collaborations with other industry leaders, academic institutions, and research organizations. These collaborations provide access to additional resources, expertise, and technologies, fostering a collaborative environment for innovation and promoting technology adoption. By leveraging these partnerships, Absci Corp has the opportunity to gain valuable insights, accelerate research, and expand its capabilities."},{"section":"Continuous Improvement and Adaptation","text":"Absci Corp recognizes the ever-changing nature of the biotechnology industry and understands the need for continuous improvement and adaptation. The company encourages a culture of innovation and agility, empowering its employees to explore new ideas, experiment, and adapt to emerging technologies. This commitment to continuous improvement ensures that Absci Corp remains at the forefront of scientific advancements and maintains a competitive advantage in the market."}],"tags":["CrossOver21","Long","Biotechnology"],"news":[{"category":"company","date":1702296840,"headline":"The 10 Stocks Using AI To Develop New Drugs Were Up 4%, On Average, Last Week","id":124439639,"image":"","symbol":"ABSI","publisher":"TalkMarkets","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3250997212"},{"category":"company","date":1702209960,"headline":"KeyBanc sees opportunity in tech-enabled drug discovery stocks","id":124425548,"image":"","symbol":"ABSI","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3250517857"},{"category":"company","date":1701781860,"headline":"Absci (ABSI) Up on AstraZeneca Deal to Design New Cancer Therapy","id":124302259,"image":"https://media.zenfs.com/en/zacks.com/5d5a6eb884ce28277f39a4369974b5ea","symbol":"ABSI","publisher":"Yahoo","summary":"Absci (ABSI) announces a collaboration agreement with AstraZeneca to develop an AI-designed antibody for an undisclosed oncology target. The stock rises 13%.","url":"https://finance.yahoo.com/news/absci-absi-astrazeneca-deal-design-131100484.html"},{"category":"company","date":1701748260,"headline":"Absci initiated with bullish view at KeyBanc, here's why","id":124318878,"image":"","symbol":"ABSI","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3241946919"},{"category":"company","date":1701693000,"headline":"Absci Announces Collaboration with AstraZeneca to Advance AI-Driven Oncology Candidate","id":124281944,"image":"https://s.yimg.com/ny/api/res/1.2/iZHy.xV2iRvKCCXe_8m4EQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0zNTI-/https://media.zenfs.com/en/globenewswire.com/b1ee56ea230741fd72ddfa61fd4270ec","symbol":"ABSI","publisher":"Yahoo","summary":"Collaboration Combines Absci’s AI Antibody Drug Creation Platform with AstraZeneca’s Expertise in Oncology Research and DevelopmentVANCOUVER, Wash., Dec. 04, 2023 (GLOBE NEWSWIRE) -- Absci Corporation (Nasdaq: ABSI), a leader in generative AI antibody discovery, today announced a collaboration with AstraZeneca, a global biopharmaceutical company, to deliver an AI-designed antibody against an oncology target. This collaboration combines Absci's Integrated Drug Creation™ platform with AstraZeneca'","url":"https://finance.yahoo.com/news/absci-announces-collaboration-astrazeneca-advance-123000837.html"},{"category":"company","date":1701685623,"headline":"Absci Shares Rise 27% After Announcing Collaboration With AstraZeneca","id":124277222,"image":"","symbol":"ABSI","publisher":"Finnhub","summary":"By Chris Wack Absci shares were up 27% at $2.21 after the company entered into a collaboration with AstraZeneca to deliver an AI-designed antibody against an oncology target. The stock hit...","url":"https://finnhub.io/api/news?id=f297670f2480cfa4e56371fa67daf36f60cb9577fb10b1cb6e07c5ba48635bd3"},{"category":"company","date":1701680520,"headline":"Ocular Therapeutix, EyePoint Pharmaceuticals among healthcare movers","id":124279670,"image":"","symbol":"ABSI","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3240525137"},{"category":"company","date":1701672780,"headline":"AstraZeneca in pact with Absci to develop cancer drug based on AI","id":124280124,"image":"","symbol":"ABSI","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3240384838"},{"category":"company","date":1701671580,"headline":"Absci enters collab with AstraZeneca to advance AI-driven oncology candidate","id":124280125,"image":"","symbol":"ABSI","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3240366866"},{"category":"company","date":1701669900,"headline":"AstraZeneca Strikes Deal With Absci To Leverage AI In Cancer Drug Discovery: Report","id":124280126,"image":"","symbol":"ABSI","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3240341889"},{"category":"company","date":1701666060,"headline":"AstraZeneca, Absci tie up on cancer drug, FT reports","id":124280127,"image":"","symbol":"ABSI","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3240291215"},{"category":"company","date":1701584875,"headline":"AstraZeneca, AI biologics firm Absci tie up on cancer drug - FT","id":124260701,"image":"https://media.zenfs.com/en/reuters-finance.com/ffdd7373c71dc918eddc7aee96b65778","symbol":"ABSI","publisher":"Yahoo","summary":"The collaboration aims to harness Absci's AI technology for large-scale protein analysis to find a viable oncology therapy, a leading focus of AstraZeneca, the report said.  It did not say what kind of cancer they plan to target.","url":"https://finance.yahoo.com/news/astrazeneca-ai-biologics-firm-absci-062755722.html"},{"category":"company","date":1701584556,"headline":"UPDATE 1-AstraZeneca, AI biologics firm Absci tie up on cancer drug - FT","id":124260702,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"ABSI","publisher":"Yahoo","summary":"Anglo-Swedish drugmaker AstraZeneca has signed a deal worth up to $247 million with U.S. artificial intelligence (AI) biologics firm Absci to design an antibody to fight cancer, the Financial Times reported on Sunday.  The collaboration aims to harness Absci's AI technology for large-scale protein analysis to find a viable oncology therapy, a leading focus of AstraZeneca, the report said.","url":"https://finance.yahoo.com/news/1-astrazeneca-ai-biologics-firm-062236789.html"},{"category":"company","date":1701579633,"headline":"AstraZeneca ties up with AI biologics company to develop cancer drug","id":124260121,"image":"","symbol":"ABSI","publisher":"Yahoo","summary":"AstraZeneca has signed a deal worth up to $247mn with Absci Corporation of the US to design an antibody to fight cancer, the latest tie-up in fast-expanding efforts to use artificial intelligence for drug discovery.  The collaboration aims to harness Absci’s AI technology for large-scale protein analysis to find a viable oncology therapy — a leading focus of Anglo-Swedish drugmaker AstraZeneca.  The partnership adds to a flurry of agreements between big pharmaceutical companies and young AI businesses to build novel disease treatments and cut the costs of developing them.","url":"https://finance.yahoo.com/m/6c5cbccc-1447-377c-a9ef-33a894d11c87/astrazeneca-ties-up-with-ai.html"}]}