{"id":1645,"company":{"country":"GB","currency":"USD","exchange":"LONDON STOCK EXCHANGE","ipo":"2012-10-09","marketCap":11387.51953125,"name":"InterContinental Hotels Group PLC","phone":"441753972000","outstanding":163.88685607910156,"symbol":"IHG","website":"https://www.ihgplc.com/","industry":"Hotels, Restaurants \u0026 Leisure"},"price":87.7775,"year":2023,"month":12,"day":12,"weekday":"Tuesday","title":"Risks Associated with Investing in InterContinental Hotels Group PLC","date":"2023-12-12","url":"/posts/2023/12/12/IHG","content":[{"section":"Market Volatility","text":"Investing in InterContinental Hotels Group PLC stock exposes investors to market volatility. Fluctuations in the broader stock market or the hospitality industry can impact the stock price. Changes in economic conditions, geopolitical events, and industry-specific factors such as changes in travel patterns or lodging preferences can also influence the stock's value."},{"section":"COVID-19 Impact","text":"The global COVID-19 pandemic has significantly affected the hospitality industry and InterContinental Hotels Group PLC. Travel restrictions, lockdown measures, and reduced consumer demand for hotel stays have led to a decline in revenue and occupancy rates. Although the situation is improving, the recovery may be gradual, and unforeseen setbacks or new waves of infections could prolong the industry's recovery and impact the stock's performance."},{"section":"Competitive Landscape","text":"InterContinental Hotels Group PLC operates in a highly competitive market with various hotel chains, online travel agencies, and alternative accommodation providers. Competition can lead to price wars, lower occupancy rates, and reduced profitability. Any failure to effectively compete on pricing, technology, marketing, or customer experience may impact the company's market share and financial performance."},{"section":"Dependence on Tourism","text":"InterContinental Hotels Group PLC's revenue and profitability depend on global tourism trends. Negative developments in the tourism industry, such as economic downturns, natural disasters, political instability, or travel restrictions, can reduce demand for hotel accommodations and negatively impact the company's financial performance. Additionally, changes in consumers' travel preferences or emerging alternatives to traditional hotels may affect the company's ability to attract customers."},{"section":"Currency Risk","text":"As InterContinental Hotels Group PLC operates globally, it is exposed to currency exchange rate fluctuations. Changes in exchange rates between the company's operating currencies and its reporting currency (usually GBP) can affect revenue and profitability. Investors holding the stock in a different currency may also face exchange rate risks when converting returns back to their home currency."},{"section":"Debt Burden","text":"InterContinental Hotels Group PLC carries a significant amount of debt on its balance sheet. Interest rate changes can impact the cost of servicing this debt. Additionally, if the company faces challenges in generating sufficient cash flows or refinancing its debt, it may lead to financial pressure and negatively impact the stock price."},{"section":"Regulatory and Legal Risks","text":"InterContinental Hotels Group PLC operates in various jurisdictions, subjecting it to different regulatory and legal frameworks. Changes in laws, regulations, or taxes can increase operating costs or restrict business operations. Legal disputes, penalties, or adverse judgments related to areas such as data privacy, consumer protection, or labor practices could also impact the company's reputation and financial performance."},{"section":"Management and Operational Risks","text":"Investors should consider management and operational risks when investing in InterContinental Hotels Group PLC. Factors such as strategic missteps, ineffective cost management, labor disputes, quality control issues, or cybersecurity breaches can have a negative impact on the company's financial performance and stock price."}],"tags":["CrossOver100","Long","Hotels, Restaurants \u0026 Leisure"],"news":[{"category":"company","date":1702296300,"headline":"InterContinental Hotels Group rises Monday, outperforms market","id":124443819,"image":"https://images.mktw.net/im-220105/social","symbol":"IHG","publisher":"MarketWatch","summary":"Shares of InterContinental Hotels Group PLC rose 1.20% to £69.12 Monday, on what proved to be an all-around poor trading session for the stock market, with...","url":"https://www.marketwatch.com/data-news/intercontinental-hotels-group-rises-monday-outperforms-market-31a2dac4-66e791225c11"},{"category":"company","date":1702278000,"headline":"InterContinental Hotels Group PLC Announces Transaction in Own Shares - Dec 11","id":124430718,"image":"https://media.zenfs.com/en/accesswire.ca/19f38b649e0613540cb3d8c62a7b6d1d","symbol":"IHG","publisher":"Yahoo","summary":"Purchase of own sharesLONDON, UK / ACCESSWIRE / December 11, 2023 / The Company announces that on 08 December 2023 it purchased the following number of its ordinary shares of 20340/399 pence each through Goldman Sachs International (\"GSI\") on the ...","url":"https://finance.yahoo.com/news/intercontinental-hotels-group-plc-announces-070000344.html"},{"category":"company","date":1702037100,"headline":"InterContinental Hotels Group rises Friday, outperforms market","id":124421428,"image":"https://images.mktw.net/im-220105/social","symbol":"IHG","publisher":"MarketWatch","summary":"Shares of InterContinental Hotels Group PLC rallied 3.64% to £68.30 Friday, on what proved to be an all-around great trading session for the stock market,...","url":"https://www.marketwatch.com/data-news/intercontinental-hotels-group-rises-friday-outperforms-market-51655321-3c380801c803"},{"category":"company","date":1701960900,"headline":"From Unrefined Salt and Tinned Fish to Umami Cocktails: Kimpton Brings New Food and Beverage Trends and Classics to the Table in 2024","id":124361892,"image":"https://media.zenfs.com/en/prnewswire.com/92cee0c5f116bedb39c99c6e89ce67da","symbol":"IHG","publisher":"Yahoo","summary":"Kimpton Hotels \u0026 Restaurants, part of IHG Hotels \u0026 Resorts' luxury \u0026 lifestyle portfolio, is returning with its annual Culinary + Cocktail Trend Forecast, highlighting predictions from its vast team of global culinary and beverage experts that will be featured on plates and bar menus in 2024. From global salts and seacuterie to textured cocktails and umami flavors, Kimpton is forecasting both new and evolving trends that will further enhance the dining experience.","url":"https://finance.yahoo.com/news/unrefined-salt-tinned-fish-umami-145500195.html"},{"category":"company","date":1701955380,"headline":"Top 5 Consumer Discretionary Stocks for December","id":124360616,"image":"https://media.zenfs.com/en/zacks.com/8b005bb495e471951bcebcfe3b1d5dd2","symbol":"IHG","publisher":"Yahoo","summary":"We have narrowed our search to five consumer discretionary stocks that have strong growth potential for December. These are: LYV, RCL, IHG, NKE, WMG.","url":"https://finance.yahoo.com/news/top-5-consumer-discretionary-stocks-132300742.html"},{"category":"company","date":1701950700,"headline":"InterContinental Hotels Group rises Thursday, outperforms market","id":124421429,"image":"https://images.mktw.net/im-220105/social","symbol":"IHG","publisher":"MarketWatch","summary":"Shares of InterContinental Hotels Group PLC rose 2.33% to £65.90 Thursday, on what proved to be an all-around poor trading session for the stock market, with...","url":"https://www.marketwatch.com/data-news/intercontinental-hotels-group-rises-thursday-outperforms-market-c1da4eb0-f2404055caa3"},{"category":"company","date":1701864300,"headline":"InterContinental Hotels Group rises Wednesday, outperforms market","id":124421430,"image":"https://images.mktw.net/im-220105/social","symbol":"IHG","publisher":"MarketWatch","summary":"InterContinental Hotels Group PLC shares advanced 1.45% to £64.40 Wednesday, on what proved to be an all-around positive trading session for the stock...","url":"https://www.marketwatch.com/data-news/intercontinental-hotels-group-rises-wednesday-outperforms-market-b6dd7e26-cf1917551fc7"},{"category":"company","date":1701777900,"headline":"InterContinental Hotels Group rises Tuesday, outperforms market","id":124421431,"image":"https://images.mktw.net/im-220105/social","symbol":"IHG","publisher":"MarketWatch","summary":"Shares of InterContinental Hotels Group PLC inched up 0.25% to £63.48 Tuesday, on what proved to be an all-around dismal trading session for the stock...","url":"https://www.marketwatch.com/data-news/intercontinental-hotels-group-rises-tuesday-outperforms-market-2fd42f9c-532a15217a04"},{"category":"company","date":1701673200,"headline":"InterContinental Hotels Group PLC Announces Transaction in Own Shares - Dec 4","id":124280749,"image":"https://media.zenfs.com/en/accesswire.ca/19f38b649e0613540cb3d8c62a7b6d1d","symbol":"IHG","publisher":"Yahoo","summary":"Purchase of own sharesLONDON, UK / ACESSWIRE / December 4, 2023 / The Company announces that on 01 December 2023 it purchased the following number of its ordinary shares of 20340/399 pence each through Goldman Sachs International (\"GSI\") on the London ...","url":"https://finance.yahoo.com/news/intercontinental-hotels-group-plc-announces-070000360.html"},{"category":"company","date":1701356820,"headline":"IHG Hotels \u0026 Resorts Debuts Winter Chalet Campaign to Kick Off Cozy Season Across its Luxury \u0026 Lifestyle Hotels","id":124200037,"image":"https://media.zenfs.com/en/prnewswire.com/d5809c251ffe9d1d794514963d41bc15","symbol":"IHG","publisher":"Yahoo","summary":"IHG Hotels \u0026 Resorts announced today a first-of-its-kind seasonal and experiential campaign at its Luxury \u0026 Lifestyle hotels in the Americas from December 1, 2023 through February 29, 2024. Across the region, InterContinental Hotels \u0026 Resorts, Kimpton Hotels \u0026 Restaurants, Vignette Collection and Hotel Indigo properties will transport guests to a timeless winter wonderland through the theme of Winter Chalet featuring larger-than-life lobby installations, created in partnership with renowned cele","url":"https://finance.yahoo.com/news/ihg-hotels-resorts-debuts-winter-150700594.html"},{"category":"company","date":1701345900,"headline":"InterContinental Hotels Group remains steady Thursday, underperforms market","id":124252448,"image":"https://images.mktw.net/im-220105/social","symbol":"IHG","publisher":"MarketWatch","summary":"Shares of InterContinental Hotels Group PLC were unchanged Thursday at £61.16, on what proved to be an all-around great trading session for the stock market,...","url":"https://www.marketwatch.com/data-news/intercontinental-hotels-group-remains-steady-thursday-underperforms-market-76d53689-85c39eecfcf8"},{"category":"company","date":1701259680,"headline":"Consumer Confidence Rebounds in November: 5 Top Picks","id":124166886,"image":"https://media.zenfs.com/en/zacks.com/cb0538e605b17f0c8736f6d0b40f8b26","symbol":"IHG","publisher":"Yahoo","summary":"We have narrowed our search to five consumer-centric stocks with strong upside potential for 2024. These are: HLT, IHG, RCL, NKE, LYV.","url":"https://finance.yahoo.com/news/consumer-confidence-rebounds-november-5-120800927.html"},{"category":"company","date":1701259500,"headline":"InterContinental Hotels Group outperforms market despite losses on the day","id":124252449,"image":"https://images.mktw.net/im-220105/social","symbol":"IHG","publisher":"MarketWatch","summary":"Shares of InterContinental Hotels Group PLC inched down 0.13% to £61.16 Wednesday, on what proved to be an all-around dismal trading session for the stock...","url":"https://www.marketwatch.com/data-news/intercontinental-hotels-group-outperforms-market-despite-losses-on-the-day-1612bf6c-a60b4f3a39dc"},{"category":"company","date":1701173100,"headline":"InterContinental Hotels Group falls Tuesday, underperforms market","id":124252450,"image":"https://images.mktw.net/im-220105/social","symbol":"IHG","publisher":"MarketWatch","summary":"InterContinental Hotels Group PLC shares inched down 0.39% to £61.24 Tuesday, on what proved to be an all-around poor trading session for the stock market,...","url":"https://www.marketwatch.com/data-news/intercontinental-hotels-group-falls-tuesday-underperforms-market-61158ffa-472941788404"},{"category":"company","date":1701165720,"headline":"The Zacks Analyst Blog Highlights Gartner, The Progressive, InterContinental Hotels, Cboe Global Markets and Novo Nordisk","id":124139302,"image":"https://media.zenfs.com/en/zacks.com/723b414aa10600faf58f7a232ec73364","symbol":"IHG","publisher":"Yahoo","summary":"Gartner, The Progressive, InterContinental Hotels, Cboe Global Markets and Novo Nordisk are included in this Analyst Blog.","url":"https://finance.yahoo.com/news/zacks-analyst-blog-highlights-gartner-100200056.html"}]}