{"id":3289,"company":{"country":"US","currency":"USD","exchange":"NYSE MKT LLC","ipo":"2017-10-02","marketCap":5.351572036743164,"name":"Regional Health Properties Inc","phone":"16788695116","outstanding":1.8799999952316284,"symbol":"RHE","website":"https://ir.regionalhealthproperties.com/","industry":"Health Care"},"price":2.8675,"year":2024,"month":4,"day":11,"weekday":"Thursday","title":"Corporate Governance Practices of Regional Health Properties Inc","date":"2024-04-11","url":"/posts/2024/04/11/RHE","content":[{"section":"Board Composition","text":"Regional Health Properties Inc has a board of directors consisting of seven members. The board includes both independent directors and executive directors. The majority of the board members are independent, ensuring a balanced decision-making process. The board boasts a diverse mix of expertise and experience in the healthcare industry, finance, and strategic management."},{"section":"Executive Compensation","text":"The executive compensation structure at Regional Health Properties Inc is primarily designed to align the interests of executives with those of shareholders. The compensation package includes a base salary, annual cash incentives, and long-term equity-based incentives such as stock options or restricted stock units. The performance metrics for determining annual bonuses and long-term incentives are directly linked to the company's financial performance and shareholder value creation. This ensures that executives are rewarded for driving sustainable growth and profitability."},{"section":"Governance Policies","text":"Regional Health Properties Inc has established robust governance policies and practices to ensure transparency, accountability, and ethical conduct. The company has a Code of Business Conduct and Ethics that outlines the expected behavior of directors, officers, and employees. The board regularly evaluates its own performance and effectiveness, and board committees have been formed to oversee specific areas such as audit, compensation, and governance. These committees further strengthen the governance framework and ensure independent oversight."},{"section":"Shareholder Engagement","text":"Regional Health Properties Inc actively engages with its shareholders to solicit feedback and understand their perspectives. The company holds regular shareholder meetings to provide updates on its performance, strategy, and corporate governance practices. The board encourages shareholders to participate in these meetings and actively seeks input on matters of importance. This open communication fosters a strong relationship between the company and its shareholders."},{"section":"Risk Management","text":"Regional Health Properties Inc recognizes the importance of effective risk management and has implemented a comprehensive risk oversight framework. The board monitors and assesses the company's exposure to various risks, such as operational, financial, and reputational risks. The company has a dedicated risk management committee that oversees the identification, evaluation, and mitigation of risks. Additionally, internal controls and compliance processes are in place to ensure adherence to regulatory requirements and mitigate potential risks."},{"section":"Conclusion","text":"Regional Health Properties Inc demonstrates strong corporate governance practices through its diverse and independent board, performance-based executive compensation structure, robust governance policies, active shareholder engagement, and comprehensive risk management framework. These practices contribute to the company's sound decision-making, transparency, and ability to create long-term value for its shareholders."}],"tags":["CrossOver21","Long","Health Care"],"news":[{"category":"company","date":1712582100,"headline":"Regional Health Properties Reports Fourth Quarter and Full Year 2023 Financial Results","id":126895303,"image":"https://media.zenfs.com/en/globenewswire.com/b9341fd6161ce87654455ca40e1419af","symbol":"RHE","publisher":"Yahoo","summary":"Collected 93% of Contractual Rent[1] Strong Operator Rent Coverage ATLANTA, GA, April 08, 2024 (GLOBE NEWSWIRE) -- Regional Health Properties, Inc. (the “Company,” “Regional Health,” “we”, “us” or “our”) (NYSE American: RHE) (NYSE American: RHE-PA), a self-managed healthcare real estate investment company that invests primarily in real estate purposed for senior living and long-term care, today announced its financial results for the fourth quarter and fiscal year ended December 31, 2023. FOURTH","url":"https://finance.yahoo.com/news/regional-health-properties-reports-fourth-131500143.html"},{"category":"company","date":1712581080,"headline":"RHE Stock Earnings: Regional Health Props Reported Results for Q4 2023","id":126906596,"image":"","symbol":"RHE","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3434820276"},{"category":"company","date":1712564220,"headline":"Regional Health Properties reports Q4 EPS (13c) vs. ($2.54) last year","id":126906600,"image":"","symbol":"RHE","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3434461576"}]}