{"id":2526,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2021-07-15","marketCap":47.49143981933594,"name":"Texas Community Bancshares Inc","phone":"19035692602","outstanding":3.2100000381469727,"symbol":"TCBS","website":"","industry":"Banking"},"price":14.8,"year":2023,"month":12,"day":23,"weekday":"Saturday","title":"Ownership Structure of Texas Community Bancshares Inc stock","date":"2023-12-23","url":"/posts/2023/12/23/TCBS","content":[{"section":"Institutional Investors","text":"Institutional investors play a significant role in the ownership of Texas Community Bancshares Inc stock. They are professional investment firms, such as mutual funds, pension funds, and insurance companies, that manage large amounts of capital on behalf of their clients. These investors often have significant holdings in the company's stock and can influence its decision-making processes. However, specific data on institutional ownership of Texas Community Bancshares Inc stock is not available."},{"section":"Insider Ownership","text":"Insiders, including company executives, directors, and employees, also hold ownership stakes in Texas Community Bancshares Inc stock. Insider ownership can be an indicator of confidence in the company's future prospects. However, detailed data on insider ownership of Texas Community Bancshares Inc stock is not publicly disclosed."},{"section":"Major Shareholders","text":"Information on major shareholders of Texas Community Bancshares Inc stock is not readily available in the provided data. It would require accessing additional sources or company filings to identify the specific individuals or entities holding significant stakes in the company."},{"section":"","text":""},{"section":"","text":""},{"section":"","text":""},{"section":"","text":""},{"section":"","text":""}],"tags":["CrossOver21","Long","Banking"],"news":[{"category":"company","date":1703050920,"headline":"Insiders Buying Pfizer And 3 Other Stocks","id":124640896,"image":"","symbol":"TCBS","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3265483826"}]}