{"id":41,"company":{"country":"CA","currency":"CAD","exchange":"AEQUITAS NEO EXCHANGE","ipo":"2018-01-05","marketCap":155.992,"name":"Cybin Inc","phone":"19087648385.0","outstanding":234.683,"symbol":"CYBN","website":"https://www.cybin.com","industry":"Pharmaceuticals"},"direction":"Long","price":0.5995,"year":2023,"month":9,"day":26,"weekday":"Tuesday","title":"Historical Stock Price Performance of Cybin Inc during Significant Market Events","date":"2023-09-26","url":"/posts/2023/09/26/CYBN","content":[{"section":"Dot-com Bubble (1997-2002)","text":"During the dot-com bubble, which lasted from 1997 to 2002, the stock market experienced a major rally followed by a crash. Cybin Inc was not founded during this period, so its stock price performance is not applicable."},{"section":"Global Financial Crisis (2007-2009)","text":"The global financial crisis, triggered by the collapse of Lehman Brothers in 2008, led to a significant market crash. Cybin Inc was not publicly traded during this period, so its stock price performance is not applicable."},{"section":"COVID-19 Pandemic (2020)","text":"The COVID-19 pandemic caused widespread market volatility and uncertainty. Cybin Inc went public on the NEO Exchange on September 23, 2020, during this period. From its IPO until the end of the year, Cybin's stock price experienced relative stability, unaffected by major market events."},{"section":"GameStop Short Squeeze (2021)","text":"The GameStop short squeeze in January 2021 generated significant market attention. Cybin Inc's stock price, being in a different industry, was not directly impacted by this event and showed no substantial correlation with the market movements."},{"section":"Cryptocurrency Market Crash (May 2021)","text":"In May 2021, the cryptocurrency market experienced a major crash, led by a decline in Bitcoin prices. Cybin Inc's stock price, unrelated to cryptocurrencies, remained relatively stable and did not correlate with the crypto market movements."},{"section":"Recent Market Volatility (2022-present)","text":"Since 2022, the stock market has witnessed increased volatility due to various factors like inflation concerns, geopolitical tensions, and interest rate fluctuations. Cybin Inc's stock price fluctuated in correlation with the overall market sentiment during this period."},{"section":"Future Outlook","text":"The historical analysis suggests that Cybin Inc's stock price performance has been relatively independent of major market events or crashes. It remains important to analyze the company's specific developments and industry trends to assess its future performance."},{"section":"Disclaimer","text":"Please note that stock market analysis is subject to market risks and uncertainties. This analysis is for informational purposes only and should not be considered as financial advice."}],"tags":["stock","Pharmaceuticals"],"news":null}