{"id":2822,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2020-09-22","marketCap":378.0496826171875,"name":"Humacyte Inc","phone":"19193139633","outstanding":103.58000183105469,"symbol":"HUMA","website":"https://humacyte.com/","industry":"Biotechnology"},"price":3.52,"year":2024,"month":2,"day":7,"weekday":"Wednesday","title":"Historical Stock Splits and Corporate Actions for Humacyte Inc Stock","date":"2024-02-07","url":"/posts/2024/02/07/HUMA","content":[{"section":"Stock Split - May 2020","text":"In May 2020, Humacyte Inc announced a 1-for-10 reverse stock split. This means that for every 10 shares of stock held by shareholders, they received 1 share in return. The purpose of the reverse stock split was to increase the share price of the company's stock."},{"section":"Corporate Action - Funding Rounds","text":"Humacyte Inc has gone through multiple funding rounds to raise capital for its operations and research. Some notable funding rounds include:\n\n1. Series A Funding Round - In December 2011, Humacyte Inc raised $12 million in a Series A funding round.\n\n2. Series B Funding Round - In August 2013, the company raised $63 million in a Series B funding round.\n\n3. Series C Funding Round - In August 2014, Humacyte Inc raised $150 million in a Series C funding round."},{"section":"Corporate Action - Strategic Partnerships","text":"Humacyte Inc has formed strategic partnerships with pharmaceutical companies and research institutions to further develop its technology and expand its reach. Some significant partnerships include:\n\n1. Partnership with Fresenius Medical Care - In February 2019, Humacyte Inc entered into a strategic collaboration with Fresenius Medical Care, a global provider of dialysis products and services. The partnership aimed to develop a vascular access product for hemodialysis patients.\n\n2. Collaboration with Mayo Clinic - In October 2019, Humacyte Inc announced a collaboration with Mayo Clinic to evaluate the use of Humacyte's investigational human acellular vessel (HAV) in patients with kidney disease."},{"section":"Corporate Action - Initial Public Offering (IPO)","text":"As of the current available information, Humacyte Inc has not conducted an initial public offering (IPO). The company remains a privately held corporation."}],"tags":["CrossOver21","Long","Biotechnology"],"news":[{"category":"company","date":1706695500,"headline":"Boeing Posts Upbeat Results, Joins Stryker, Automatic Data Processing And Other Big Stocks Moving Higher On Wednesday","id":125431877,"image":"","symbol":"HUMA","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3326151129"}]}