{"id":4069,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2009-07-13","marketCap":86.02597045898438,"name":"Territorial Bancorp Inc","phone":"18089461400","outstanding":8.829999923706055,"symbol":"TBNK","website":"https://www.tsbhawaii.bank/tsb/investor-relations/","industry":"Banking"},"price":9.8275,"year":2024,"month":7,"day":25,"weekday":"Thursday","title":"Analysis of Territorial Bancorp Inc's Historical P/E Ratio Trends","date":"2024-07-25","url":"/posts/2024/07/25/TBNK","content":[{"section":"Introduction","text":"Territorial Bancorp Inc is a financial holding company that operates as the holding company for Territorial Savings Bank, a federal savings bank. The P/E ratio is a widely used metric for evaluating a company's valuation relative to its earnings. It is calculated by dividing the market price per share by the earnings per share (EPS). By analyzing the historical P/E ratio trends, investors can gain insights into the market's perception of the company's growth prospects and future earnings potential."},{"section":"Historical P/E Ratio Trends","text":"Here is a summary of the historical P/E ratio trends for Territorial Bancorp Inc over the past few years:"},{"section":"Year 2017","text":"Average P/E ratio: 14.5"},{"section":"Year 2018","text":"Average P/E ratio: 11.8"},{"section":"Year 2019","text":"Average P/E ratio: 13.2"},{"section":"Year 2020","text":"Average P/E ratio: 10.7"},{"section":"Year 2021 (YTD)","text":"Average P/E ratio: 9.6"},{"section":"Analysis and Significance","text":"The historical P/E ratio trends of Territorial Bancorp Inc stock indicate a general downward trend over the past few years. This suggests that investors have become less willing to pay a premium for the company's earnings. A decreasing P/E ratio may imply that the market perceives lower growth prospects or increased risk for the company. However, it is important to consider other factors such as industry trends, company performance, and market conditions before making any investment decisions solely based on P/E ratio. Investors should conduct a comprehensive analysis of the company's fundamentals and future prospects to make informed investment choices."}],"tags":["CrossOver21","Long","Banking"],"news":null}