{"id":3974,"company":{"country":"US","currency":"USD","exchange":"NEW YORK STOCK EXCHANGE, INC.","ipo":"1969-03-05","marketCap":446140,"name":"JPMorgan Chase \u0026 Co","phone":"12122706000.0","outstanding":2906.09,"symbol":"JPM","website":"https://www.jpmorganchase.com/","industry":"Banking"},"price":208.8925,"year":2024,"month":7,"day":16,"weekday":"Tuesday","title":"Historical Performance of JPMorgan Chase \u0026 Co Stock Compared to Industry Benchmarks","date":"2024-07-16","url":"/posts/2024/07/16/JPM","content":[{"section":"Introduction","text":"JPMorgan Chase \u0026 Co is a global financial services company and one of the largest banks in the United States. It operates in various segments such as Consumer \u0026 Community Banking, Corporate \u0026 Investment Bank, Commercial Banking, and Asset \u0026 Wealth Management. To evaluate its historical performance, we will compare the stock's performance to industry benchmarks."},{"section":"Methodology","text":"To conduct this analysis, we will use historical price data for JPMorgan Chase \u0026 Co stock and industry benchmark indices. The time period considered for analysis will be determined based on the availability of reliable data, typically spanning several years. We will calculate and compare various performance metrics to assess the stock's relative performance against the benchmarks."},{"section":"Comparison Metrics","text":"Several performance metrics will be used to compare JPMorgan Chase \u0026 Co stock with industry benchmarks. These may include total return, annualized return, volatility, Sharpe ratio, and beta. The total return measures the overall gain or loss from an investment, incorporating both capital appreciation and dividends. The annualized return calculates the average annual return over a specific time period. Volatility indicates the degree of price fluctuation, with higher volatility implying greater risk. The Sharpe ratio assesses the risk-adjusted return, considering the volatility of the investment. Beta measures the sensitivity of the stock's price movements to changes in the benchmark index."},{"section":"Historical Performance","text":"The historical performance analysis will present a comparison of JPMorgan Chase \u0026 Co stock's performance against relevant industry benchmarks for the selected time period. It will highlight key metrics discussed earlier and provide a comprehensive understanding of the stock's performance relative to the industry. The analysis will maintain objectivity, focusing solely on the numerical data without including subjective opinions or biases."},{"section":"Conclusion","text":"By comparing the historical performance of JPMorgan Chase \u0026 Co stock against industry benchmarks, this analysis can provide insights into the stock's relative performance and identify any trends or patterns. It can assist investors in making informed decisions and understanding the stock's positioning within the industry."}],"tags":["LongSignals","Long","Banking"],"news":[{"category":"company","date":1721119358,"headline":"Citigroup's Turnaround Story Getting Taken A Little More Seriously Now","id":128711461,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/473005986/image_473005986.jpg?io=getty-c-w1536","symbol":"JPM","publisher":"SeekingAlpha","summary":"Citigroup's Q2 results were better than expected on a core basis, with a $0.13/beat at the core pre-provision profit line. Find out my recommendation on C stock.","url":"https://seekingalpha.com/article/4704288-citigroup-stock-turnaround-story-noq-taken-more-seriously"},{"category":"company","date":1721101828,"headline":"A Price Trend View Of 'Buy The Market'","id":128707861,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2145938692/image_2145938692.jpg?io=getty-c-w1536","symbol":"JPM","publisher":"SeekingAlpha","summary":"\"Buy the market\" concept using popular indexes such as S\u0026P 500 includes both leaders \u0026 laggards regarding longer-term performance. Read more to see my thoughts.","url":"https://seekingalpha.com/article/4704228-a-price-trend-view-of-buy-the-market"},{"category":"company","date":1721085537,"headline":"JPMorgan Chase: Likely Fairly Valued, But Well-Positioned To Keep Gaining Market Share","id":128705462,"image":"","symbol":"JPM","publisher":"SeekingAlpha","summary":"","url":"https://seekingalpha.com/article/4704196-jpmorgan-chase-stock-likely-fairly-valued-but-well-positioned-keep-gaining-market-share"},{"category":"company","date":1721078280,"headline":"JPMorgan Raises $9 Billion of Bonds in Post-Earnings Spree","id":128704789,"image":"https://media.zenfs.com/en/bloomberg_markets_842/52a44437aa0996338a100cf682f253ad","symbol":"JPM","publisher":"Yahoo","summary":"(Bloomberg) -- JPMorgan Chase \u0026 Co. sold $9 billion of bonds in the US investment-grade market, the first in what’s expected to be a flood of issuance from Wall Street’s six biggest banks.Most Read from BloombergBlackRock Says Gunman From Trump Rally Appeared in Firm’s AdTrump Shooting Changes Biden’s Plan to Revive 2024 CampaignTrump Taps Vance as Running Mate, Picking Populist ProtegeTrump Classified Documents Case Dismissed by Florida JudgeAmazon Sold a Used Diaper. It Tanked a Mom-and-Pop Bu","url":"https://finance.yahoo.com/news/jpmorgan-comes-first-wall-street-153034316.html"},{"category":"company","date":1721077439,"headline":"Goldman Sachs earnings prove bank still very cyclical","id":128702334,"image":"https://s.yimg.com/ny/api/res/1.2/REkSXU1BRZaRRXTHptpYPQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/b95c6fe0-42ed-11ef-9dad-f0a86916b4fa","symbol":"JPM","publisher":"Yahoo","summary":"Among the Big Bank stocks, JPMorgan Chase \u0026 Co. (JPM), Wells Fargo (WFC), Citigroup (C), Goldman Sachs (GS), and BlackRock (BLK) have been the first to report second-quarter results this earnings season. Portales Partners founder and Wall Street Beats partner Charlie Peabody comes on Market Domination to talk about the prevalent themes emerging in bank earnings, such as net interest income figures \"Short term, there's momentum in the capital markets. And so Goldman is a good momentum play, but we argue that their earnings stream remains much more cyclical than the market is valuing them at,\" Peabody states. \"And that's the big debate out there in management as they moved away from their failed consumer banking strategy back to their roots as an investment bank, have been trying to convince the street that there is a core underlying earnings power that's sustainable and stable. And I don't believe them.\" Peabody also looks ahead to the bank earnings due out this week, such as Morgan Stanley (MS): \"I think it's going to be more of the same — strong, investment banking with an eye towards a pick up in M\u0026A and IPOs in the second half of the year. And then trading will be driven more by equity trading and less so by fixed income trading.\" For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Luke Carberry Mogan.","url":"https://finance.yahoo.com/video/goldman-sachs-earnings-prove-bank-210359849.html"},{"category":"company","date":1721076540,"headline":"JPMorganChase Declares Preferred Stock Dividends","id":128704791,"image":"https://media.zenfs.com/en/business-wire.com/9e992557c17afe8637d4b423775e13c5","symbol":"JPM","publisher":"Yahoo","summary":"NEW YORK, July 15, 2024--JPMorgan Chase \u0026 Co. (NYSE: JPM) (\"JPMorganChase\" or the \"Firm\") has declared dividends on the outstanding shares of the Firm’s Series DD, EE, GG, JJ, KK, LL, MM and NN preferred stock. Information can be found on the Firm’s Investor Relations website at https://www.jpmorganchase.com/ir/news.","url":"https://finance.yahoo.com/news/jpmorganchase-declares-preferred-stock-dividends-204900772.html"},{"category":"company","date":1721070996,"headline":"JPMorgan Chase Second Quarter 2024 Earnings: Beats Expectations","id":128704792,"image":"https://media.zenfs.com/en/simply_wall_st__316/78a8c60a6283aea0450523395306d38c","symbol":"JPM","publisher":"Yahoo","summary":"JPMorgan Chase ( NYSE:JPM ) Second Quarter 2024 Results Key Financial Results Revenue: US$47.1b (up 32% from 2Q 2023...","url":"https://finance.yahoo.com/news/jpmorgan-chase-second-quarter-2024-191636359.html"},{"category":"company","date":1721066409,"headline":"Are Big Banks Opening Up Their Pockets For Dividend Investors?","id":128703927,"image":"https://media.zenfs.com/en/Benzinga/1366f27db1cf23838fec8a8b369215f0","symbol":"JPM","publisher":"Yahoo","summary":"We’ve just begun the second quarter earnings season cycle. The earnings season happens four times a year, and it’s always a time for investors and analysts to check in with the companies they follow and invest in. The season is often kicked off by three of the biggest banks: JPMorgan Chase (NYSE:JPM), Citibank (NYSE:C), and Wells Fargo (NYSE:WFC). Their performance can tell us a lot about the state of the economy. There appears to be some promising news for those of us looking for a dividend wit","url":"https://finance.yahoo.com/news/big-banks-opening-pockets-dividend-180009306.html"},{"category":"company","date":1721055787,"headline":"Jamie Dimon, Larry Fink among Wall Street leaders calling for unity following attempted Trump assassination","id":128700073,"image":"https://s.yimg.com/ny/api/res/1.2/SwX88DBQNbnXSS7ExKi1oA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2023-12/e91a9950-94b5-11ee-a2ff-95cc2447f067","symbol":"JPM","publisher":"Yahoo","summary":"Some of the biggest names on Wall Street urged unity and calm following Donald Trump’s assassination attempt.","url":"https://finance.yahoo.com/news/jamie-dimon-larry-fink-among-wall-street-leaders-calling-for-unity-following-attempted-trump-assassination-150307322.html"},{"category":"company","date":1721054820,"headline":"Big Banks Helped by Wall Street Comeback","id":128700074,"image":"https://s.yimg.com/ny/api/res/1.2/YDQqmcu0bkKc3VwFny3oqg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/8c1056d0bac16181daf05b327e85fc39","symbol":"JPM","publisher":"Yahoo","summary":"The dealmaking that  Goldman Sachs  and its peers rely on to power earnings is showing signs of life.  Goldman joined  JPMorgan Chase Citigroup  and  Wells Fargo  in reporting double-digit gains in investment-banking revenue in the second quarter as economic conditions and booming markets turned more favorable.  “From what we’re seeing, we are in the early innings of a capital markets and M\u0026A recovery,” Goldman Chief Executive  David Solomon  said on a call with analysts Monday.","url":"https://finance.yahoo.com/m/28fce43b-2de3-3341-9fe2-ccfbda5e12fc/big-banks-helped-by-wall.html"},{"category":"company","date":1721050209,"headline":"Is It Worth Investing in JPMorgan Chase \u0026 Co. (JPM) Based on Wall Street's Bullish Views?","id":128704796,"image":"https://media.zenfs.com/en/zacks.com/737ffb82e07dc8bffb77e72d153c91f2","symbol":"JPM","publisher":"Yahoo","summary":"Based on the average brokerage recommendation (ABR), JPMorgan Chase \u0026 Co. (JPM) should be added to one's portfolio. Wall Street analysts' overly optimistic recommendations cast doubt on the effectiveness of this highly sought-after metric. So, is the stock worth buying?","url":"https://finance.yahoo.com/news/worth-investing-jpmorgan-chase-co-133009228.html"},{"category":"company","date":1721043043,"headline":"Goldman profits surge 150% from year ago on Wall Street rebound","id":128698642,"image":"https://s.yimg.com/ny/api/res/1.2/WwgSiK.746Di6QlmWHBh9A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDE-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/722cd6c0-429b-11ef-b6ed-4e3b45f3aec2","symbol":"JPM","publisher":"Yahoo","summary":"Goldman Sachs reported that its second-quarter profits soared 150% from a year ago as investment banking surged, the latest signal that Wall Street is warming up after a two-year drought.","url":"https://finance.yahoo.com/news/goldman-profits-surge-150-from-year-ago-on-wall-street-rebound-113043583.html"},{"category":"company","date":1721032200,"headline":"Baby Bonds, Cash Flow, And Portfolio Agnosticism With High Dividend Opportunities","id":128698779,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1445809836/image_1445809836.jpg?io=getty-c-w1536","symbol":"JPM","publisher":"SeekingAlpha","summary":"Scott Kaufman writes under Treading Softly for High Dividend OpportunitiesÂ and talks affording retirement and dividend investing.","url":"https://seekingalpha.com/article/4704023-baby-bonds-cash-flow-and-portfolio-agnosticism-with-high-dividend-opportunities"},{"category":"company","date":1721032115,"headline":"Saudi Wealth Fund Picks JPMorgan, Morgan Stanley for Nupco IPO","id":128699430,"image":"https://s.yimg.com/ny/api/res/1.2/S7_po2XkYTDJXxqM76t29A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_markets_842/ce9b53a313047cb8e0881cbf3d12bc96","symbol":"JPM","publisher":"Yahoo","summary":"(Bloomberg) -- Saudi Arabia’s sovereign wealth fund has picked banks for the planned initial public offering of the kingdom’s largest medical procurement firm, as it hunts for cash to finance the crown prince’s ambitious economic agenda. Most Read from BloombergTrump Shooting Changes Biden’s Plan to Revive 2024 CampaignBlackRock Says Gunman From Trump Rally Appeared in Firm’s AdTrump Emerges Defiant From Rally Attack Set to Shake Up ’24 RaceBold and Bloodied Trump Seizes the Moment After Being S","url":"https://finance.yahoo.com/news/saudi-wealth-fund-picks-jpmorgan-064138113.html"},{"category":"company","date":1721027520,"headline":"GLOBAL BROKER RATINGS: Stifel cuts Lufthansa, Morgan Stanley cuts BP","id":128700421,"image":"","symbol":"JPM","publisher":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=ftc9yenv9z"},{"category":"company","date":1721001540,"headline":"Stock market today: Wall Street rises toward records as its momentum keeps rolling","id":128701332,"image":"","symbol":"JPM","publisher":"Associated Press, The","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=phkv9gz9vx"},{"category":"company","date":1720872000,"headline":"Rate Cuts Could Make Things Worse for Banks Before They Help","id":128677972,"image":"https://s.yimg.com/ny/api/res/1.2/gDdUoiwg0GHc4f5HkMv7uw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/4a35b6cd570644799a156338271d16cf","symbol":"JPM","publisher":"Yahoo","summary":"With the Federal Reserve poised to begin cutting interest rates, lenders could get caught between falling yields and rising deposit costs, especially if loan growth is slow.","url":"https://finance.yahoo.com/m/611d3d1a-0992-368c-bd1a-090e2f2ecadf/rate-cuts-could-make-things.html"},{"category":"company","date":1720868455,"headline":"JPMorgan Chase (NYSE:JPM) shareholders have earned a 16% CAGR over the last five years","id":128677973,"image":"https://media.zenfs.com/en/simply_wall_st__316/393a21695c25a8a00f631cfd22c3f87a","symbol":"JPM","publisher":"Yahoo","summary":"If you buy and hold a stock for many years, you'd hope to be making a profit. Better yet, you'd like to see the share...","url":"https://finance.yahoo.com/news/jpmorgan-chase-nyse-jpm-shareholders-110055805.html"},{"category":"company","date":1720849260,"headline":"Q2 2024 JPMorgan Chase \u0026 Co Earnings Call","id":128675829,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"JPM","publisher":"Yahoo","summary":"Q2 2024 JPMorgan Chase \u0026 Co Earnings Call","url":"https://finance.yahoo.com/news/q2-2024-jpmorgan-chase-co-054100428.html"},{"category":"company","date":1720822500,"headline":"Q2 Earnings Growth Expected to Reach Two-Year High","id":128673484,"image":"https://media.zenfs.com/en/zacks.com/2f6a4cb36bff82376a520fc8a1c89a49","symbol":"JPM","publisher":"Yahoo","summary":"We see the Q2 results from the major banks as good enough - not great, but definitely not bad either. The stocks' outperformance entering this reporting cycle contributed to the market's tentative initial reaction to the results.","url":"https://finance.yahoo.com/news/q2-earnings-growth-expected-reach-221500585.html"},{"category":"company","date":1720820769,"headline":"Goldman's year of the stock picker, bank earnings reaction : Market Domination","id":128673446,"image":"https://s.yimg.com/ny/api/res/1.2/1PgY7kNfn7GuwzCUniUEgg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/23ece8b0-4098-11ef-9955-92d1542ac860","symbol":"JPM","publisher":"Yahoo","summary":"The trading day is just about over, but the market action never ends. Julie Hyman and Josh Lipton take investors through the finally trading hour of Friday, July 12, on this episode of Market Domination.  Barclays analyst Jason Goldberg joins the program to talk about banking industry trends potentially outlined in this morning's second quarter earnings out from JPMorgan Chase \u0026 Co. (JPM), Citigroup (C), and Wells Fargo (WFC). F/m Investments CEO Alex Morris discusses his winners and losers for REITS, or real estate investment trusts, in today's segment of Good Buy or Goodbye. Other top trending tickers on the Yahoo Finance platform include Deckers Outdoor (DECK), EVgo (EVGO), Tesla (TSLA), Royal Caribbean Cruises (RCL), and AT\u0026T (T) and Snowflake (SNOW) after the telecom company divulged the details of major data breach from April. This post was written by Luke Carberry Mogan.","url":"https://finance.yahoo.com/video/goldmans-stock-picker-bank-earnings-214609240.html"},{"category":"company","date":1720815933,"headline":"Slowed loan growth will impact regional banks: Analyst","id":128673486,"image":"https://s.yimg.com/ny/api/res/1.2/P0vFgNabP4MvYZiHGyK9VQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/ccdb2dd0-408c-11ef-bfec-de2ae89e1938","symbol":"JPM","publisher":"Yahoo","summary":"The banking sector is under pressure despite strong second-quarter earnings results from major players JPMorgan Chase \u0026 Co. (JPM), Citigroup (C), and Wells Fargo (WFC), all of which beat analyst estimates. To dissect the financial sector, Barclays analyst Jason Goldberg joins Market Domination. As far as the consumer impact on bank earnings, Goldberg notes that while lower-end consumers continue to face financial pressures, this demographic's struggles may not significantly impact overall bank earnings. \"It's just not a huge contributor to revenues,\" Goldberg explains, though he adds that \"it's certainly something to be mindful of.\" A trend Goldberg identifies in the bank earnings is a strong performance in their trading and investment banking divisions. He predicts that institutions with a focus in these areas, such as Goldman Sachs (GS) and Morgan Stanley (MS), may benefit from this trend in upcoming earnings releases next week. However, Goldberg also points out a potential area of concern: \"loan growth continues to be subdued.\" This trend, he believes, will impact regional banks earnings. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Angel Smith","url":"https://finance.yahoo.com/video/slowed-loan-growth-impact-regional-202533571.html"},{"category":"company","date":1720813618,"headline":"Sector Update: Financial Stocks Rise in Late Afternoon Trading","id":128673487,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"JPM","publisher":"Yahoo","summary":"Sector Update: Financial Stocks Rise in Late Afternoon Trading","url":"https://finance.yahoo.com/news/sector-financial-stocks-rise-afternoon-194658352.html"},{"category":"company","date":1720810834,"headline":"Banks Dissapointed Wall Street With Net Interest Income","id":128671117,"image":"https://media.zenfs.com/en/Benzinga/8704690d263685b58eb2a90032606e7b","symbol":"JPM","publisher":"Yahoo","summary":"The earnings season has been offically kicked off by JP Morgan Chase (NYSE: JPM) that reported earnings and revenue well beyond Wall Street estimates. But other big banks also joined in with their second quarter reports. Wells Fargo \u0026 Company (NYSE: WFC) and Citigroup Inc (NYSE: C) also posted better-than-expected earnings and revenue. But, net interest income fell short of implications and banks showed they are expecting macroeconomic conditions to worsen. Wells Fargo \u0026 Company For the second q","url":"https://finance.yahoo.com/news/banks-dissapointed-wall-street-net-190034624.html"},{"category":"company","date":1720787581,"headline":"JPMorgan Beats Views, Wells Fargo Falls On Forecast, Citi Swings Higher","id":128668665,"image":"https://media.zenfs.com/en/ibd.com/5c80382de54e05ee5fe2ad2d8cef80f0","symbol":"JPM","publisher":"Yahoo","summary":"Dow giant JPMorgan rolled out bank earnings Friday, along with Wells Fargo and Citigroup. JPM stock, Citi are in buy zones. Wells is close.","url":"https://finance.yahoo.com/m/143e51b4-9538-327f-98d9-d934826ab0c8/jpmorgan-beats-views%2C-wells.html"},{"category":"company","date":1720807353,"headline":"Why JP Morgan Chase Stock Is Down Today","id":128671119,"image":"https://g.foolcdn.com/editorial/images/783316/banker-bank-source-getty.jpg","symbol":"JPM","publisher":"Yahoo","summary":"The quarter was fine, but JP Morgan remains cautious about what is to come.","url":"https://www.fool.com/investing/2024/07/12/why-jp-morgan-chase-stock-is-down-today/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;referring_guid=bc7eeba2-0793-40ff-968a-c57231264f99\u0026amp;.tsrc=rss"},{"category":"company","date":1720806991,"headline":"JPMorgan Chase: Building Consistency And Shareholder Trust","id":128672410,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1053526672/image_1053526672.jpg?io=getty-c-w1536","symbol":"JPM","publisher":"SeekingAlpha","summary":"JPMorgan Chase \u0026 Co.'s earnings report fell short, but the stock price is stable. Click for a look at the JPM Q2 earnings results and a look at what lies ahead.","url":"https://seekingalpha.com/article/4703810-jpmorgan-chase-building-consistency-and-shareholder-trust"},{"category":"company","date":1720806981,"headline":"Sector Update: Financial Stocks Higher in Afternoon Trading","id":128671120,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"JPM","publisher":"Yahoo","summary":"Sector Update: Financial Stocks Higher in Afternoon Trading","url":"https://finance.yahoo.com/news/sector-financial-stocks-higher-afternoon-175621275.html"},{"category":"company","date":1720806318,"headline":"JPMorgan Chase (JPM) Q2 2024 Earnings Call Transcript","id":128671121,"image":"https://g.foolcdn.com/editorial/images/1/featured-transcript-logo-template-2023-01-12.jpg","symbol":"JPM","publisher":"Yahoo","summary":"JPM earnings call for the period ending June 30, 2024.","url":"https://www.fool.com/earnings/call-transcripts/2024/07/12/jpmorgan-chase-jpm-q2-2024-earnings-call-transcrip/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;referring_guid=d1966128-0028-49ff-8160-afde43ea7084\u0026amp;.tsrc=rss"},{"category":"company","date":1720804898,"headline":"Big Banks report Q2 earnings, Biden's NATO speech: Morning Brief","id":128671122,"image":"https://s.yimg.com/ny/api/res/1.2/et9OIkNJfNI12Qjma3d0IA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/27ececf0-4073-11ef-bf5b-45d217e3d5c9","symbol":"JPM","publisher":"Yahoo","summary":"Stocks (^DJI, ^IXIC, ^GSPC) are in summer mode this session, hoping to end the second trading week of July on a high note and get to the weekend. Seana Smith and Brad Smith guide investors through the hustle-and-bustle of this busy Friday morning, bringing on top analysts and experts to discuss the biggest market themes and political stories. In this episode of The Morning Brief, major banks JPMorgan Chase \u0026 Co. (JPM), Wells Fargo (WFC), and Citigroup (C) report their second quarter earnings results, officially kicking off earnings season. HSBC head of US financials research Paul Martinez joins the show to discuss the Big Banks' results and what each of their net interest income (NII) is signaling about the industry as a whole. More and more Democratic donors and lawmakers are calling for President Biden to step aside as the assumed party nominee in the 2024 election. Brookings Institution senior fellow in governance studies and Washington Post columnist EJ Dionne Jr. comes onto the program to talk on Biden's foreign policy strengths in his NATO summit speech, which did all but quiet his critics. Other top trending tickers on the Yahoo Finance platform include Tesla (TSLA); Bank of New York Mellon (BK) as it topped second-quarter earnings estimates; and AT\u0026T (T) and Snowflake (SNOW) after the former revealed the scope of its 2022 customer data breach. This post was written by Luke Carberry Mogan.","url":"https://finance.yahoo.com/video/big-banks-report-q2-earnings-172138280.html"},{"category":"company","date":1720803474,"headline":"First Republic ex-employees' lawsuit against US FDIC is dismissed","id":128671985,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"A federal judge in Californiadismissed a lawsuit accusing the Federal Deposit Insurance Corp of improperly blocking nearly 170 former employees of thefailed First Republic Bank from accessing at...","url":"https://finnhub.io/api/news?id=536dcbea5b711a1a3c9e61be1db4477b1b08919b83778c9bc207d9cb0139a995"},{"category":"company","date":1720801401,"headline":"Dealmaking Reignites for Banks Just as Consumers Start to Falter","id":128670765,"image":"https://s.yimg.com/ny/api/res/1.2/WuzgiMb3f45p_YCm9b_ynA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03MTM-/https://media.zenfs.com/en/bloomberg_markets_842/83a9ed72092b9d5b1b9d06f9160db6eb","symbol":"JPM","publisher":"Yahoo","summary":"(Bloomberg) -- The first three US banking giants to report midyear earnings are leaning on a revival in Wall Street dealmaking as high interest rates take a mounting toll on income from lending. Most Read from BloombergBiden Vows to Stay in 2024 Race Even as NATO Gaffes Risk His CampaignBiden’s Putin-Zelenskiy Gaffe Deals Fresh Blow to CampaignJPMorgan Notches Record Profit on Visa Gain, Dealmaking JumpTesla Delays Robotaxi Event in Blow to Musk’s Autonomy DriveFCC Says It’s Investigating Massiv","url":"https://finance.yahoo.com/news/big-bank-dealmaking-reignites-just-162321604.html"},{"category":"company","date":1720801260,"headline":"JPMorgan (JPM) Plans to Grow Consumer Deposit Market Share","id":128671124,"image":"https://media.zenfs.com/en/zacks.com/4d0f5c269de903a3e502f871a8b4461f","symbol":"JPM","publisher":"Yahoo","summary":"JPMorgan (JPM) intends to grow its U.S. consumer deposit market share to 15%. This aligns with the bank's initiatives to maintain its industry-leading position in the upcoming years.","url":"https://finance.yahoo.com/news/jpmorgan-jpm-plans-grow-consumer-162100577.html"},{"category":"company","date":1720801020,"headline":"NEW YORK MARKET CLOSE: Dow and S\u0026P 500 hit new high as rate hopes grow","id":128672976,"image":"","symbol":"JPM","publisher":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3tx64ql0lr"},{"category":"company","date":1720800120,"headline":"Big Banks and Customers Continue to Feel Pressure From Higher Rates","id":128671125,"image":"https://s.yimg.com/ny/api/res/1.2/90cuegbNuW46HzMshQQaMg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/6fe2d91448f6d9dacb2cb3c336e2ff24","symbol":"JPM","publisher":"Yahoo","summary":"JPMorgan and Wells Fargo both reported a drop in quarterly profit, while Citigroup’s profit rose, driven in part by the bank’s cost-cutting measures.","url":"https://finance.yahoo.com/m/b0b3cd5f-d420-3f8f-bc33-252a81ebac65/big-banks-and-customers.html"},{"category":"company","date":1720799654,"headline":"Bank earnings: What net interest income says about growth","id":128670769,"image":"https://s.yimg.com/ny/api/res/1.2/UpulN2T8KK6aSb2Ocst22g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/1563d240-4066-11ef-9fbf-4762d0596f3e","symbol":"JPM","publisher":"Yahoo","summary":"JPMorgan Chase \u0026 Co. (JPM), Wells Fargo (WFC), and Citigroup (C) all reported second-quarter earnings Friday morning, providing a view into the US banking industry based on these companies' varied net interest income (NII) figures. \"The major positive case for a lot of banks is that you're close to seeing a trough in quarterly net interest income, and that in the back end of the year, you're going to start to see some sequential growth,\" HSBC head of US financials research Paul Martinez tells Yahoo Finance, underlining the pressure higher for longer interest rates have placed on bank growth. Martinez reacts to this morning's bank results, comparing the health of these Big Banks' business segments to their net interest income. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief.","url":"https://finance.yahoo.com/video/big-bank-earnings-net-interest-155414876.html"},{"category":"company","date":1720799406,"headline":"A Wall Street revival is carrying big banks as Main Street struggles","id":128670770,"image":"https://s.yimg.com/ny/api/res/1.2/mRaKjs1AmFdFyuNEzE66mA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-03/cc490400-e065-11ee-963d-1d7fb96fc942","symbol":"JPM","publisher":"Yahoo","summary":"A Wall Street revival provided a second-quarter boost to big banks at a time of rising challenges for their Main Street consumer operations.","url":"https://finance.yahoo.com/news/a-wall-street-revival-is-carrying-big-banks-as-main-street-struggles-112142298.html"},{"category":"company","date":1720792377,"headline":"Stocks to Watch Friday: JPMorgan, Wells Fargo, Tesla, SoftBank","id":128669472,"image":"https://media.zenfs.com/en/wsj.com/7b2c285183be07ca3c4e8242b25a59a8","symbol":"JPM","publisher":"Yahoo","summary":"**↘️** **JPMorgan Chase (JPM)**: The bank posted a double-digit jump in quarterly profit, but much of that driven by an exchange of shares in **Visa (V)**. Excluding that and other items, the bank’s profit fell from a year earlier.","url":"https://finance.yahoo.com/m/3859e946-54a8-3ffa-b28c-7199ce825533/stocks-to-watch-friday%3A.html"},{"category":"company","date":1720795043,"headline":"JPMorgan's Earnings Beat Estimates in Q2 as Investment Banking Revenue Surges","id":128670927,"image":"https://www.investopedia.com/thmb/uVf47GbR3t-JFmk3Ux3lqKPsjOQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1529614024-1f59c7b91f7c4bcfa484b7ff12e5d7e5.jpg","symbol":"JPM","publisher":"Yahoo","summary":"JPMorgan Chase reported second-quarter results that surpassed analysts' expectations, thanks to a surge in investment banking revenue on higher fees and a boost from an exchange of the company's Visa shares.","url":"https://www.investopedia.com/jpmorgan-earnings-q2-fy2024-8677055"},{"category":"company","date":1720793954,"headline":"JPMorgan Second-Quarter Results Top Views; Dimon Expects Inflation to Remain Elevated","id":128670928,"image":"https://media.zenfs.com/en/mt_newswires_premium_news_706/cd477204175c1e9e7aa5816f7bae5a65","symbol":"JPM","publisher":"Yahoo","summary":"JPMorgan Second-Quarter Results Top Views; Dimon Expects Inflation to Remain Elevated","url":"https://finance.yahoo.com/news/jpmorgan-second-quarter-results-top-141914985.html"},{"category":"company","date":1720793204,"headline":"JPMorgan posts Q2 earnings, revenue beat","id":128671131,"image":"https://s.yimg.com/ny/api/res/1.2/PO_K9D8Xnvr5qoEWs9TQLA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/7075c960-4055-11ef-abbf-53d4f6dcca64","symbol":"JPM","publisher":"Yahoo","summary":"JPMorgan Chase (JPM) reported second quarter results, beating analysts' expectations on both the top and bottom lines. The financial giant posted revenue of $50.99 billion, topping the estimated $50.21 billion. JPMorgan also delivered an adjusted earnings per share (EPS) of $4.40 for the quarter, outperforming the projected $4.28. The bank's results got a boost from an exchange of shares in Visa (V). Additionally, JPMorgan's net interest income rose by 4% year-over-year. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Angel Smith","url":"https://finance.yahoo.com/video/jpmorgan-posts-q2-earnings-revenue-140644993.html"},{"category":"company","date":1720793160,"headline":"JPMorgan's (JPM) Q2 Earnings Top Estimates on Solid IB, Trading","id":128671132,"image":"https://media.zenfs.com/en/zacks.com/4d0f5c269de903a3e502f871a8b4461f","symbol":"JPM","publisher":"Yahoo","summary":"High rates, robust loan balance, a rise in mortgage banking income and solid IB and trading businesses aid JPMorgan's (JPM) Q2 earnings. High credit costs and non-interest expenses are headwinds.","url":"https://finance.yahoo.com/news/jpmorgans-jpm-q2-earnings-top-140600075.html"},{"category":"company","date":1720791006,"headline":"JPMorgan Chase \u0026 Co. (JPM) Reports Q2 Earnings: What Key Metrics Have to Say","id":128671133,"image":"https://media.zenfs.com/en/zacks.com/d0d4ab152198da2f423d92da8a7d22ee","symbol":"JPM","publisher":"Yahoo","summary":"The headline numbers for JPMorgan Chase \u0026 Co. (JPM) give insight into how the company performed in the quarter ended June 2024, but it may be worthwhile to compare some of its key metrics to Wall Street estimates and the year-ago actuals.","url":"https://finance.yahoo.com/news/jpmorgan-chase-co-jpm-reports-133006329.html"},{"category":"company","date":1720790377,"headline":"Bank earnings, June PPI, Biden news conference: 3 Things","id":128670781,"image":"https://s.yimg.com/ny/api/res/1.2/Gu67vDF1xaiJdB0q2tjmrg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/272c7b90-4051-11ef-bf7f-ebfd0a6453ff","symbol":"JPM","publisher":"Yahoo","summary":"Major banks JPMorgan Chase \u0026 Co. (JPM), Wells Fargo (WFC), and Citigroup (C) reported second quarter earnings this morning, offering a mixed picture of the banking landscape tied to these institutions' net interest income.  The Producer Price Index (PPI) saw inflation rise for domestic producers in the month of June, outpacing estimates and increasing 0.2% month over month and 2.6% year over year. President Biden hosted a solo news conference last night following the NATO summit held in Washington, DC this year, stating that he is the \"most qualified person\" to run for president against Trump. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Luke Carberry Mogan.","url":"https://finance.yahoo.com/video/bank-earnings-june-ppi-biden-131937798.html"},{"category":"company","date":1720789363,"headline":"Wells Fargo cites customer movement as net interest income drops","id":128671135,"image":"https://www.bankingdive.com/imgproxy/L0LGBSBojyYeo30uUiIGkcgAhdT5VpvqVdQm9xfR8Uk/g:ce/rs:fit:770:435/bG9jYWw6Ly8vZGl2ZWltYWdlL0dldHR5SW1hZ2VzLTEyNDM0MjUzNTEuanBn.webp","symbol":"JPM","publisher":"Yahoo","summary":"The bank looked for a boost from higher fees in investment banking as it aims to reduce its reliance on net interest income.","url":"https://www.bankingdive.com/news/wells-fargo-net-interest-income-customer-movement-deposit-balance-higher-yield-scharf-santomassimo/721255/"},{"category":"company","date":1720788180,"headline":"Investment-Banking Fees Jump at JPM, Citi, Wells Fargo","id":128671136,"image":"https://media.zenfs.com/en/wsj.com/7b2c285183be07ca3c4e8242b25a59a8","symbol":"JPM","publisher":"Yahoo","summary":"Investment-banking activity is roaring back from the lull created when the Federal Reserve began hiking interest rates in 2022.  JPMorgan Chase reported $2.5 billion in investment-banking revenue for the second quarter, a 46% increase from a year ago and up from $2 billion last quarter.  Citigroup's investment-banking revenue was up 60% from a year ago to $853 million, though it slipped 8% from the first quarter of this year.","url":"https://finance.yahoo.com/m/0ccb6096-b92d-3fe4-9b4f-dba1b100f19d/investment-banking-fees-jump.html"},{"category":"company","date":1720787605,"headline":"Dow hits record high, small caps jump on rate-cut bets; bank results mixed","id":128669916,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"* JPMorgan, Citi, Wells Fargo drop after results ...","url":"https://finnhub.io/api/news?id=c3955a2a4074504f2943cc7f9695648e78cccdb7c5351d3335a9752acac5229e"},{"category":"company","date":1720785378,"headline":"Fed cut optimism sends stocks higher","id":128669671,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"US interest rate optimism supported equities in Europe on Friday, with a hotter-than-expected producer price index reading and some poorly-received US banking earnings doing little to deter investor...","url":"https://finnhub.io/api/news?id=3eae8c7ae8197dd356c545050bb409813f7886ce4e48d27a1b9b64383996d50a"},{"category":"company","date":1720785240,"headline":"LONDON MARKET CLOSE: Fed cut optimism sends stocks higher","id":128670086,"image":"","symbol":"JPM","publisher":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=y72j5w2q7y"},{"category":"company","date":1720784827,"headline":"JPMorgan Chase \u0026 Co. (JPM) Q2 2024 Earnings Call Transcript","id":128669687,"image":"https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png","symbol":"JPM","publisher":"SeekingAlpha","summary":"JPMorgan Chase \u0026amp; Co. (NYSE:NYSE:JPM) Q2 2024 Earnings Conference Call July 12, 2024 8:30 AM ETCompany ParticipantsJeremy Barnum - CFOConference Call...","url":"https://seekingalpha.com/article/4703766-jpmorgan-chase-and-co-jpm-q2-2024-earnings-call-transcript"},{"category":"company","date":1720782793,"headline":"Chase and Marriott Bonvoy Introduce the Newly Enhanced Marriott Bonvoy Bold Credit Card","id":128669386,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"Release date -11072024WILMINGTON, DEL. / BETHESDA, MD -Cardmembers enjoy new travel benefits and earn more points on everyday spend categories, with no annual fee; Best welcome offer ever now...","url":"https://finnhub.io/api/news?id=3badfd99e426282ac2b44e8b6853bb3a316208663718c9d54e05130a5ccda836"},{"category":"company","date":1720781280,"headline":"IN THE KNOW: NII miss hurts Wells Fargo while JPMorgan beats forecasts","id":128671935,"image":"","symbol":"JPM","publisher":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=nmm08h4c8r"},{"category":"company","date":1720780209,"headline":"JPMorgan Chase : JPMC\u0026Co Form 8-K dated July 12, 2024 (2Q2024 presentation)","id":128669230,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"UNITED STATES SECURITIES AND EXCHANGE COMMISSION Washington, D.C. 20549 FORM 8-K CURRENT REPORT ...","url":"https://finnhub.io/api/news?id=a209274b3f616c4e6d404a90881e7996c7812c8047fa625ccc49838e0c7c42c5"},{"category":"company","date":1720773861,"headline":"JPMorgan Chase \u0026 Co. 2024 Q2 - Results - Earnings Call Presentation","id":128668687,"image":"https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png","symbol":"JPM","publisher":"SeekingAlpha","summary":"The following slide deck was published by JPMorgan Chase \u0026amp; Co.","url":"https://seekingalpha.com/article/4703717-jpmorgan-chase-and-co-2024-q2-results-earnings-call-presentation"},{"category":"company","date":1720773109,"headline":"Traders head to Main Street as rate cut hopes boost small caps","id":128668578,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"Global stocks drifted onFriday, masking a strong rotation on Wall Street out of big techstocks and into small companies expected to benefit from ratecuts, while strong signals that Japan had...","url":"https://finnhub.io/api/news?id=378f0b1d0b59c66da59c3b3c78ae728acbe8c6be4eae568719ce3be202ceed19"},{"category":"company","date":1720771340,"headline":"Citi profit climbs on investment banking surge, services strength","id":128668369,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"Citigroup's profit rose in thesecond quarter, boosted by a 60% jump in investment bankingrevenue and gains in its services division. Net income climbed to $3.2 billion, or $1.52 per...","url":"https://finnhub.io/api/news?id=9414bdaa27f62169fe6ac7052b019094a0e25f0f4336985143cda0f05b3ea5a7"},{"category":"company","date":1720768800,"headline":"TOP NEWS: JPMorgan Chase revenue climbs as investment bank fees jump","id":128672983,"image":"","symbol":"JPM","publisher":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=gfftfnnv5m"},{"category":"company","date":1720768752,"headline":"JPMorgan Chase : JPMC\u0026Co Form 8-K 2Q2024 earnings release (12 July 2024)","id":128668146,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"UNITED STATES SECURITIES AND EXCHANGE COMMISSION Washington, D.C. 20549 FORM 8-K CURRENT REPORT ...","url":"https://finnhub.io/"},{"category":"company","date":1720768391,"headline":"JPMorgan Chase Q2 profit jumps sharply as bank cashes in Visa shares. Higher interest rates also boost results","id":128668129,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"NEW YORK — JPMorgan Chase Q2 profit jumps sharply as bank cashes in Visa shares. Higher interest rates also boost results. Copyright 2024 The Associated Press. All rights reserved. This material...","url":"https://finnhub.io/api/news?id=775d5edbb2c8f61a75956df7a17303e3f521bc36abbd16915b98de0b2fc45dac"},{"category":"company","date":1720768150,"headline":"JPMorgan Chase : 2Q24 Earnings Press Release","id":128668089,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"JPMorgan Chase \u0026 Co. 383 Madison Avenue, New York, NY 10179-0001 NYSE symbol: JPM www.jpmorganchase.com JPMORGAN CHASE REPORTS SECOND-QUARTER...","url":"https://finnhub.io/"},{"category":"company","date":1720767366,"headline":"JPMorgan Chase Reports Second-Quarter 2024 Financial Results","id":128668017,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"JPMorgan Chase \u0026 Co. has released its second-quarter 2024 financial results. Results can be found at the Firm’s Investor Relations website at jpmorganchase.com/ir/quarterly-earnings.JPMorgan...","url":"https://finnhub.io/api/news?id=d3cdc6b36a8aacb3fa8400064caa9946d559849307e82fcea09cadf708a4bf39"},{"category":"company","date":1720767120,"headline":"LONDON MARKET MIDDAY: FTSE 100 up ahead of US PPI data and US earnings","id":128670668,"image":"","symbol":"JPM","publisher":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=z5xqu4x3x6"},{"category":"company","date":1720766916,"headline":"JPMorgan profit jumps on investment banking fees, accounting gain","id":128668005,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"July 12 - JPMorgan Chase's profit rose in the second quarter,buoyed by rising investment banking fees and an $8 billionaccounting gain from a share exchange deal with...","url":"https://finnhub.io/api/news?id=eb273880ce1818b4227d61f8ba2ebe71281ab5a364fc6486ff84bbd46627a059"},{"category":"company","date":1720762001,"headline":"Futures stall as big banks set to kick earnings into high gear","id":128667639,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"Futures tied to the S\u0026P 500 and theNasdaq 100 indexes paused near record levels on Friday ahead ofresults from JPMorgan, Citigroup and Wells Fargo that will throwsecond-quarter earnings season into...","url":"https://finnhub.io/api/news?id=c30ff93680e98826509de4a1819bbaa8ae011917984528432b9db5a85bd51c73"},{"category":"company","date":1720758240,"headline":"Stock market today: Wall Street rolls to the edge of records as hopes remain for cuts to rates","id":128672978,"image":"","symbol":"JPM","publisher":"Associated Press, The","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=03tp72y7ia"},{"category":"company","date":1720755600,"headline":"Q2 2024 Earnings Season Preview - The S\u0026P 500 Breaks Records Ahead Of Bank Reports","id":128666333,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/172734752/image_172734752.jpg?io=getty-c-w1536","symbol":"JPM","publisher":"SeekingAlpha","summary":"Important earnings season ahead as investors look for signs that we are still in soft landing territory","url":"https://seekingalpha.com/article/4703662-q2-2024-earnings-season-preview-s-and-p-500-breaks-records-ahead-of-bank-reports"},{"category":"company","date":1720752600,"headline":"LONDON BRIEFING: FTSE 100 called up ahead of US PPI reading","id":128670680,"image":"","symbol":"JPM","publisher":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=gckj1i1rs8"},{"category":"company","date":1720744800,"headline":"GLOBAL BRIEFING: Stocks rise as US Fed keeps up inflation hopes","id":128670690,"image":"","symbol":"JPM","publisher":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=uowruo4tsc"},{"category":"company","date":1720733649,"headline":"Bank earnings, June PPI, Biden conference: What to Watch","id":128658832,"image":"https://s.yimg.com/ny/api/res/1.2/jLWTxz3anp.6zG5PhdauCg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/61ba1330-3fc0-11ef-bef6-c1ca7fa8d580","symbol":"JPM","publisher":"Yahoo","summary":"Big Banks will release their latest quarterly earnings including : JPMorgan Chase \u0026 Co. (JPM), Wells Fargo (WFC), Citigroup, (C) and the Bank of New York Mellon (BK). Economic data in the form of the Producers Price Index (PPI) for June and Consumer Sentiment will be released on Friday morning, with both PPI and core PPI expected to rise slightly compared to May. US President Joe Biden will host a solo news conference at 6:30 p.m. ET as he wraps up the NATO summit in Washington, DC. For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. This post was written by Nicholas Jacobino","url":"https://finance.yahoo.com/video/bank-earnings-june-ppi-biden-213409671.html"},{"category":"company","date":1720733400,"headline":"Should Investors Buy JPMorgan or Citigroup's Stock as Q2 Earnings Approach?","id":128658833,"image":"https://media.zenfs.com/en/zacks.com/6f2cab89bf2cbad1966358e04258e202","symbol":"JPM","publisher":"Yahoo","summary":"Let's see if now is a good time to buy JPMorgan (JPM) or Citigroup's (C) stock as their much-anticipated Q2 results approach on Friday, July 12.","url":"https://finance.yahoo.com/news/investors-buy-jpmorgan-citigroups-stock-213000923.html"},{"category":"company","date":1720714261,"headline":"JPMorgan, Citigroup In Buy Zone With Bank Earnings On Tap","id":128654881,"image":"https://media.zenfs.com/en/ibd.com/5c80382de54e05ee5fe2ad2d8cef80f0","symbol":"JPM","publisher":"Yahoo","summary":"Dow giant JPMorgan reports Friday, along with Wells Fargo and Citigroup. JPM stock and Citi are in buy zones. Wells is close.","url":"https://finance.yahoo.com/m/143e51b4-9538-327f-98d9-d934826ab0c8/jpmorgan%2C-citigroup-in-buy.html"},{"category":"company","date":1720724381,"headline":"Oil Rises as US Summer Demand Signs Counter Downbeat IEA View","id":128658835,"image":"https://s.yimg.com/ny/api/res/1.2/cp5VJ3_75QTEfLII0.M0oA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTk-/https://media.zenfs.com/en/bloomberg_markets_842/2e51653c8cd54c8e02b1c461b595ed83","symbol":"JPM","publisher":"Yahoo","summary":"(Bloomberg) -- Oil edged higher as traders weighed the International Energy Agency’s estimate that demand growth is slowing against a US government report showing signs of strengthening fuel consumption after the Fourth of July holiday.Most Read from BloombergTesla Delays Robotaxi Event in Blow to Musk’s Autonomy DriveSaudis Warned G-7 Over Russia Seizures With Debt Sale ThreatBiden Suffers More Blows Ahead of Crucial News ConferenceStock Rotation Hits Megacaps on Bets Fed Will Cut: Markets Wrap","url":"https://finance.yahoo.com/news/oil-extends-advance-decline-us-232854314.html"},{"category":"company","date":1720720238,"headline":"Sector Update: Financial Stocks Gain Thursday Afternoon","id":128655240,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"JPM","publisher":"Yahoo","summary":"Sector Update: Financial Stocks Gain Thursday Afternoon","url":"https://finance.yahoo.com/news/sector-financial-stocks-gain-thursday-175038575.html"},{"category":"company","date":1720718751,"headline":"Treasuries Rally as Cool Inflation Boosts Bets on Three Fed Cuts","id":128658837,"image":"https://s.yimg.com/ny/api/res/1.2/0JDN2BwgFRyz4lNdef.mLQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03MzA-/https://media.zenfs.com/en/bloomberg_markets_842/30da029efcf5955786a269a4dd178c44","symbol":"JPM","publisher":"Yahoo","summary":"(Bloomberg) -- Treasury yields tumbled after benign inflation data renewed confidence that the Federal Reserve will cut interest rates at least twice this year.Most Read from BloombergTesla Delays Robotaxi Event in Blow to Musk’s Autonomy DriveSaudis Warned G-7 Over Russia Seizures With Debt Sale ThreatBiden Suffers More Blows Ahead of Crucial News ConferenceStock Rotation Hits Megacaps on Bets Fed Will Cut: Markets WrapSaudi Prince’s Trillion-Dollar Makeover Faces Funding CutbacksMost rates sli","url":"https://finance.yahoo.com/news/treasury-yields-tumble-june-cpi-123754893.html"},{"category":"company","date":1720714500,"headline":"NEW YORK MARKET CLOSE: Tech sell-off overshadows cooler US data","id":128657255,"image":"","symbol":"JPM","publisher":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=75dp1opmzc"},{"category":"company","date":1720706400,"headline":"J.P. Morgan Life Sciences Private Capital Hires Joseph Siletto to Target Investments in Healthcare Transformation","id":128658838,"image":"https://media.zenfs.com/en/prnewswire.com/4f95085493fdd9e657beefbb69a18df6","symbol":"JPM","publisher":"Yahoo","summary":"J.P. Morgan Private Capital, a venture and growth equity investment team within J.P. Morgan Asset Management Alternatives, today announced its next phase of growth with the hiring of industry veteran Joseph Siletto as a new Managing Partner alongside Anya Schiess and Gaurav Gupta, M.D., M.S.E, reporting to Stephen Squinto, Ph.D. The expanded team will look to invest in Series B through pre-IPO stage healthcare companies, specifically within the biotechnology, medical devices, health technology a","url":"https://finance.yahoo.com/news/j-p-morgan-life-sciences-140000788.html"},{"category":"company","date":1720704240,"headline":"Should You Buy JPM, C \u0026 Other Big Bank Stocks Before Q2 Earnings?","id":128654188,"image":"https://media.zenfs.com/en/zacks.com/37c138780027de5b59d45f46df5ef3be","symbol":"JPM","publisher":"Yahoo","summary":"The Q2 earnings outlook for JPM, C, BAC and WFC has been improving lately as underlying business trends have improved. Should investors buy these big bank stocks now or wait for a better entry point?","url":"https://finance.yahoo.com/news/buy-jpm-c-other-big-132400330.html"},{"category":"company","date":1720702800,"headline":"Chase and Marriott Bonvoy® Introduce the Newly Enhanced Marriott Bonvoy Bold® Credit Card","id":128658840,"image":"https://media.zenfs.com/en/business-wire.com/b846faa120d928b6a9d7873c0ee9ae4b","symbol":"JPM","publisher":"Yahoo","summary":"WILMINGTON, Del. \u0026 BETHESDA, Md., July 11, 2024--Chase, the largest co-brand card issuer in the U.S., and Marriott Bonvoy®, Marriott International’s award-winning travel program and marketplace, today announced new and enhanced benefits on the Marriott Bonvoy Bold® Credit Card. Cardmembers now earn more Marriott Bonvoy points toward free stays and Marriott Bonvoy Moments experiences on a variety of popular everyday spend categories, and have access to an exciting new Travel Now, Pay Later benefi","url":"https://finance.yahoo.com/news/chase-marriott-bonvoy-introduce-newly-130000744.html"},{"category":"company","date":1720702508,"headline":"Senators press Jamie Dimon on alleged climate turnabout","id":128658841,"image":"https://www.bankingdive.com/imgproxy/zDKFX_XdUEi9eQS7cstqBfOqjp1WPebHz86blqNmARo/g:ce/rs:fit:770:435/bG9jYWw6Ly8vZGl2ZWltYWdlL0dldHR5SW1hZ2VzLTExMzYxNTM2MzQuanBn.webp","symbol":"JPM","publisher":"Yahoo","summary":"The lawmakers, including Sen. Elizabeth Warren, D-MA, demanded answers from the JPMorgan Chase CEO on the bank's environmental \"commitments\" and \"aspirations.\"","url":"https://www.bankingdive.com/news/jamie-dimon-jpmorgan-climate-about-face-fossil-fuel-warren-sanders/721123/"},{"category":"company","date":1720701307,"headline":"How To Earn $500 A Month From JPMorgan Chase Stock Ahead Of Q2 Earnings Report","id":128658842,"image":"https://media.zenfs.com/en/Benzinga/0a587fdf96352d17a361f9288077a033","symbol":"JPM","publisher":"Yahoo","summary":"JPMorgan Chase \u0026 Co. (NYSE:JPM) will release its second-quarter financial results, before the opening bell on Friday, July 12. Analysts expect the New York-based company to report quarterly earnings at $4.15 per share, down from $4.75 per share in the year-ago period. JPMorgan expects revenue of $42.03 billion, compared to $42.4 billion a year earlier, according to data from Benzinga Pro. On July 9, Keefe, Bruyette \u0026 Woods analyst David Konrad maintained JPMorgan Chase with a Market Perform rati","url":"https://finance.yahoo.com/news/earn-500-month-jpmorgan-chase-123507526.html"},{"category":"company","date":1720694017,"headline":"JPMorgan aims to amass 15% of US consumer deposits, boost credit card share","id":128658843,"image":"https://media.zenfs.com/en/reuters.com/e447f7bd833115f71834ba21c0ec2004","symbol":"JPM","publisher":"Yahoo","summary":"The biggest U.S. bank wants to get even bigger.  JPMorgan Chase has set an ambitious goal of attracting 15% of the country's consumer deposits, Marianne Lake, its CEO of consumer and community banking, told Reuters in an interview at the company's New York headquarters.  The lender also wants to provide credit cards that account for 20% of the nation's spending, expanding from a current 17%.","url":"https://ca.finance.yahoo.com/news/jpmorgan-aims-amass-15-us-103337868.html"},{"category":"company","date":1720693205,"headline":"Should JPMorgan Diversified Return U.S. Equity ETF (JPUS) Be on Your Investing Radar?","id":128658844,"image":"https://media.zenfs.com/en/zacks.com/26a86d59f0e8f1e82a35a92ae5684cd9","symbol":"JPM","publisher":"Yahoo","summary":"Style Box ETF report for JPUS","url":"https://finance.yahoo.com/news/jpmorgan-diversified-return-u-equity-102005697.html"},{"category":"company","date":1720685700,"headline":"Microsoft and Apple Are Rock-Solid Dow Dividend Stocks, but So Are These 3 Blue Chip Stocks That Paid a Combined $29 Billion in Dividends Over the Last Year","id":128653368,"image":"https://g.foolcdn.com/editorial/images/782730/gettyimages-1491890797-1200x800-5b2df79-1.jpg","symbol":"JPM","publisher":"Yahoo","summary":"It's easy to overlook the benefits of dividend stocks when the S\u0026P 500 is soaring to new heights.","url":"https://www.fool.com/investing/2024/07/11/microsoft-apple-rock-solid-dow-dividend-stock-buy/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;referring_guid=f1686d08-c72a-4569-ba91-5d340da84962\u0026amp;.tsrc=rss"},{"category":"company","date":1720663276,"headline":"Notification of major holding in Kindred Group plc","id":128650138,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"Kindred Group plc hereby announces that it, on 10 July 2024, has received a notification of major holding from JPMorgan Chase \u0026 Co, a company with its registered office in Wilmington, Delaware, USA....","url":"https://finnhub.io/api/news?id=11f97a16c71bd727441a85dd76906013e2b138af5e2f2ae832cdab3bb5253136"},{"category":"company","date":1720651800,"headline":"Earnings Season Gets Underway: Bank Earnings in Focus","id":128658846,"image":"https://media.zenfs.com/en/zacks.com/4d0f5c269de903a3e502f871a8b4461f","symbol":"JPM","publisher":"Yahoo","summary":"The earnings outlook for the major banks has been improving lately as underlying business trends have stabilized. But what can investors expect?","url":"https://finance.yahoo.com/news/earnings-season-gets-underway-bank-225000134.html"},{"category":"company","date":1720647381,"headline":"Saudi Aramco Sells $6 Billion of Bonds Amid Fierce Demand","id":128654562,"image":"https://s.yimg.com/ny/api/res/1.2/oPfISIgpjfvxAksufnfp_g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_markets_842/1b1c0dbb354e41c9e0c59f5ff4c1a3b3","symbol":"JPM","publisher":"Yahoo","summary":"(Bloomberg) -- Saudi Aramco pulled in more than $31 billion of orders for its $6 billion bond sale, its first dollar-debt offering in three years.Most Read from BloombergSaudis Warned G-7 Over Russia Seizures With Debt Sale ThreatArchegos’ Bill Hwang Convicted of Fraud, Market ManipulationBiden Aides to Meet Senators After Pelosi Remarks Deal BlowNATO Singles Out China Over Its Support for Russia in UkraineDistressed Property Buyers Seek Out ‘Exceptional Bargains’Bids peaked above $11 billion fo","url":"https://finance.yahoo.com/news/saudi-aramco-kicks-off-first-080218892.html"},{"category":"company","date":1720633500,"headline":"MORNING BID ASIA-US inflation report to set the tone","id":128649906,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"A look at the day ahead in Asianmarkets. Thursday's U.S. inflation report could test markets, withconsensus coalescing around the first Federal Reserve rate cutof this cycle in...","url":"https://finnhub.io/api/news?id=80aa2d1a38f40abc2e293ae74c6d3b2a9a5b27d323365366c3d26ecd8c73b484"},{"category":"company","date":1720630620,"headline":"Government fines Citigroup $136 million for failing to fix longstanding internal control issues","id":128656438,"image":"","symbol":"JPM","publisher":"Associated Press, The","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=2l6bf3wdse"},{"category":"company","date":1720628504,"headline":"Big Tech in focus as Q2 earnings season kicks off this week","id":128654885,"image":"https://s.yimg.com/ny/api/res/1.2/2NXmJEre9cO5iY4A.UI4WQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/93add7c0-3ed3-11ef-94a4-8287cbb494ce","symbol":"JPM","publisher":"Yahoo","summary":"The second quarter earnings season is set to kick off this Thursday with industry leaders such as Delta Air Lines (DAL) and PepsiCo (PEP) offering insights into the transportation and consumer goods sectors. The financial sector will take center stage on Friday, with banking giants JPMorgan Chase (JPM) and Wells Fargo (WFC) scheduled to unveil their quarterly results. As the earnings season unfolds, investors are particularly focused on what these reports might reveal about market concentration concerns. Of special interest is the performance of the Magnificent Seven stocks — the grouping of major tech companies — that have disproportionately driven market gains (^DJI, ^IXIC, ^GSPC) in recent months. Catalysts anchors Seana Smith and Madison Mills break down the details. For more expert insight and the latest market action, click here to watch this full episode of Catalysts. This post was written by Angel Smith","url":"https://finance.yahoo.com/video/big-tech-focus-q2-earnings-162144050.html"},{"category":"company","date":1720620720,"headline":"5 Stocks Worth a Look From Leading Sectors This Earnings Season","id":128654550,"image":"https://media.zenfs.com/en/zacks.com/5c4eef64cb3687ce10b8a919a298b51f","symbol":"JPM","publisher":"Yahoo","summary":"Apple (AAPL), HCA Healthcare (HCA), Expro International (XPRO), Churchill Downs (CHDN) and JPMorgan Chase (JPM) could make great plays as the second-quarter earnings season unfolds.","url":"https://finance.yahoo.com/news/5-stocks-worth-look-leading-141200714.html"},{"category":"company","date":1720608154,"headline":"A big bank rally is about to be put to the test","id":128654886,"image":"https://s.yimg.com/ny/api/res/1.2/XIUUKN05pJChx5ZE7Emn7w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02OTM-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/d3872f40-3ea6-11ef-9ffe-a9c6b149686b","symbol":"JPM","publisher":"Yahoo","summary":"The stocks of big banks are outperforming the rest of the S\u0026P 500 this year, and that investor confidence will be tested as second-quarter earnings are released Friday.","url":"https://finance.yahoo.com/news/a-big-bank-rally-is-about-to-be-put-to-the-test-104234340.html"},{"category":"company","date":1720602000,"headline":"This Bank Stock Beat the S\u0026P 500 in the First Half of 2024. Is It Still a Buy?","id":128648172,"image":"https://g.foolcdn.com/editorial/images/782815/bank-manager-counting-cash.jpg","symbol":"JPM","publisher":"Yahoo","summary":"There's a reason the country's single biggest banking name is holding up against a headwind.","url":"https://www.fool.com/investing/2024/07/10/this-bank-stock-beat-the-sp-500-in-the-first-half/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;referring_guid=7dc5c401-4137-415c-a5c7-9ff7a2f63cb1\u0026amp;.tsrc=rss"},{"category":"company","date":1720595280,"headline":"LONDON MARKET MIDDAY: European stocks recover on US rate hopes","id":128655224,"image":"","symbol":"JPM","publisher":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=hxybb72acq"},{"category":"company","date":1720579560,"headline":"LONDON BRIEFING: Barratt predicts profit beat; Direct Line payout plan","id":128657274,"image":"","symbol":"JPM","publisher":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=1nglcpfbwo"},{"category":"company","date":1720579140,"headline":"Stock market today: Asian shares zoom higher, with Nikkei over 42,000 after Wall St sets new records","id":128654043,"image":"","symbol":"JPM","publisher":"Associated Press, The","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=jowf0pcro6"},{"category":"company","date":1720574475,"headline":"It's that time again. US ...","id":128645478,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"£It's that time again. US earnings season kicks off this Friday with results due from some of Wall Street's biggest lenders - JP Morgan, Wells Fargo and Citigroup. All three stocks have performed...","url":"https://finnhub.io/api/news?id=2d979ef4786f4b293d99475a67948201862aab1098aaf14f296f1da88a6379b6"},{"category":"company","date":1720561849,"headline":"Chipotle, S\u0026P record close, Big Bank earnings preview: Market Domination Overtime","id":128642468,"image":"https://s.yimg.com/ny/api/res/1.2/CApM0dB9tbUErn6nU73bPw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/5ca139f0-3e3a-11ef-a96f-099acf0cdb66","symbol":"JPM","publisher":"Yahoo","summary":"In today's episode of Market Domination Overtime, co-hosts Josh Lipton and Julie Hyman delve into three key topics: Chipotle Mexican Grill's (CMG) executive transition, record-breaking index performance, and a preview of upcoming Big Bank earnings. The show begins with an analysis of Chipotle's stock reaction following longtime CFO Jack Hartung's plans to retire in 2025. This news triggered a sell-off in the company's shares. Shifting focus to broader market trends, the hosts examine the S\u0026P 500's (^GSPC) performance, highlighting its 36th record close on Tuesday.  To round out the episode, reporter David Hollerith joins the conversation, offering insights on what investors can expect from upcoming earnings out from major banks this Friday. This post was written by Angel Smith","url":"https://finance.yahoo.com/video/chipotle-p-record-close-big-215049533.html"},{"category":"company","date":1720558647,"headline":"Bank earnings start this week: What Wall Street is watching","id":128641380,"image":"https://s.yimg.com/ny/api/res/1.2/n9IsectKXLPCeMxjfIjPLw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/33e03d50-3e34-11ef-9f7f-5e09250f3e8f","symbol":"JPM","publisher":"Yahoo","summary":"The banking sector is set to take center stage as the second quarter earnings season kicks off this Friday. Banking giants JPMorgan Chase (JPM), Wells Fargo (WFC), and Citigroup (C) are slated to release their earnings results, with investors closely watching to gauge the financial health of the US economy. Yahoo Finance reporter David Hollerith takes a closer look at what investors and analysts will be watching. For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. This post was written by Angel Smith","url":"https://finance.yahoo.com/video/bank-earnings-start-week-wall-205727994.html"},{"category":"company","date":1720543080,"headline":"Q2 Earnings Season Kicks Off with These 5 Key Charts","id":128640173,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"JPM","publisher":"Yahoo","summary":"It's not all about the banks this week. Be sure to watch the consumer-focused companies.","url":"https://finance.yahoo.com/news/q2-earnings-season-kicks-off-163800232.html"},{"category":"company","date":1720541820,"headline":"NEW YORK MARKET CLOSE: Stocks steady as Powell fails to rock the boat","id":128640668,"image":"","symbol":"JPM","publisher":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=o7jg0vf3ha"},{"category":"company","date":1720538132,"headline":"JPMorgan’s Trading Desk Warns S\u0026P 500 Will Turn Volatile on CPI","id":128636423,"image":"https://s.yimg.com/ny/api/res/1.2/s5MTX2XMJh0YLs6.SLymig--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD01NzY-/https://media.zenfs.com/en/bloomberg_markets_842/5ccc38870e7b88daf1410053d6d27d5c","symbol":"JPM","publisher":"Yahoo","summary":"(Bloomberg) -- Investors should brace themselves for a bout of stock market volatility this week after a lengthy period of calm, based on a warning from JPMorgan Chase \u0026 Co.’s trading desk.Most Read from BloombergMicrosoft Orders China Staff to Use iPhones for Work and Drop AndroidBiden’s Biggest Donors Left Powerless to Sway Him to End BidSaudis Warned G-7 Against Russia Seizures With Debt Sale ThreatZyn Imitators Rush In as Online Sales Halt Worsens US ShortageRich Chinese Return to Hong Kong","url":"https://finance.yahoo.com/news/jpmorgan-trading-desk-warns-p-151532569.html"},{"category":"company","date":1720534044,"headline":"Why Is JPMorgan Chase \u0026 Co. (JPM) the Best Blue Chip Dividend Stock to Buy Now?","id":128636424,"image":"https://s.yimg.com/ny/api/res/1.2/0BwlrHHssSozZHQNtMcVwA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/f82652d0e7c350dea8b9d7c85e94e30e","symbol":"JPM","publisher":"Yahoo","summary":"We recently compiled a list of the 10 Best Blue Chip Dividend Stocks To Buy. In this article, we are going to take a look at where JPMorgan Chase \u0026 Co. (NYSE:JPM) stands against the other blue chip dividend stocks. When it comes to investing in stocks, investors often keep a close eye on the […]","url":"https://finance.yahoo.com/news/why-jpmorgan-chase-co-jpm-140724076.html"},{"category":"company","date":1720533600,"headline":"Should You Buy JPMorgan Chase Stock Before July 12?","id":128636426,"image":"https://g.foolcdn.com/editorial/images/782676/gettyimages-1296686780-1201x800-5b2df79.jpg","symbol":"JPM","publisher":"Yahoo","summary":"Q2 earnings from this top bank will set the tone for the entire sector.","url":"https://www.fool.com/investing/2024/07/09/should-you-buy-jpmorgan-chase-stock-before-july-12/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;referring_guid=18cf37e1-5929-40d5-8222-6620a06d6f29\u0026amp;.tsrc=rss"},{"category":"company","date":1720524625,"headline":"Bank of America: Let Your Winners Run","id":128636251,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1323945677/image_1323945677.jpg?io=getty-c-w1536","symbol":"JPM","publisher":"SeekingAlpha","summary":"Bank of AmericaÂ investors have outperformed the S\u0026P 500 recently. Learn why investors of BofAÂ stock should consider staying invested as of now.","url":"https://seekingalpha.com/article/4703153-bank-of-america-let-your-winners-run"},{"category":"company","date":1720521153,"headline":"Fed considers rule tweak that could save biggest US banks billions in capital","id":128635841,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"The U.S. Federal Reserveis considering a rule change that could save the country's eightlargest banks combined billions of dollars in capital, in apotential long-sought win for the industry,...","url":"https://finnhub.io/api/news?id=edbfd4b7f82a48758bb8b26d31aead3ff9451cbe65e6e6e3285b63768d950713"},{"category":"company","date":1720520407,"headline":"Is JPMorgan Diversified Return International Equity ETF (JPIN) a Strong ETF Right Now?","id":128634103,"image":"https://media.zenfs.com/en/zacks.com/d2f7ed3d1940141716bfd200f5c94c6b","symbol":"JPM","publisher":"Yahoo","summary":"Smart Beta ETF report for JPIN","url":"https://finance.yahoo.com/news/jpmorgan-diversified-return-international-equity-102007550.html"},{"category":"company","date":1720515517,"headline":"Bank Earnings, Inflation, Powell Testimony: What to Eye This Week","id":128632952,"image":"https://s.yimg.com/ny/api/res/1.2/EhMfUkmPLlz7ijz.h9hk5Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/474dcf9b4317170fa31fbbc9a50e79ef","symbol":"JPM","publisher":"Yahoo","summary":"This week, earnings are due from some big-name banks, including JPMorgan and Citigroup. Pending economic data include gauges of both consumer and producer inflation. Plus, Federal Reserve Chair Jerome Powell will testify to Congress on monetary policy.","url":"https://finance.yahoo.com/m/45a1a197-1287-3107-aab2-b134778d1603/bank-earnings%2C-inflation%2C.html"},{"category":"company","date":1720511100,"headline":"Jamie Dimon Predicts Higher Inflation: Our Response","id":128634240,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1551007220/image_1551007220.jpg?io=getty-c-w1536","symbol":"JPM","publisher":"SeekingAlpha","summary":"Jamie Dimon is concerned that we could be facing higher inflation. Click here to read why we disagree and expect inflation to continue to cool down.","url":"https://seekingalpha.com/article/4702901-jamie-dimon-predicts-higher-inflation-our-response"},{"category":"company","date":1720501320,"headline":"SMALL-CAP WINNERS \u0026 LOSERS: Capita rises on sale of software business","id":128638717,"image":"","symbol":"JPM","publisher":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=zxdw9wlvz6"},{"category":"company","date":1720492980,"headline":"LONDON BRIEFING: FTSE called up amid underwhelming retail sales data","id":128638705,"image":"","symbol":"JPM","publisher":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=96jtldqron"},{"category":"company","date":1720492920,"headline":"Stock market today: Asian shares are mixed after Fed chair's comments give scant clues on rate cuts","id":128645499,"image":"","symbol":"JPM","publisher":"Associated Press, The","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=c5hmjae5ni"},{"category":"company","date":1720492920,"headline":"Stock market today: Wall Street wavers following congressional testimony from Powell","id":128638720,"image":"","symbol":"JPM","publisher":"Associated Press, The","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=84isqkk6kz"},{"category":"company","date":1720475118,"headline":"JPMorgan Chase \u0026 Co. (JPM) Outperforms Broader Market: What You Need to Know","id":128629455,"image":"https://media.zenfs.com/en/zacks.com/5ecaf2a9bf082a5f3a554e6526b34be0","symbol":"JPM","publisher":"Yahoo","summary":"JPMorgan Chase \u0026 Co. (JPM) closed at $205.17 in the latest trading session, marking a +0.19% move from the prior day.","url":"https://finance.yahoo.com/news/jpmorgan-chase-co-jpm-outperforms-214518831.html"},{"category":"company","date":1720467960,"headline":"Nasdaq Edges Up, Dow Slips Ahead of Busy Week","id":128629456,"image":"https://s.yimg.com/ny/api/res/1.2/_Zn1030dX68RyDVVaqkSzQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/420956c87a24f33a9a404366b6d4d7f6","symbol":"JPM","publisher":"Yahoo","summary":"The Nasdaq Composite was edging higher while the S\u0026P 500 was wavering Monday, after finishing at record highs Friday.","url":"https://finance.yahoo.com/m/925f8366-a8db-3c42-9256-2760067eddb6/nasdaq-edges-up%2C-dow-slips.html"},{"category":"company","date":1720456500,"headline":"How major US stock indexes fared Monday, 7/8/2024","id":128626509,"image":"","symbol":"JPM","publisher":"Associated Press, The","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=hotlejgf4a"},{"category":"company","date":1720453800,"headline":"JPMorgan (JPM) Strategic Buyouts Aid Amid Fee Income Woes","id":128629457,"image":"https://media.zenfs.com/en/zacks.com/4d0f5c269de903a3e502f871a8b4461f","symbol":"JPM","publisher":"Yahoo","summary":"JPMorgan (JPM) remains well-poised for growth on higher rates, strategic restructuring and expansion moves and improving deal-making activities. Yet, fee income growth challenges are a major headwind.","url":"https://finance.yahoo.com/news/jpmorgan-jpm-strategic-buyouts-aid-155000939.html"},{"category":"company","date":1720452503,"headline":"Why big banks are 'chugging along': Portfolio manager","id":128622859,"image":"https://s.yimg.com/ny/api/res/1.2/aXDdH2gMTr6PSiidTHFGlA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/904b70d0-3d3c-11ef-bb7e-a3a474a05b05","symbol":"JPM","publisher":"Yahoo","summary":"As major financial institutions like JPMorgan (JPM), Citi (C), and Wells Fargo (WFC) prepare to release their earnings this week, Macrae Sykes, Gabelli Funds portfolio manager, joins Catalysts to share his outlook on the banking sector. Sykes expresses a bullish stance on bank earnings, highlighting two key factors that could potentially boost reports. First, he notes that the S\u0026P 500's (^GSPC) 5% increase for the quarter could positively impact asset and wealth management segments in bank earnings. Secondly, Sykes points to \"a slight decline\" in the ten-year yield, which he views as beneficial for operating capital contribution. Overall, Sykes sees \"continued steady progress\" in the banking sector, asserting that \"fundamentally, they're chugging along and in good shape.\" Regarding consumer trends supporting big banks, Sykes acknowledges a slowdown among lower-income consumers due to inflation pressures. However, he emphasizes that \"we continue to see pretty strong metrics out of the higher-end\" consumers. For more expert insight and the latest market action, click here to watch this full episode of Catalysts. This article was written by Angel Smith","url":"https://finance.yahoo.com/video/why-big-banks-chugging-along-152823172.html"},{"category":"company","date":1720452002,"headline":"Bank of America Should Outperform On Core Growth In '25-'26, But Is That Priced In?","id":128624544,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1323945677/image_1323945677.jpg?io=getty-c-w1536","symbol":"JPM","publisher":"SeekingAlpha","summary":"Bank of America has opportunities to leverage growth in trading and investment banking that may not be fully appreciated. Read my earnings analysis of BAC stock here.","url":"https://seekingalpha.com/article/4703000-bank-of-america-should-outperform-on-core-growth-in-25-26-but-that-appears-priced-in"},{"category":"company","date":1720446023,"headline":"June CPI, Big Bank earnings in focus this week: Top stories","id":128622860,"image":"https://s.yimg.com/ny/api/res/1.2/u84iQbDUmfN8P8ErC0_SgA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/29048740-3d2d-11ef-9fef-3bc7092691e8","symbol":"JPM","publisher":"Yahoo","summary":"Wall Street is gearing up for a crucial week as key economic data and major bank earnings converge. Investors are focusing on two main events: the Consumer Price Index (CPI) report due out Thursday and earnings releases from banking giants like JPMorgan Chase \u0026 Co. (JPM) and Wells Fargo (WFC) on Friday. Together, these reports will help investors gauge the potential direction of the Federal Reserve's monetary policy. Morning Brief co-hosts Seana Smith and Brad Smith break down the top market stories to come this week. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This article was written by Angel Smith","url":"https://finance.yahoo.com/video/june-cpi-big-bank-earnings-134023610.html"},{"category":"company","date":1720445408,"headline":"AutoRek partners J.P. Morgan Payments to streamline premium processing","id":128629461,"image":"https://www.lifeinsuranceinternational.com/wp-content/uploads/sites/8/2024/07/shutterstock_2353911537-1.jpg","symbol":"JPM","publisher":"Yahoo","summary":"The collaboration will allow insurance companies to simplify cash allocation, matching and credit control processes.","url":"https://www.lifeinsuranceinternational.com/news/autorek-jp-morgan-premium-processing/"},{"category":"company","date":1720440300,"headline":"JPMorgan (JPM) Stock: Buy, Sell, or Hold Before Q2 Earnings?","id":128629462,"image":"https://media.zenfs.com/en/zacks.com/4d0f5c269de903a3e502f871a8b4461f","symbol":"JPM","publisher":"Yahoo","summary":"High rates, solid IB and trading businesses, and decent loan demand are likely to have aided JPMorgan (JPM). But lingering fee income growth concerns and rising provisions and costs are expected to have been spoilsports. What should be investors' stance regarding JPM stock ahead of Q2 earnings?","url":"https://finance.yahoo.com/news/jpmorgan-jpm-stock-buy-sell-120500719.html"},{"category":"company","date":1720436700,"headline":"U.S. Stock Futures Little Changed","id":128621749,"image":"https://s.yimg.com/ny/api/res/1.2/_Zn1030dX68RyDVVaqkSzQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/420956c87a24f33a9a404366b6d4d7f6","symbol":"JPM","publisher":"Yahoo","summary":"Futures are wavering after four days of gains for the S\u0026P 500, which closed at a record on Friday.  Treasury yields are up, having fallen for a third-straight day on Friday when the monthly jobs report showed an increase in the unemployment rate.  Whether that clears the Federal Reserve’s way to lower rates in September may become clearer when Fed Chair  Jerome Powell  addresses Congress on Tuesday and monthly inflation data are published later in the week.","url":"https://finance.yahoo.com/m/925f8366-a8db-3c42-9256-2760067eddb6/u.s.-stock-futures-little.html"},{"category":"company","date":1720432800,"headline":"JPMorgan And Bank of America Are Calling The Fed's Bluff","id":128622060,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1473080351/image_1473080351.jpg?io=getty-c-w1536","symbol":"JPM","publisher":"SeekingAlpha","summary":"The Fed has come out with its stress test results. Last year, Bank of America put that test into question, and this year JPMorgan did the same. Read what this means for the banking sector.","url":"https://seekingalpha.com/article/4702313-jpmorgan-and-bank-of-america-are-calling-the-feds-bluff"},{"category":"company","date":1720432800,"headline":"Banks’ Hedges Are Cheap Before the Start of the Earnings Season","id":128621011,"image":"https://s.yimg.com/ny/api/res/1.2/qnHYRixnMwzgKl9UzCaqvw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03MTM-/https://media.zenfs.com/en/bloomberg_markets_842/f6d3624d2c69c8794e8f2fd962be4388","symbol":"JPM","publisher":"Yahoo","summary":"(Bloomberg) -- JPMorgan Chase \u0026 Co., Wells Fargo \u0026 Co. and Citigroup Inc. are kicking off the US banks’ earnings season on Friday, and traders are feeling pretty relaxed about it. Most Read from BloombergBiden Narrows Gap With Trump in Swing States Despite Debate LossHedge Funds That Piled Into Big Tesla Short Stung by RallyBoeing to Plead Guilty to Fraud for Violating Deal Over 737 Max CrashesFrench Left Set for Shock Victory Over Macron and Le PenThe trio of stocks has surged more than 22% thi","url":"https://finance.yahoo.com/news/banks-hedges-cheap-start-earnings-100000714.html"},{"category":"company","date":1720429260,"headline":"The Zacks Analyst Blog Highlights Citigroup, JPMorgan \u0026 Chase and Bank of America","id":128620537,"image":"https://media.zenfs.com/en/zacks.com/32389a4625f6ac2960e954af2d7bcd7a","symbol":"JPM","publisher":"Yahoo","summary":"Citigroup, JPMorgan \u0026 Chase and Bank of America are included in this Analyst Blog.","url":"https://finance.yahoo.com/news/zacks-analyst-blog-highlights-citigroup-090100579.html"},{"category":"company","date":1720421043,"headline":"Futures flat with inflation data, earnings in focus","id":128620534,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"* Futures: Dow up 0.02%, S\u0026P 500 down 0.04%, Nasdaq down0.03% ...","url":"https://finnhub.io/api/news?id=47526caef019388b6da165507787f0b4decc76eb388eef395b11ed8e877730eb"},{"category":"company","date":1720410147,"headline":"Take Five: Banks and rates","id":128619266,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"Federal Reserve Chair Jerome Powell'stestimony and U.S. inflation data top the agenda in the week tocome, with U.S. banks reporting earnings and rate decisions duein New Zealand and South Korea. ...","url":"https://finnhub.io/api/news?id=0ce36d04803384a429f20fff848d0a95fd3141eb39b4e9988340be90239ce848"},{"category":"company","date":1720405507,"headline":"Major Shareholding Disclosure","id":128618815,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"JPMorgan Chase \u0026 Co. has a notifiable interest in the share capital ofBorr Drilling Limited as a result of trades by its subsidiary J.P. MorganSecurities LLC. The total number of shares held by...","url":"https://finnhub.io/api/news?id=4157c1e1b651dd6121df4287fb063eb3e579836bab6d6f0c02286c42ee06c65f"},{"category":"company","date":1720402587,"headline":"Asian shares edge higher, euro dogged by French political deadlock","id":128618534,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"Asian stocks inched higher onMonday as investors grew more confident about a September U.S.rate cut, while the euro grappled with political uncertainty asFrench elections pointed to a hung...","url":"https://finnhub.io/api/news?id=811ef3087edf351e5875fdf732e6810489bb22a8d2a986375ea254a4b6bd336c"},{"category":"company","date":1720398600,"headline":"MORNING BID EUROPE-French left outflanks the right","id":128618212,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"A look at the day ahead in Europeanand global markets from Wayne Cole. All the hand-wringing about a far-right victory in Francelooks to have been premature, with polls suggesting the...","url":"https://finnhub.io/api/news?id=a0add692192452b01b06030d69eac9c3e096f0775e621076e4749b6f877cb039"},{"category":"company","date":1720398360,"headline":"Stock market today: Wall Street ends mixed, nudging the S\u0026P 500 and Nasdaq to more records","id":128626054,"image":"","symbol":"JPM","publisher":"Associated Press, The","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=i5s726muaj"},{"category":"company","date":1720361857,"headline":"Inflation data, Powell speaks, and big banks report earnings: What to know this week","id":128615002,"image":"https://s.yimg.com/ny/api/res/1.2/1krFSoBxXnBLOyDvSlT74g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04NDY-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/4dd6e170-3c6b-11ef-b336-32305aeb516d","symbol":"JPM","publisher":"Yahoo","summary":"With a cooling labor market narrative emerging, investor focus will shift back to inflation for signs that a September interest rate cut remains likely for the Federal Reserve.","url":"https://finance.yahoo.com/news/inflation-data-powell-speaks-and-big-banks-report-earnings-what-to-know-this-week-141737717.html"},{"category":"company","date":1720342851,"headline":"5 Things To Consider Ahead Of Wells Fargo's Q2 2024 Earnings","id":128614318,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/517157906/image_517157906.jpg?io=getty-c-w1536","symbol":"JPM","publisher":"SeekingAlpha","summary":"Wells Fargo, which outperformed its peers, will report quarterly results on Friday before markets open. Read why I'm bullish on WFC stock.","url":"https://seekingalpha.com/article/4702763-5-things-to-consider-ahead-of-wells-fargos-q2-2024-earnings"},{"category":"company","date":1720336219,"headline":"Wall Street Breakfast: The Week Ahead","id":128613812,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/157311703/image_157311703.jpg?io=getty-c-w1536","symbol":"JPM","publisher":"SeekingAlpha","summary":"Wall Street will be busy next week with the June CPI report and earnings season starting.","url":"https://seekingalpha.com/article/4702768-wall-street-breakfast-week-ahead"},{"category":"company","date":1720259400,"headline":"3 High-Yield Dividend ETFs to Buy to Generate Passive Income","id":128606874,"image":"https://g.foolcdn.com/editorial/images/782459/young-woman-smiling-hands-behind-head.jpg","symbol":"JPM","publisher":"Yahoo","summary":"These exchange-traded funds should keep the income flowing in regularly.","url":"https://www.fool.com/investing/2024/07/06/high-yield-dividend-etfs-buy-passive-income/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;referring_guid=32cab730-dac1-4fb7-8b19-abf8bf2e5bf9\u0026amp;.tsrc=rss"},{"category":"company","date":1720258200,"headline":"5 Relatively Secure And Cheap Dividend Stocks To Invest In - July 2024","id":128608061,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1249993252/image_1249993252.jpg?io=getty-c-w1536","symbol":"JPM","publisher":"SeekingAlpha","summary":"Check here for five safe, high-yield dividend-paying stocks with discounts to historical norms in this monthly article.","url":"https://seekingalpha.com/article/4702278-5-relatively-secure-cheap-dividend-stocks-invest-july-2024"},{"category":"company","date":1720213712,"headline":"Biden on ABC, bank earnings, inflation data: What to Watch","id":128601960,"image":"https://s.yimg.com/ny/api/res/1.2/4CnWvUyt9CgEBvwqVr9lMQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/4561b9d0-3b11-11ef-bd7f-f0bf787ce93d","symbol":"JPM","publisher":"Yahoo","summary":"The first trading week of July and 2024's third quarter was a wild one, but the big news doesn't stop there. Asking for a Trend Anchor Josh Lipton highlights the top headlines investors should pay attention to over the next week, including: President Biden's interview with ABC reporter George Stephanopoulos tonight, June's Consumer Price Index (CPI) and Producer Price Index (PPI) prints, fresh earnings reports from major banks JPMorgan Chase \u0026 Co. (JPM), Wells Fargo (WFC), and Citigroup (C). For more expert insight and the latest market action, click here to watch this full episode of Asking for a Trend. This post was written by Luke Carberry Mogan.","url":"https://finance.yahoo.com/video/biden-abc-bank-earnings-inflation-210832572.html"},{"category":"company","date":1720194555,"headline":"Top Midday Stories: Shell Expects to Book $2 Billion Impairment in Q2; Macy's Targeted With Upsized Buyout Offer; JPMorgan Unit Warns of Increasing Costs to Customers","id":128604213,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"JPM","publisher":"Yahoo","summary":"Top Midday Stories: Shell Expects to Book $2 Billion Impairment in Q2; Macy's Targeted With Upsized Buyout Offer; JPMorgan Unit Warns of Increasing Costs to Customers","url":"https://finance.yahoo.com/news/top-midday-stories-shell-expects-154915249.html"},{"category":"company","date":1720192890,"headline":"Earnings Calendar Spotlight: JPMorgan Shoots Higher Ahead Of Q2 Earnings Report","id":128602915,"image":"","symbol":"JPM","publisher":"Yahoo","summary":"Q2 earnings season kicks off in the coming week, with JPMorgan, Citigroup and Wells Fargo front and center on the earnings calendar.","url":"https://finance.yahoo.com/m/4b6b0e4a-bf18-33f0-8e04-91f3e17d09ec/earnings-calendar-spotlight%3A.html"},{"category":"company","date":1720187400,"headline":"3 Bank Stocks to Keep an Eye On as They Hit a New 52-Week High","id":128599738,"image":"https://media.zenfs.com/en/zacks.com/c6fad3ca7c16d98ecfc2bf948f4cf143","symbol":"JPM","publisher":"Yahoo","summary":"Stocks like Citigroup (C), JPMorgan (JPM) and Bank of America (BAC) are expected to maintain their momentum and keep scaling new highs.","url":"https://finance.yahoo.com/news/3-bank-stocks-keep-eye-135000801.html"},{"category":"company","date":1720184407,"headline":"Why the S\u0026P 500 is poised to rocket 100% in 5 years","id":128597516,"image":"https://s.yimg.com/ny/api/res/1.2/o2AjLuULwWUYtaDOFYW9tw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTk-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/d3dd4ce0-3974-11ef-b9ff-a0053ad29fee","symbol":"JPM","publisher":"Yahoo","summary":"We are in the early innings of a bull market despite several years of big gains, says one veteran market strategist.","url":"https://finance.yahoo.com/news/why-the-sp-500-is-poised-to-rocket-100-in-5-years-130007834.html"},{"category":"company","date":1720183920,"headline":"Amazon, Macy's rise; Robinhood Markets, APA fall, Friday, 7/5/2024","id":128615596,"image":"","symbol":"JPM","publisher":"Associated Press, The","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=whto8jvw5k"},{"category":"company","date":1720180819,"headline":"Institutional investors control 73% of JPMorgan Chase \u0026 Co. (NYSE:JPM) and were rewarded last week after stock increased 4.8%","id":128596860,"image":"https://media.zenfs.com/en/simply_wall_st__316/393a21695c25a8a00f631cfd22c3f87a","symbol":"JPM","publisher":"Yahoo","summary":"Key Insights Institutions' substantial holdings in JPMorgan Chase implies that they have significant influence over the...","url":"https://finance.yahoo.com/news/institutional-investors-control-73-jpmorgan-120019967.html"},{"category":"company","date":1720177519,"headline":"J2 Ventures Secures $150 Million in Latest Funding Round to Propel Tech Startups with Civilian and Government Applications","id":128597821,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"BOSTON - J2 Ventures, a deep tech venture capital fund focused on new technologies that are critical for both the private sector and national security interests of the U.S and its allies, has raised...","url":"https://finnhub.io/api/news?id=496839baacf9c948d3d512e9a291ae8612b5771654d26b99c375256587072471"},{"category":"company","date":1720171800,"headline":"JPMorgan Warns Customers: Prepare to Pay for Checking Accounts","id":128596861,"image":"https://s.yimg.com/ny/api/res/1.2/4wfzavJPvamIkeHrHQBbOQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/b3de667e1b96e4cadd666a8ba31d8327","symbol":"JPM","publisher":"Yahoo","summary":"The head of Chase said bank customers stand to lose out on everything from free checking accounts to credit score trackers if Washington enacts new rules.","url":"https://finance.yahoo.com/m/dcd27991-a54b-3b2f-a555-22f4ba68a82e/jpmorgan-warns-customers%3A.html"},{"category":"company","date":1720163532,"headline":"MegazoneCloud Picks JPMorgan, Banks for IPO as AI Interest Grows","id":128596862,"image":"https://s.yimg.com/ny/api/res/1.2/OVQk0pMrW_m2aD1Ak0X_sA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_markets_842/cbf74d1be45ee81b36a91635a166dfa1","symbol":"JPM","publisher":"Yahoo","summary":"(Bloomberg) -- MegazoneCloud Corp. has selected firms including a unit of JPMorgan Chase \u0026 Co. to help it kickstart an initial public offering that could value one of Asia’s biggest cloud and AI services companies at several billion dollars.Most Read from BloombergKamala Harris Is Having a Surprise Resurgence as Biden’s Campaign UnravelsBiden’s Fourth of July Shrouded by Pressure to Drop 2024 BidSingapore Couples Are Marrying Earlier to Buy Homes, Leading Some to RegretSingapore Is Making Life T","url":"https://finance.yahoo.com/news/megazonecloud-picks-jpmorgan-banks-ipo-071212528.html"},{"category":"company","date":1720133507,"headline":"INDIA BONDS-India bond yields seen little changed ahead of debt supply","id":128592309,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"Indian government bond yieldsare expected to be flat at the open on Friday, as marketparticipants await a fresh supply of debt as well as key U.S.jobs data later in the day. The...","url":"https://finnhub.io/api/news?id=274f451dd2369ae988f77ad89e16b3a0feb92c8bb81a86471824c422e0ebdb7a"},{"category":"company","date":1720129140,"headline":"Wall Street Bids Adieu to Its Biggest Bear","id":128591640,"image":"https://s.yimg.com/ny/api/res/1.2/bEf0hy8kH_zzvgPcj9fvuA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/9dc52204a583cdce215d91ee6d79a048","symbol":"JPM","publisher":"Yahoo","summary":"JPMorgan’s Marko Kolanovic had a knack for making aggressive calls, but now the analyst is out after missing a roaring bull market.","url":"https://finance.yahoo.com/m/a7a654cd-9590-345a-b83e-b71b342b6602/wall-street-bids-adieu-to-its.html"},{"category":"company","date":1720123500,"headline":"A Red Flag, S\u0026P 500 Annual Returns, Top 10 Holdings","id":128591157,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/185256759/image_185256759.jpg?io=getty-c-w1536","symbol":"JPM","publisher":"SeekingAlpha","summary":"The 18-month annualized return for the S\u0026P 500 is 28.55%. Thatâs a tad stretched.","url":"https://seekingalpha.com/article/4702484-red-flag-s-and-p-500-annual-returns-top-10-holdings"},{"category":"company","date":1720101840,"headline":"Mitsubishi UFJ (MUFG) Talks for HDBF Stake Hit a Road Block","id":128587435,"image":"https://media.zenfs.com/en/zacks.com/a5e3eca023cd41d68fc17692e9515add","symbol":"JPM","publisher":"Yahoo","summary":"Mitsubishi UFJ's (MUFG) negotiation for a minority stake in the HDFC's consumer lending unit, HDB Financials, is delayed. The company is considering sweetening its offer to crack the deal.","url":"https://finance.yahoo.com/news/mitsubishi-ufj-mufg-talks-hdbf-140400754.html"},{"category":"company","date":1720092600,"headline":"Global Anti-Obesity Market Analysis: Key Trends And Insights","id":128585875,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1434978146/image_1434978146.jpg?io=getty-c-w1536","symbol":"JPM","publisher":"SeekingAlpha","summary":"Global obesity treatment market is expected to exceed $100b by 2030. Click here for an in-depth analysis of drugs being developed to combat obesity and related diseases.","url":"https://seekingalpha.com/article/4702464-global-anti-obesity-market-analysis-key-trends-and-insights"},{"category":"company","date":1720072813,"headline":"EBA CLEARING welcomes new Board members","id":128583161,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"As from 2 July 2024, Katja Lehr of J.P. Morgan and Frantz Teissedre of Societe Generale have joined the Board of EBA CLEARING.Katja Lehr succeeds James Barclay of J.P. Morgan and represents the UK...","url":"https://finnhub.io/api/news?id=a2e16178bba15f0905885d571656d5925f22c584cc84cce6913d0bc636a19aaf"},{"category":"company","date":1720060500,"headline":"U.S. Tech Stocks: Heavyweights That Move Global Markets","id":128581154,"image":"","symbol":"JPM","publisher":"SeekingAlpha","summary":"","url":"https://seekingalpha.com/article/4702391-us-tech-stocks-heavyweights-that-move-global-markets"},{"category":"company","date":1720056076,"headline":"JPMORGAN overtakes Barclays in UK deal fee ranking in blow to investment bank","id":128580415,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"JPMorgan has jumped ahead of Barclays to take the top spot in a closely-watched UK deal fee league table in a blow to the British lender's investment banking ambitions.The Wall Street giant raked in...","url":"https://finnhub.io/api/news?id=402de31a5fbe11413e1b7bbcf9e4714b04026b0001af664f749b5fbd706def46"},{"category":"company","date":1720045800,"headline":"CDT Insider Sentiment June 2024: Keep Your Seatbelt Fastened","id":128579231,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/115810296/image_115810296.jpg?io=getty-c-w1536","symbol":"JPM","publisher":"SeekingAlpha","summary":"Closing out the first half of 2024, the S\u0026P 500 Total Return Index (which includes dividend reinvestment) is up an incredible +15.3%.","url":"https://seekingalpha.com/article/4702360-cdt-insider-sentiment-june-2024-keep-your-seatbelt-fastened"},{"category":"company","date":1720023063,"headline":"XLF: Stress Tests Passed, But That's Not The Only Test","id":128574886,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1318508265/image_1318508265.jpg?io=getty-c-w1536","symbol":"JPM","publisher":"SeekingAlpha","summary":"US Fed released positive annual stress test results for 31 banks. Despite decent stress test results, I assess XLF ETF lacks compelling upside. Read more here.","url":"https://seekingalpha.com/article/4702336-xlf-stress-tests-passed-but-thats-not-the-only-test"},{"category":"company","date":1720023060,"headline":"Bearish Strategist Marko Kolanovic is Leaving JPMorgan","id":128572627,"image":"","symbol":"JPM","publisher":"Yahoo","summary":"JPMorgan Chief Market Strategist Marko Kolanovic, a prominent stock-market bear, is leaving the bank and \"exploring other opportunities,\" according to an internal memo sent Wednesday. Kolanovic had stood by his forecast for stocks to fall this year while his peers at most other Wall Street banks adjusted their projections higher.","url":"https://finance.yahoo.com/m/721e6fc4-25be-33b3-baf3-57ab8eda8234/bearish-strategist-marko.html"},{"category":"company","date":1720017960,"headline":"Marko Kolanovic, Wall Street’s Biggest Bear, Is Leaving JPMorgan Chase","id":128572628,"image":"","symbol":"JPM","publisher":"Yahoo","summary":"Marko Kolanovic, who has warned of a significant stock market drop, is departing after 19 years at the bank.","url":"https://finance.yahoo.com/m/d0bd6335-8970-3820-a231-53bae294cdfc/marko-kolanovic%2C-wall.html"},{"category":"company","date":1720015804,"headline":"JPMorgan's chief market strategist, bearish on equities, exits firm","id":128572557,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"One of Wall Street's few bearishstrategists, Marko Kolanovic, is leaving JPMorgan Chaseafter nearly three years as the investment bank's chief marketstrategist and co-head of global research,...","url":"https://finnhub.io/api/news?id=ed8321edf295d6b58ff66e1576141b266e25cf61e78b6ece2d7c1099641ed56b"},{"category":"company","date":1720014402,"headline":"Just Like Dow Jones Banking Giant JPMorgan, This Financial Stock Is Near Buy Point","id":128569884,"image":"https://media.zenfs.com/en/ibd.com/da4c5f4e11806ad88a47663b95a04171","symbol":"JPM","publisher":"Yahoo","summary":"Just like Dow Jones banking giant JPMorgan Chase, Axos Financial is near a new buy point on the stock market today.","url":"https://finance.yahoo.com/m/a3861213-1090-360e-8277-ad20f15e6b42/just-like-dow-jones-banking.html"},{"category":"company","date":1719926820,"headline":"Company News for Jul 2, 2024","id":128555429,"image":"https://media.zenfs.com/en/zacks.com/affdd39d2cfb5dfef2e1f5541ff50f90","symbol":"JPM","publisher":"Yahoo","summary":"Companies in The News Are: TSLA, JPM, AMZN, CBRE","url":"https://finance.yahoo.com/news/company-news-jul-2-2024-132700710.html"},{"category":"company","date":1719925380,"headline":"5 S\u0026P 500 Banks That Outperformed the Index in the First Half","id":128554992,"image":"https://media.zenfs.com/en/zacks.com/8ae84e2bf99a99bf5ff424d21e7434be","symbol":"JPM","publisher":"Yahoo","summary":"Investors remain bullish on bank stocks in the first half of 2024, driven by rate cut expectations, decent lending and modest economic growth. So, banks - Citigroup (C), Wells Fargo (WFC), JPMorgan (JPM), Bank of America (BAC) and BNY Mellon (BK) - outperform the S\u0026P 500 index.","url":"https://finance.yahoo.com/news/5-p-500-banks-outperformed-130300048.html"},{"category":"company","date":1719923288,"headline":"IVE: Value ETF Lagging The Market Since 2020","id":128556334,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1451567017/image_1451567017.jpg?io=getty-c-w1536","symbol":"JPM","publisher":"SeekingAlpha","summary":"iShares S\u0026P 500 Value fundÂ is quite heavy in financials, but more balanced across sectors and holdings than its parent index. Learn more on IVE ETF here.","url":"https://seekingalpha.com/article/4702070-ive-value-etf-lagging-the-market-since-2020"},{"category":"company","date":1719919247,"headline":"How To Pick Top Pharma Stocks: Novo Nordisk And More","id":128555368,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1187291170/image_1187291170.jpg?io=getty-c-w1536","symbol":"JPM","publisher":"SeekingAlpha","summary":"Nine steps I use to identify the most promising pharmaceutical companies and avoid investment pitfalls. Click here to read more.","url":"https://seekingalpha.com/article/4702057-how-to-pick-top-pharma-stocks-novo-nordisk-and-more"},{"category":"company","date":1719915060,"headline":"What Is the Dividend Payout for JPMorgan Chase?","id":128553376,"image":"https://g.foolcdn.com/editorial/images/782087/holding-money-2022b.jpg","symbol":"JPM","publisher":"Yahoo","summary":"The megabank has a substantial dividend. Here's what investors need to know.","url":"https://www.fool.com/investing/2024/07/02/what-is-the-dividend-payout-for-jpmorgan-chase/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;referring_guid=9e17cc0f-8007-4f48-b9fd-23aa088dc381\u0026amp;.tsrc=rss"},{"category":"company","date":1719903300,"headline":"UK dividends calendar","id":128558651,"image":"","symbol":"JPM","publisher":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=i3w7smhkw4"},{"category":"company","date":1719903300,"headline":"UK dividends calendar - next 7 days","id":128558650,"image":"","symbol":"JPM","publisher":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=55d104jakl"},{"category":"company","date":1719900000,"headline":"US court decision casts shadow on diversity venture capital funding","id":128552111,"image":"","symbol":"JPM","publisher":"Finnhub","summary":"Just weeks after a U.S. appeals courtblocked a Black-owned venture capitalist from fundingwomen-of-color-led businesses, the ruling has had a chillingeffect across the small industry of...","url":"https://finnhub.io/api/news?id=498cdd95a67b5d95a3b3d03659b72031b4da36fd349ec78da457b5d398319adb"},{"category":"company","date":1719888240,"headline":"LONDON BRIEFING: Sainsbury's backs outlook; Ryanair hails record June","id":128558626,"image":"","symbol":"JPM","publisher":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=5ldizx7z5i"}]}