{"id":3854,"company":{"country":"GB","currency":"USD","exchange":"NEW YORK STOCK EXCHANGE, INC.","ipo":"2017-01-17","marketCap":8910.32,"name":"TechnipFMC PLC","phone":"441912950303.0","outstanding":438.07,"symbol":"FTI","website":"https://www.technipfmc.com/","industry":"Energy"},"price":26.105,"year":2024,"month":6,"day":29,"weekday":"Saturday","title":"Historical Stock Price Performance of TechnipFMC PLC during Significant Market Events","date":"2024-06-29","url":"/posts/2024/06/29/FTI","content":[{"section":"Market Crash: Global Financial Crisis (2007-2009)","text":"During the global financial crisis, which lasted from 2007 to 2009, TechnipFMC PLC experienced a significant decline in its stock price. From October 2007 to March 2009, the stock price dropped from around $100 to below $20. This decline was primarily driven by widespread economic recession, financial institution failures, and the overall market downturn."},{"section":"Market Rally: Post-Financial Crisis Recovery (2009-2010)","text":"Following the global financial crisis, TechnipFMC PLC, like many other companies, participated in a market rally as the economy started to recover. From the end of the crisis in March 2009 until mid-2010, the stock price of TechnipFMC PLC rebounded strongly, reaching over $70 per share. This rally was supported by various stimulus measures, improved investor sentiment, and positive economic indicators."},{"section":"Market Crash: European Debt Crisis (2011-2012)","text":"During the European debt crisis, which occurred from 2011 to 2012, TechnipFMC PLC faced another market crash. The stock price declined from around $60 in mid-2011 to below $20 in mid-2012. The crisis was triggered by concerns over the sovereign debt of several European countries, leading to widespread market volatility and investor pessimism. TechnipFMC PLC, as a global company with exposure to European markets, was impacted by the crisis."},{"section":"Market Rally: Bull Market (2013-2015)","text":"From 2013 to 2015, TechnipFMC PLC participated in a sustained bull market rally. The stock price steadily increased from around $30 in early 2013 to over $50 in mid-2015. This rally was driven by improving economic conditions, strong corporate earnings, and favorable market sentiment. TechnipFMC PLC benefited from increased demand for its services in the oil and gas industry during this period."},{"section":"Market Crash: COVID-19 Pandemic (2020)","text":"The COVID-19 pandemic, which emerged in 2020, had a significant impact on TechnipFMC PLC's stock price. In the early months of the pandemic, the stock price experienced a sharp decline, falling from around $20 in February 2020 to below $6 in March 2020. This crash was primarily driven by global economic uncertainties, disruption of the oil and gas industry, and investor concerns about the company's financial performance. However, the stock price gradually recovered as markets stabilized and the company implemented strategic measures to adapt to the new environment."}],"tags":["LongSignals","Long","Energy"],"news":[{"category":"company","date":1719372120,"headline":"Filtronic PLC Announces New Share Issuance","id":128461934,"image":"","symbol":"FTI","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3555293120"},{"category":"company","date":1718857200,"headline":"Filtronic PLC Reports Major Shareholding Change","id":128361439,"image":"","symbol":"FTI","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3547697698"},{"category":"company","date":1718847300,"headline":"Filtronic Surges Ahead with Strong FY2024 Results","id":128361440,"image":"","symbol":"FTI","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3547601334"},{"category":"company","date":1718655300,"headline":"TechnipFMC Announces Second Quarter 2024 Earnings Release and Conference Call","id":128305587,"image":"https://media.zenfs.com/en/business-wire.com/eaaf9b36576ede9d219660cefcfa2ee7","symbol":"FTI","publisher":"Yahoo","summary":"NEWCASTLE \u0026 HOUSTON, June 17, 2024--TechnipFMC (NYSE: FTI) will host its second quarter 2024 earnings conference call on Thursday, July 25, 2024, at 1:30 p.m. London time (8:30 a.m. New York time). A press release announcing the results will be issued prior to the call at approximately 11:45 a.m. London time (6:45 a.m. New York time).","url":"https://finance.yahoo.com/news/technipfmc-announces-second-quarter-2024-201500593.html"}]}