{"id":1176,"company":{"country":"US","currency":"USD","exchange":"NEW YORK STOCK EXCHANGE, INC.","ipo":"2019-05-10","marketCap":112668,"name":"Uber Technologies Inc","phone":"14156128582.0","outstanding":2043.52,"symbol":"UBER","website":"https://www.uber.com","industry":"Road \u0026 Rail"},"price":55.35,"year":2023,"month":11,"day":23,"weekday":"Thursday","title":"The Potential Consequences of Product Competition and Technological Advancements on Uber's Market Position and Stock Price","date":"2023-11-23","url":"/posts/2023/11/23/UBER","content":[{"section":"Introduction","text":"In today's rapidly evolving technological landscape, companies like Uber Technologies Inc face the constant pressure of product competition and the emergence of disruptive technologies. These factors can significantly impact Uber's market position and ultimately influence its stock price."},{"section":"Threat of Disruptive Technologies","text":"Uber's dominance in the ride-hailing industry has been primarily driven by its innovative technology platform. However, the emergence of autonomous vehicles poses a serious threat to Uber's market position. Companies like Tesla and Waymo are investing heavily in self-driving car technology, potentially eliminating the need for human drivers and disrupting Uber's current business model. If autonomous vehicles become widely adopted in the near future, Uber may face significant challenges in maintaining its market share."},{"section":"Competition from New Entrants","text":"In addition to the threat of disruptive technologies, Uber also faces intense competition from new entrants in the ride-hailing industry. Companies like Lyft, Grab, and Didi Chuxing have emerged as strong competitors, both domestically and internationally. These companies have been able to replicate Uber's business model and offer similar services, challenging Uber's market dominance. Increased competition can lead to reduced market share for Uber and potentially impact its stock price."},{"section":"Product Competition and User Preferences","text":"Uber operates in a highly competitive market where product differentiation and user preferences play a significant role. As new features and services are introduced by Uber and its competitors, customers may choose alternative platforms based on their preferences. For example, if a competitor offers lower prices or superior customer service, it could lead to a decline in Uber's user base and ultimately affect its market position and stock price."},{"section":"Impact of Technological Advancements","text":"Technological advancements can also impact Uber's market position and stock price. For instance, the rise of electric vehicles (EVs) has the potential to disrupt the traditional ride-hailing industry. As more EVs become available and charging infrastructure improves, users may opt for EV-based ride-hailing services, potentially reducing demand for Uber's current fleet of gasoline-powered vehicles. To stay competitive, Uber would need to adapt its business model and invest in electric and autonomous vehicle technologies."},{"section":"Conclusion","text":"In conclusion, Uber Technologies Inc faces a range of challenges from product competition and technological advancements. The threat of disruptive technologies, competition from new entrants, and changing user preferences all have the potential to impact Uber's market position and stock price. To remain successful, Uber must continue to innovate and adapt its business model to stay ahead of the competition and embrace emerging technologies. The ability to navigate these challenges will be crucial for Uber's long-term success in the dynamic ride-hailing industry."}],"tags":["OverBought","Short","Road \u0026 Rail"],"news":[{"category":"company","date":1700657643,"headline":"Uber Technologies : Your holiday deals have arrived!","id":124050137,"image":"","symbol":"UBER","publisher":"Finnhub","summary":"It's the holiday season: time to get cozy at home, enjoy tasty treats and celebrate with family and friends. But what could make it better? Deals, deals, and a sprinkle of even more...","url":"https://finnhub.io/api/news?id=5dfdbab8fe01cda9fb7faa852b6e0f5bdd6e315d6789a8301978d6f0de5d632f"},{"category":"company","date":1700649900,"headline":"Investors Love DoorDash Stock This November, and Here's Why","id":124045745,"image":"https://s.yimg.com/ny/api/res/1.2/_XDEzKd_o3rR3FcsBePV8w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/motleyfool.com/eccf4f8c2e4466a4b9873e1f85fe9faa","symbol":"UBER","publisher":"Yahoo","summary":"The Nasdaq Composite index has jumped 9.5% in November (so far), but one individual stock is performing even better.  On Nov. 1, DoorDash (NASDAQ: DASH) reported its financial results for the third quarter of 2023 (ended Sept. 30).  The online food ordering and food delivery platform delivered an improvement across several financial metrics -- some of which I've scrutinized in the past -- and investors have sent its stock soaring nearly 26% on the month.","url":"https://finance.yahoo.com/m/0dbd8581-94da-3d1a-8ee2-1c5b7144f7b0/investors-love-doordash-stock.html"},{"category":"company","date":1700642586,"headline":"Thanksgiving Airport Ride Prices Vary By 37%, New Data Shows","id":124046479,"image":"","symbol":"UBER","publisher":"Finnhub","summary":"NEW YORK, USA. November 21st, 2023 - Obi, the leading global taxi and rideshare comparison app with over 350,000 users, has launched a smart guide to help Thanksgiving travelers navigate the...","url":"https://finnhub.io/api/news?id=328110f8bb09a4fc07a935710c60b24e196647f71151a4067fb81dff90f9e53b"},{"category":"company","date":1700605920,"headline":"Labor Group Plans Board Fight at Starbucks","id":124035180,"image":"https://s.yimg.com/ny/api/res/1.2/zXVDYqzYByNqw6Sw0NCoTg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/bc99c0838c0489eadb9b004110935311","symbol":"UBER","publisher":"Yahoo","summary":"A labor group is seeking representation on the  Starbucks  board, ratcheting up pressure in a battle between the coffee giant and its workers over pay and working conditions.  The Strategic Organizing Center—a coalition of labor unions including the Service Employees International Union that owns a small Starbucks stake—is seeking to address what it views as a failure by the board to oversee the company’s treatment of its workers.  The group has nominated three director candidates, according to people familiar with the matter, kicking off what is sure to be one of the most closely watched proxy battles in 2024.","url":"https://finance.yahoo.com/m/dce96aa5-5cb6-322d-834a-81786157efea/labor-group-plans-board-fight.html"},{"category":"company","date":1700601961,"headline":"Banks Tap Convertible Talent as $1.9 Trillion Debt Set to Mature","id":124038998,"image":"https://s.yimg.com/ny/api/res/1.2/Zl4BoFinGt5jgkxRqxvyeg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03MTE-/https://media.zenfs.com/en/bloomberg_markets_842/348c2dfd6d4907de4801a767a86680a5","symbol":"UBER","publisher":"Yahoo","summary":"(Bloomberg) -- As 2023’s wrecking ball of banker job cuts keeps rolling through the sector month after month, one area has broadly escaped demolition.Most Read from BloombergSam Altman, OpenAI Board Open Talks to Negotiate His Possible ReturnBinance Pleads Guilty, Loses CZ, Pays Fines to End Legal WoesOpenAI in ‘Intense Discussions’ to Quell Potential MutinyNvidia Fails to Satisfy Lofty Investor Expectations for AI BoomHigher Interest Rates Are Shattering Housing Dreams Around the WorldFirms inc","url":"https://finance.yahoo.com/news/banks-tap-convertible-talent-1-212601175.html"},{"category":"company","date":1700591983,"headline":"15 Best Countries That Need English Teachers","id":124032165,"image":"https://media.zenfs.com/en/insidermonkey.com/828af1c76d74ebcd548ea537e056fca6","symbol":"UBER","publisher":"Yahoo","summary":"In this article, we will look at the 15 best countries that need English teachers. We have also discussed the global English language learning market. If you want to skip our detailed analysis, head straight to the 5 Best Countries That Need English Teachers. Bloomberg reports that the global English language learning market is projected […]","url":"https://finance.yahoo.com/news/15-best-countries-english-teachers-183943785.html"},{"category":"company","date":1700589600,"headline":"Uber Eats Adds Big Lots As First National Home Discount Retailer","id":124037579,"image":"https://media.zenfs.com/en/prnewswire.com/b7ec0985b87ea18a2c18724cabc19e2d","symbol":"UBER","publisher":"Yahoo","summary":"Today Uber Technologies (NYSE: UBER) announced a new nationwide partnership with Big Lots (NYSE:BIG), bringing the home discount retailer's massive selection to the Uber Eats app, furthering its mission to help consumers get almost anything they need, delivered on-demand. Just in time for the busiest shopping season of the year more than 1,200 Big Lots retail locations across the US are now available for consumers to shop with Uber Eats.","url":"https://finance.yahoo.com/news/uber-eats-adds-big-lots-180000044.html"},{"category":"company","date":1700584920,"headline":"The Big Winner in GM’s Cruise ‘Debacle’ Might Just Be Uber","id":124022556,"image":"https://s.yimg.com/ny/api/res/1.2/bcytEmM_WfF6SCLnwk93Zw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/Barrons.com/44d2eb84e070280f5c80a6bdf9fe4d8b","symbol":"UBER","publisher":"Yahoo","summary":"Stock in the ride-sharing company is up more than 20% since California suspended Cruise's license to operate self-driving taxis.","url":"https://finance.yahoo.com/m/53b1ea74-4c30-346f-8c4e-6537e5814866/the-big-winner-in-gm%E2%80%99s-cruise.html"},{"category":"company","date":1700575010,"headline":"Brad Gerstner Stock Portfolio: 10 Top Stock Picks","id":124020748,"image":"https://s.yimg.com/ny/api/res/1.2/_raO2ZC107xF71QSbPCijg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0xNTUz/https://media.zenfs.com/en/insidermonkey.com/55b9a63b040c05b566867f9c67530d55","symbol":"UBER","publisher":"Yahoo","summary":"In this article, we discuss Brad Gerstner and his top 10 stock picks. If you want to read about some more stocks in the Gerstner portfolio, go directly to Brad Gerstner Stock Portfolio: 5 Top Stock Picks. Starting an investment firm during the financial meltdown of 2008 is the sort of idea that only a […]","url":"https://finance.yahoo.com/news/brad-gerstner-stock-portfolio-10-135650402.html"},{"category":"company","date":1700568360,"headline":"Uber enters nationwide partnership with Big Lots","id":124025522,"image":"","symbol":"UBER","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3222930994"},{"category":"company","date":1700565000,"headline":"Sitting on Cash? These 2 Stocks Are Great Buys.","id":124015238,"image":"https://media.zenfs.com/en/motleyfool.com/8cd48862dc2b1777191796c79bff7ad6","symbol":"UBER","publisher":"Yahoo","summary":"To give you some ideas, here are two leading stocks in the burgeoning markets of ride-sharing and artificial intelligence (AI) that could be timely buys right now.  Uber Technologies (NYSE: UBER) stock is starting to pick up momentum again after a period of slowing growth.  Share prices are up 120% this year, and the company's improving margins and profitability means it's not too late to buy the stock.","url":"https://finance.yahoo.com/m/d6e723b5-5246-3d47-863e-6e6b5c877ae7/sitting-on-cash%3F-these-2.html"},{"category":"company","date":1700564439,"headline":"Uber Technologies, Inc.'s (NYSE:UBER) large institutional owners must be happy as stock continues to impress, up 4.2% over the past week","id":124022559,"image":"https://media.zenfs.com/en/simply_wall_st__316/976387f9691d9e9c613091b5dddac717","symbol":"UBER","publisher":"Yahoo","summary":"Key Insights Given the large stake in the stock by institutions, Uber Technologies' stock price might be vulnerable to...","url":"https://finance.yahoo.com/news/uber-technologies-inc-nyse-uber-110039492.html"},{"category":"company","date":1700562000,"headline":"Formula One in Las Vegas: The good, the bad and the ugly","id":124020022,"image":"","symbol":"UBER","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3222795935"},{"category":"company","date":1700543460,"headline":"Uber Announces Pricing of Upsized $1.5 Billion Convertible Senior Notes Offering","id":124010962,"image":"https://media.zenfs.com/en/business-wire.com/5a5b4072670aaadb3731311466c1f35c","symbol":"UBER","publisher":"Yahoo","summary":"SAN FRANCISCO, November 21, 2023--Uber Technologies, Inc. (NYSE: UBER) today announced the pricing of an upsized offering of $1.5 billion aggregate principal amount of 0.875% Convertible Senior Notes due 2028 (the \"notes\"). Uber also granted the initial purchasers of the notes an option to purchase up to an additional $225.0 million aggregate principal amount of the notes. The offering was upsized from the previously announced offering of $1.2 billion aggregate principal amount of Convertible Se","url":"https://finance.yahoo.com/news/uber-announces-pricing-upsized-1-051100728.html"},{"category":"company","date":1700540460,"headline":"Uber Technologies price upsized $1.5B convertible senior notes","id":124025524,"image":"","symbol":"UBER","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3222422575"},{"category":"company","date":1700536446,"headline":"Uber Is Said to Boost Convertible Bond Issue to $1.5 Billion","id":124010963,"image":"https://s.yimg.com/ny/api/res/1.2/xIWvx5E6q6N7whcGbj9axA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_markets_842/caf09e65c2ae8e7b705afcdc9c77dae5","symbol":"UBER","publisher":"Yahoo","summary":"(Bloomberg) -- Uber Technologies Inc. boosted a planned convertible bond issue to $1.5 billion, according to people familiar with the matter, signaling strong demand among investors.Most Read from BloombergCitigroup Cuts Over 300 Senior Manager Roles in Latest RestructuringNearly All of OpenAI Staff Threaten to Go to Microsoft If Board Doesn’t QuitThe Doomed Mission Behind Sam Altman’s Shock Ouster From OpenAIMicrosoft Ends Weekend of OpenAI Drama With Coup of Its OwnTech Giants Roar as Nasdaq 1","url":"https://finance.yahoo.com/news/uber-said-boost-convertible-bond-015346660.html"},{"category":"company","date":1700532363,"headline":"SAPS Shootout Claims Life of 16-Year-Old Suspect","id":124011850,"image":"","symbol":"UBER","publisher":"Finnhub","summary":"A routine Uber journey turned into a ride to death when a group of teenagers attempted to rob a driver in Browns Farm, Philippi, in Cape Town.It led to a shootout with South African police members...","url":"https://finnhub.io/api/news?id=b9a7d6ed7548d60d2629b957eee44697a6cd1fac2179bc3925c584a018a94757"},{"category":"company","date":1700515346,"headline":"Uber’s $1.2 Billion Convertible Bond Signals Vote of Confidence","id":124010964,"image":"https://s.yimg.com/ny/api/res/1.2/.KDdgtuL8mPszvyBaNEX0w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03MTk-/https://media.zenfs.com/en/bloomberg_markets_842/9436627c06f68c4ffd2ebf33d58a17ec","symbol":"UBER","publisher":"Yahoo","summary":"(Bloomberg) -- Uber Technologies Inc.’s credit rating isn’t yet investment grade, but the ride-hailing giant is seeking to price its planned $1.2 billion convertible bond issue as though it already is. Most Read from BloombergCitigroup Cuts Over 300 Senior Manager Roles in Latest RestructuringNearly All of OpenAI Staff Threaten to Go to Microsoft If Board Doesn’t QuitThe Doomed Mission Behind Sam Altman’s Shock Ouster From OpenAIMicrosoft Ends Weekend of OpenAI Drama With Coup of Its OwnTech Gia","url":"https://finance.yahoo.com/news/uber-1-2-billion-convertible-212226372.html"},{"category":"company","date":1700487513,"headline":"10 Stocks Billionaire David Tepper Just Bought and Sold","id":123994001,"image":"https://media.zenfs.com/en/insidermonkey.com/e5f3b75b70e2fd5863d34168bf4d921b","symbol":"UBER","publisher":"Yahoo","summary":"In this piece, we will take a look at the ten stocks that billionaire David Tepper just bought and sold. If you want to skip our overview of David Tepper, his hedge fund, and the latest stock market news, then take a look at 5 Stocks Billionaire David Tepper Just Bought and Sold. David Tepper […]","url":"https://finance.yahoo.com/news/10-stocks-billionaire-david-tepper-133833570.html"},{"category":"company","date":1700484480,"headline":"3 Meal Kit Delivery Stocks Serving Convenience — and Profits","id":124008759,"image":"","symbol":"UBER","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3221315031"},{"category":"company","date":1700466373,"headline":"Microsoft, Nvidia, Boeing rise premarket; Uber, Nikola fall","id":123996349,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"UBER","publisher":"Yahoo","summary":"Investing.com -- U.S. futures edged higher Monday, at the start of a holiday-shortened week that includes the keenly-awaited release of the minutes from the most recent Federal Reserve meeting.","url":"https://finance.yahoo.com/news/microsoft-nvidia-boeing-rise-premarket-074613422.html"},{"category":"company","date":1700482924,"headline":"Microsoft, Palantir rise; Bristol-Myers, Kohl's fall, Monday, 11/20/2023","id":123996942,"image":"","symbol":"UBER","publisher":"Finnhub","summary":"NEW YORK — Stocks that are trading heavily or have substantial price changes on Monday: Microsoft Corp. , up $6.43 to $376.28. The software giant hired ex-OpenAI CEO Sam Altman for a new AI...","url":"https://finnhub.io/api/news?id=aa0d2b054fbe510d014b4c859337eb5fa1a5b993c224fb079cf8582bcdd7d22c"},{"category":"company","date":1700481600,"headline":"Uber Announces Proposed $1.2 Billion Convertible Senior Notes Offering","id":123994002,"image":"https://media.zenfs.com/en/business-wire.com/acd8da8fec02f746de6ab9fcffee922e","symbol":"UBER","publisher":"Yahoo","summary":"SAN FRANCISCO, November 20, 2023--Uber Technologies, Inc. (NYSE: UBER) today announced that it proposes to offer $1.2 billion aggregate principal amount of Convertible Senior Notes due 2028 (the \"notes\"), subject to market conditions and other factors. The notes are being offered only to persons reasonably believed to be qualified institutional buyers pursuant to Rule 144A under the Securities Act of 1933, as amended (the \"Securities Act\"). Uber also intends to grant the initial purchasers of th","url":"https://finance.yahoo.com/news/uber-announces-proposed-1-2-120000543.html"},{"category":"company","date":1700481360,"headline":"Dow Jones climbs, S\u0026P 500 aims to exit correction on hopes the Fed is finished raising rates","id":123998356,"image":"","symbol":"UBER","publisher":"MarketWatch","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3221249848"},{"category":"company","date":1700476020,"headline":"Is the Stock Market Closed for Thanksgiving 2023?","id":123999701,"image":"","symbol":"UBER","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3221144794"},{"category":"company","date":1700474460,"headline":"Dutch Bros (BROS) Stock Gains on JPMorgan Upgrade","id":123997789,"image":"","symbol":"UBER","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3221116970"},{"category":"company","date":1700473800,"headline":"Uber Stock Falls After Announcement of $1.2 Billion Convertible Notes Offering","id":123995144,"image":"","symbol":"UBER","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3221104159"},{"category":"company","date":1700471340,"headline":"Uber (NYSE:UBER) Slides on $1.2B Convertible Notes Offering","id":124008765,"image":"","symbol":"UBER","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3221059062"},{"category":"company","date":1700470320,"headline":"Spotlight on Uber Technologies: Analyzing the Surge in Options Activity","id":124008766,"image":"","symbol":"UBER","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3221041161"},{"category":"company","date":1700469540,"headline":"Morning Brew: Amazon AI Push and Microsoft's AI Talent Coup","id":123997672,"image":"","symbol":"UBER","publisher":"GuruFocus","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3221026360"},{"category":"company","date":1700468642,"headline":"Uber : $1.2 billion convertible bond issue","id":123992623,"image":"","symbol":"UBER","publisher":"Finnhub","summary":"Uber Technologies announced on Monday the launch of a $1.2 billion convertible bond issue maturing in 2028.In a press release, the San Francisco-based company explains that the transaction is intended...","url":"https://finnhub.io/api/news?id=db727034fbe2329e647f9464b67a6f3b41288cfb6d7fc8823e264fe75b2aa8f0"},{"category":"company","date":1700467020,"headline":"Uber (NYSE:UBER) Slides After $1.2B Convertible Notes Offering","id":124008768,"image":"","symbol":"UBER","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3220984172"},{"category":"company","date":1700463900,"headline":"Uber to offer $1.2 billion of five-year convertible bonds","id":124004632,"image":"https://images.mktw.net/im-380318/social","symbol":"UBER","publisher":"MarketWatch","summary":"Uber is issuing convertible bonds to pay down outstanding debt.","url":"https://www.marketwatch.com/story/uber-to-offer-1-2-billion-of-five-year-convertible-bonds-b1914c94"},{"category":"company","date":1700461560,"headline":"Uber to offer $1.2B in convertible senior notes","id":124008770,"image":"","symbol":"UBER","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3220902035"},{"category":"company","date":1700460360,"headline":"Uber files to sell $1.2B of Convertible Senior Notes due 2028","id":124008771,"image":"","symbol":"UBER","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3220886634"},{"category":"company","date":1700455020,"headline":"Uber Technologies Inc. stock rises Monday, still underperforms market","id":124008773,"image":"","symbol":"UBER","publisher":"MarketWatch","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3221618654"},{"category":"company","date":1700451000,"headline":"Dow Jones finishes over 200 points higher as S\u0026P 500 moves out of correction","id":124008774,"image":"","symbol":"UBER","publisher":"MarketWatch","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3221521767"},{"category":"company","date":1700396525,"headline":"China's neighbors are wooing American CEOs. The CEOs are listening.","id":123979691,"image":"https://s.yimg.com/ny/api/res/1.2/Osn2W2Vx7zVwWCWnkSAiWA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2023-11/d7542810-8562-11ee-bffd-e15239588d2a","symbol":"UBER","publisher":"Yahoo","summary":"Leaders from China's neighboring countries rubbed elbows this past week with top American executives as they made their case for moving investments to other parts of Southeast Asia.","url":"https://finance.yahoo.com/news/chinas-neighbors-are-wooing-american-ceos-the-ceos-are-listening-122205166.html"},{"category":"company","date":1700260579,"headline":"Tracking 13Fs: Daniel Loeb's Third Point Q3 2023","id":123966005,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/187750775/image_187750775.jpg?io=getty-c-w1536","symbol":"UBER","publisher":"SeekingAlpha","summary":"Explore Third Point's tech-focused portfolio structure in Q3, with major holdings accounting for over 70% of the fund's AUM. Read the article for more details.","url":"https://seekingalpha.com/article/4652819-tracking-13fs-daniel-loebs-third-point-q3-2023"},{"category":"company","date":1700242560,"headline":"Uber Technologies Inc. stock rises Friday, still underperforms market","id":123962066,"image":"https://images.mktw.net/im-220105/social","symbol":"UBER","publisher":"MarketWatch","summary":"Shares of Uber Technologies Inc. inched 0.04% higher to $54.44 Friday, on what proved to be an all-around great trading session for the stock market, with...","url":"https://www.marketwatch.com/data-news/uber-technologies-inc-stock-rises-friday-still-underperforms-market-b63e1e46-9ff9ec009220"},{"category":"company","date":1700240853,"headline":"20 Largest Delivery Companies in the US","id":123950812,"image":"https://media.zenfs.com/en/insidermonkey.com/8f20ce0399eccac6e65120f51dcc6ac5","symbol":"UBER","publisher":"Yahoo","summary":"In this article, we will take a look at the 20 largest delivery companies in the US. If you want to skip our detailed analysis, you can go directly to the 5 Largest Delivery Companies in the US. Autonomous Delivery Systems May Be the Next Big Thing It is no surprise to see innovation seeping […]","url":"https://finance.yahoo.com/news/20-largest-delivery-companies-us-170733142.html"},{"category":"company","date":1700233191,"headline":"Is Uber Technologies (UBER) an Undisputed Global Leader in Ride Sharing?","id":123959116,"image":"https://media.zenfs.com/en/insidermonkey.com/3f0b9c492be823120fa61b99bf03060b","symbol":"UBER","publisher":"Yahoo","summary":"RiverPark Advisors, an investment advisory firm and sponsor of the RiverPark family of mutual funds, released its “RiverPark Large Growth Fund” third quarter 2023 investor letter. A copy of the same can be downloaded here. In the third quarter, markets performed poorly, and the S\u0026P 500 index (“S\u0026P”) and the Russell 1000 Growth Index (RLG) declined […]","url":"https://finance.yahoo.com/news/uber-technologies-uber-undisputed-global-145951070.html"},{"category":"company","date":1700222415,"headline":"Uber Technologies (NYSE:UBER) Might Have The Makings Of A Multi-Bagger","id":123959117,"image":"https://media.zenfs.com/en/simply_wall_st__316/976387f9691d9e9c613091b5dddac717","symbol":"UBER","publisher":"Yahoo","summary":"What are the early trends we should look for to identify a stock that could multiply in value over the long term...","url":"https://finance.yahoo.com/news/uber-technologies-nyse-uber-might-120015708.html"},{"category":"company","date":1700215483,"headline":"Uber Technologies Inc CEO Dara Khosrowshahi Sells 100,000 Shares","id":123959118,"image":"https://media.zenfs.com/en/us.finance.gurufocus/df62ec704da46e08ab9bb2e849b575ed","symbol":"UBER","publisher":"Yahoo","summary":"In a notable insider transaction, CEO Dara Khosrowshahi of Uber Technologies Inc (NYSE:UBER) sold 100,000 shares of the company on November 14, 2023.","url":"https://finance.yahoo.com/news/uber-technologies-inc-ceo-dara-100443772.html"},{"category":"company","date":1700213529,"headline":"Thinking about buying stock in Alibaba Group, Uber, Walt Disney Co, ChargePoint Holdings, or Scilex Holding?","id":123946901,"image":"","symbol":"UBER","publisher":"Finnhub","summary":"NEW YORK, Nov. 17, 2023 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BABA, UBER, DIS, CHPT, and SCLX. ...","url":"https://finnhub.io/api/news?id=68583f609c5c2103bc9e48ede26a4d31c1084fb5041a4343cef6cd562fc429ae"},{"category":"company","date":1700206080,"headline":"Williams-Sonoma, Uber And 2 Other Stocks Insiders Are Selling","id":123948765,"image":"","symbol":"UBER","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3217462089"},{"category":"company","date":1700204302,"headline":"Block: Squarely In My Crosshairs For An Undervalued Growth Stock","id":123944797,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1354968155/image_1354968155.jpg?io=getty-c-w1536","symbol":"UBER","publisher":"SeekingAlpha","summary":"Block, Inc. is a fintech company that has seen its stock price drop by 80%. Click here to see whether this is a potential buying opportunity.","url":"https://seekingalpha.com/article/4652635-block-crosshairs-undervalued-growth-stock"},{"category":"company","date":1700156160,"headline":"Uber Technologies Inc. stock rises Thursday, outperforms market","id":123962067,"image":"https://images.mktw.net/im-220105/social","symbol":"UBER","publisher":"MarketWatch","summary":"Shares of Uber Technologies Inc. rose 1.23% to $54.42 Thursday, on what proved to be an all-around mixed trading session for the stock market, with the...","url":"https://www.marketwatch.com/data-news/uber-technologies-inc-stock-rises-thursday-outperforms-market-c1392ed0-ed8a68625ac0"},{"category":"company","date":1700150419,"headline":"Here's Why I Would Never Start Rideshare Driving Without Considering These Major Financial Factors","id":123924371,"image":"","symbol":"UBER","publisher":"Yahoo","summary":"Driving for ride-hailing services is a popular side hustle. Keep reading for a few factors to consider before taking on this gig.","url":"https://finance.yahoo.com/m/60cdc69f-8759-3d94-957e-39589f06c19c/here%27s-why-i-would-never.html"},{"category":"company","date":1700129100,"headline":"Northern Right Capital Management, L.P. Bolsters Position in Great Elm Group Inc","id":123923004,"image":"","symbol":"UBER","publisher":"GuruFocus","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3215828736"},{"category":"company","date":1700106600,"headline":"7 Large-Cap Growth Stocks for Greedy Investors","id":123934530,"image":"","symbol":"UBER","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3216332311"},{"category":"company","date":1700074340,"headline":"Uber bolstering safety measures for drivers amid carjacking surge","id":123900045,"image":"https://s.yimg.com/ny/api/res/1.2/RvqBhQu7iZkH8Doj9D98XQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/fox_business_text_367/e7742be0018c308ede39722d2b5157a8","symbol":"UBER","publisher":"Yahoo","summary":"Uber announced it is expanding safety measures for drivers including rider verification amid a rise in carjackings and other crimes across the country.","url":"https://finance.yahoo.com/news/uber-bolstering-safety-measures-drivers-185220607.html"},{"category":"company","date":1700069760,"headline":"Uber Technologies Inc. stock falls Wednesday, underperforms market","id":123962068,"image":"https://images.mktw.net/im-220105/social","symbol":"UBER","publisher":"MarketWatch","summary":"Shares of Uber Technologies Inc. sank 0.22% to $53.76 Wednesday, on what proved to be an all-around favorable trading session for the stock market, with the...","url":"https://www.marketwatch.com/data-news/uber-technologies-inc-stock-falls-wednesday-underperforms-market-58307f6a-6c2654a92fa9"},{"category":"company","date":1700059701,"headline":"7 Stocks Most Likely to Follow in WeWork’s Woeful Footsteps","id":124017743,"image":"https://media.zenfs.com/en/investorplace_417/4c4000351d2ec7dc33b49c8d4c21e4db","symbol":"UBER","publisher":"Yahoo","summary":"WeWork’s (OTCMKTS:WEWKQ) spectacular failure and recent bankruptcy filing should serve as a cautionary tale for many other troubled stocks. It should also serve to renew efforts to reassess one’s portfolio and drop stocks that are bound to act as detractors overall. Investors don’t want to keep their capital behind those stocks, most likely to follow in WeWork’s footsteps. That path led the firm, once described by CEO Adam Neumann as “the world’s first physical social network,” from a peak valua","url":"https://finance.yahoo.com/news/7-stocks-most-likely-wework-144821497.html"},{"category":"company","date":1700056810,"headline":"Investors Heavily Search Uber Technologies, Inc. (UBER): Here is What You Need to Know","id":123900047,"image":"https://media.zenfs.com/en/zacks.com/21b1f011539d3e31c28282071d344177","symbol":"UBER","publisher":"Yahoo","summary":"Recently, Zacks.com users have been paying close attention to Uber (UBER). This makes it worthwhile to examine what the stock has in store.","url":"https://finance.yahoo.com/news/investors-heavily-search-uber-technologies-140010985.html"},{"category":"company","date":1700050980,"headline":"Arrival (ARVL) Stock Soars on News of Potential Sale","id":123906246,"image":"","symbol":"UBER","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3214149581"},{"category":"company","date":1700040924,"headline":"Here’s Why You Should Keep an Eye on Uber Technologies (UBER)","id":123900048,"image":"https://media.zenfs.com/en/insidermonkey.com/f0cec49aa344ee185df4efe615e2e57d","symbol":"UBER","publisher":"Yahoo","summary":"Polen Capital, an investment management firm, released its “Polen U.S. Opportunistic High Yield Fund” third quarter 2023 investor letter, a copy of which can be downloaded here. The fund yielded a gross total return of 1.68% in the third quarter, surpassing the ICE BofA U.S. High Yield Index by 115 basis points. The rise in U.S. […]","url":"https://finance.yahoo.com/news/why-keep-eye-uber-technologies-093524988.html"},{"category":"company","date":1700035260,"headline":"See Which Of The Latest 13F Filers Holds Uber Technologies","id":123906911,"image":"","symbol":"UBER","publisher":"Preferred Stock Channel","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3213784925"},{"category":"company","date":1700034540,"headline":"Tepper’s Appaloosa dumps Apple stake and loads up on Amazon’s stock","id":123893106,"image":"","symbol":"UBER","publisher":"MarketWatch","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3213769235"},{"category":"company","date":1700023880,"headline":"UBER, TTD, OTEX: 3 “Strong Buy” Tech Stocks Set for More Gains","id":123900049,"image":"https://media.zenfs.com/en/tipranks_452/c28851694a144be748b24fb9aa5a9fcb","symbol":"UBER","publisher":"Yahoo","summary":"Stocks have heated up in a hurry this month, recovering a big chunk of the ground lost during the September-October market correction. With rates on the retreat and stocks on the mend, Strong-Buy-rated tech stocks outside of the red-hot Magnificent Seven group — such as UBER, TTD, and OTEX — may finally be in a spot to lead the markets higher into the new year. As the so-called Magnificent Seven continue flexing their muscles, the real question is whether the rest of tech can catch up or even ma","url":"https://finance.yahoo.com/news/uber-ttd-otex-3-strong-045120817.html"},{"category":"company","date":1699991366,"headline":"3 Tech Stocks For Your November 2023 Watchlist","id":123870308,"image":"https://u3j7m9h7.rocketcdn.me/wp-content/uploads/2023/11/tech-stocks-1.jpg","symbol":"UBER","publisher":"StockMarket","summary":"Tech stocks to watch this month.","url":"https://stockmarket.com/featured/3-tech-stocks-for-your-november-2023-watchlist-2023-11-14"},{"category":"company","date":1699991234,"headline":"After fire kills 3, NYC officials say retailers, delivery apps must do more to ensure e-bike safety","id":123883145,"image":"https://s.yimg.com/ny/api/res/1.2/FeJo1IAjQi_V4KKOYbQaow--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/ap_finance_articles_694/e5877f1c6e894aea17839435dc6f1e9d","symbol":"UBER","publisher":"Yahoo","summary":"New York City officials say retailers and food delivery companies must do more to halt the proliferation of unsafe e-bike and e-scooter batteries, after a fire blamed on an electric scooter's lithium ion battery killed three people over the weekend.  “There is blood on the hands of this private industry,” Fire Commissioner Laura Kavanagh said at a news conference Monday in front of the charred remains of the Brooklyn row house where the early Sunday blaze killed Albertha West, 81, her son Michael West, 58, and her grandson Jamiyl West, 33.  “It’s extensively damaged,” Kavanagh said, adding that the battery that sparked the fire was for a “scooter of some kind.”","url":"https://finance.yahoo.com/news/fire-kills-3-nyc-officials-194714177.html"},{"category":"company","date":1699983360,"headline":"Uber Technologies Inc. stock rises Tuesday, outperforms market","id":123962069,"image":"https://images.mktw.net/im-220105/social","symbol":"UBER","publisher":"MarketWatch","summary":"Shares of Uber Technologies Inc. rallied 3.14% to $53.88 Tuesday, on what proved to be an all-around favorable trading session for the stock market, with the...","url":"https://www.marketwatch.com/data-news/uber-technologies-inc-stock-rises-tuesday-outperforms-market-2f374ffc-cc48d29bec9a"},{"category":"company","date":1699975773,"headline":"Dow Jones Surges 500 Points On Cool Inflation Report; Tesla Stock Rallies On Price Hikes","id":123860693,"image":"https://media.zenfs.com/en/ibd.com/55ca4252bd7c66820fc61ce444908e68","symbol":"UBER","publisher":"Yahoo","summary":"The Dow Jones surged over 500 points Tuesday on a cool CPI inflation report. Tesla stock rallied after the company raised prices on some China-made cars.","url":"https://finance.yahoo.com/m/b254f03d-7803-3125-a55c-92c4ce28777e/dow-jones-surges-500-points.html"},{"category":"company","date":1699972774,"headline":"Meta Has More Wall Street Fans Than Ever as Rally Nears 300%","id":123862894,"image":"https://media.zenfs.com/en/bloomberg_markets_842/773316b365df1e69fe5576f08276079c","symbol":"UBER","publisher":"Yahoo","summary":"(Bloomberg) -- For Meta Platforms Inc. bulls, the biggest one-day stock wipeout in history is a fading sight in the rear-view mirror.Most Read from BloombergBiden, Xi to Announce China’s Crackdown on Fentanyl TradeThailand Takes $28 Billion Malacca Strait Bypass Plan to USS\u0026P 500 Up 2% as Yields Tumble After CPI Surprise: Markets WrapRolex, Patek Prices Hit Fresh Two-Year Lows: Subdial IndexWall Street Divided Over Just How Aggressive Fed Cutting Will BeThe Facebook owner’s shares have nearly qu","url":"https://finance.yahoo.com/news/meta-more-wall-street-fans-114239631.html"},{"category":"company","date":1699972468,"headline":"UPDATE 2-UK tells Uber Eats, Deliveroo and Just Eat to tighten rider account controls","id":123867964,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"UBER","publisher":"Yahoo","summary":"Britain's interior ministry has told food delivery firms Uber Eats, Deliveroo and Just Eat to implement stricter controls to end the practice of unchecked account sharing by their drivers and riders over worries about illegal and underage workers.  Food delivery companies make initial checks on those who want to work for them, ensuring their age and their legal right to work in Britain.  \"Unchecked account sharing places the public at risk, enables - and therefore encourages - illegal migration, and leads to the exploitation of workers,\" Immigration Minister Robert Jenrick said in a statement after he met the three companies on Tuesday.","url":"https://finance.yahoo.com/news/1-uk-tells-uber-eats-143428029.html"},{"category":"company","date":1699972206,"headline":"Why This 1 Computer and Technology Stock Could Be a Great Addition to Your Portfolio","id":123867965,"image":"https://media.zenfs.com/en/zacks.com/46ebfcbff417ac1bbde85ad33fa0d4be","symbol":"UBER","publisher":"Yahoo","summary":"Wondering how to pick strong, market-beating stocks for your investment portfolio? Look no further than the Zacks Focus List.","url":"https://finance.yahoo.com/news/why-1-computer-technology-stock-143006990.html"},{"category":"company","date":1699971868,"headline":"UK tells Uber Eats, Deliveroo and Just Eat to tighten rider account controls","id":123867966,"image":"https://media.zenfs.com/en/reuters-finance.com/0443f2478226adc219808ca917a65cf0","symbol":"UBER","publisher":"Yahoo","summary":"LONDON (Reuters) -Britain's interior ministry has told food delivery firms Uber Eats, Deliveroo and Just Eat to implement stricter controls to end the practice of unchecked account sharing by their drivers and riders over worries about illegal and underage workers.  Food delivery companies make initial checks on those who want to work for them, ensuring their age and their legal right to work in Britain.  \"Unchecked account sharing places the public at risk, enables - and therefore encourages - illegal migration, and leads to the exploitation of workers,\" Immigration Minister Robert Jenrick said in a statement after he met the three companies on Tuesday.","url":"https://finance.yahoo.com/news/uk-tells-uber-eats-deliveroo-142428115.html"},{"category":"company","date":1699964580,"headline":"Uber's S\u0026P 500 Inclusion Is Imminent, Says Tesla Analyst, Hints At More Upside For The Stock","id":123865975,"image":"","symbol":"UBER","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3211489411"},{"category":"company","date":1699962120,"headline":"What You Missed On Wall Street This Morning","id":123865161,"image":"","symbol":"UBER","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3212204635"},{"category":"company","date":1699956557,"headline":"Food delivery apps urged to reform after reports of children working as riders","id":123857367,"image":"https://s.yimg.com/ny/api/res/1.2/wgy1UY3fhLlzY9wHsjXINA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/snappa.ukfinance/e5b74123e48a4af7bc544bc3cf85e85a","symbol":"UBER","publisher":"Yahoo","summary":"Deliveroo, Just Eat and Uber Eats couriers have self-employed status and can therefore get others to deliver for them.","url":"https://uk.finance.yahoo.com/news/food-delivery-apps-urged-reform-100917561.html"},{"category":"company","date":1699953660,"headline":"Analysts Are Bullish on Top Technology Stocks: Uber Technologies (UBER), Monday.com (MNDY)","id":123865978,"image":"","symbol":"UBER","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3212004844"},{"category":"company","date":1699953584,"headline":"Only on Uber : becoming the best – and fairest – platform for flexible work","id":123859246,"image":"","symbol":"UBER","publisher":"Finnhub","summary":"Every month, more than 6.5 million drivers and couriers deliver magical experiences to customers around the globe. We owe it to them to keep innovating towards our goal of being the...","url":"https://finnhub.io/api/news?id=3e4a7be0f5d1222ccaecbf528435fd60b28222d79a7d6778b3f2f2d8a1409e31"},{"category":"company","date":1699952640,"headline":"Robert Karr's Joho Capital Makes a Bold Move with NEXTracker Inc, Holding 6.46% Stake","id":123861087,"image":"","symbol":"UBER","publisher":"GuruFocus","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3211980870"},{"category":"company","date":1699947300,"headline":"Third Point buys T-Mobile, boosts Microsoft in Q3","id":123881887,"image":"","symbol":"UBER","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3212973677"},{"category":"company","date":1699946460,"headline":"Uber, Deere, Cadence Design And More On CNBC's 'Final Trades'","id":123864314,"image":"","symbol":"UBER","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3211848469"},{"category":"company","date":1699944000,"headline":"Uber plans test of TaskRabbit-like service in select markets, Bloomberg reports","id":123865982,"image":"","symbol":"UBER","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3211800959"},{"category":"company","date":1699941840,"headline":"Mario Cibelli's Marathon Partners Exits World Wrestling Entertainment, Reveals Q3 Portfolio Changes","id":123862294,"image":"","symbol":"UBER","publisher":"GuruFocus","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3211763108"},{"category":"company","date":1699937940,"headline":"Soros snaps up tech stocks in Q3, but dumps some of the biggest names, along with Rivian","id":123878103,"image":"","symbol":"UBER","publisher":"MarketWatch","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3212701630"},{"category":"company","date":1699934820,"headline":"Here’s what could be different about Black Friday this year","id":123864645,"image":"","symbol":"UBER","publisher":"MarketWatch","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3211657349"},{"category":"company","date":1699934220,"headline":"Corvex Management adds Endeavor Group, exits Catalent","id":123875456,"image":"","symbol":"UBER","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3212595810"},{"category":"company","date":1699932540,"headline":"What You Missed On Wall Street On Tuesday","id":123873285,"image":"","symbol":"UBER","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3212549124"},{"category":"company","date":1699931424,"headline":"11 Hot Tech Stocks to Buy Now","id":123852146,"image":"https://media.zenfs.com/en/insidermonkey.com/4728959910c58e6d66ef3bc0a02e47cf","symbol":"UBER","publisher":"Yahoo","summary":"In this article, we will take a look at the 11 hot tech stocks to buy now. To skip our analysis of the recent technology trends, and market activity, you can go directly to see the 5 Hot Tech Stocks to Buy Now. The technology sector is going through a major transition with the advent […]","url":"https://finance.yahoo.com/news/11-hot-tech-stocks-buy-031024115.html"},{"category":"company","date":1699926780,"headline":"EXCLUSIVE: Blockchain Is 'Undeniably Part Of The Next Big Wave' In Tech Revolution","id":123871373,"image":"","symbol":"UBER","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3212402539"},{"category":"company","date":1699919349,"headline":"Uber to Test TaskRabbit-Like Service in Florida and Alberta","id":123852729,"image":"https://s.yimg.com/ny/api/res/1.2/JX.pFI4vx.3sAA6cqimW8g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDE-/https://media.zenfs.com/en/bloomberg_technology_68/77a862b04fbef9ab8cee2b49956e0986","symbol":"UBER","publisher":"Yahoo","summary":"(Bloomberg) -- Uber Technologies Inc. is launching a mini-pilot program for a TaskRabbit-like service that will let app users hire people to complete various household tasks, part of an effort by the ride-hailing company to expand beyond driving and deliveries.Most Read from BloombergWall Street Divided Over Just How Aggressive Fed Cutting Will BeUBS Strategists See Far Deeper Fed Rate Cuts Than What Markets Are PricingIsrael Latest: Yellen Sees Limited Global Economic Impact So FarChina Weighs","url":"https://finance.yahoo.com/news/uber-test-taskrabbit-florida-alberta-234909953.html"},{"category":"company","date":1699917060,"headline":"Uber is making a big change that will impact both drivers and riders","id":123852731,"image":"https://s.yimg.com/ny/api/res/1.2/tL_UVe.h7MFFBmQp_0ZloA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/thestreet.com/139336c06abcb96c78dbc1a4f054c66b","symbol":"UBER","publisher":"Yahoo","summary":"Uber is cracking down on unfair driver deactivations and ratings that are caused by false allegations from customers.  The company announced in a Nov. 13 blog post that it's rolling out new features for Uber and Uber Eats apps to make sure that driver deactivations are \"fair, accurate, and transparent.\"  \"We strive to promote safety for everyone who uses Uber — but the reality is that people sometimes make false accusations, often with the intent of getting a refund from Uber.\"","url":"https://finance.yahoo.com/m/f7a56ba1-75d2-3e8e-8b90-c62f24d96f9f/uber-is-making-a-big-change.html"},{"category":"company","date":1699916024,"headline":"A Roadmap For DoorDash In Times Of Slower Growth","id":123852029,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/455192274/image_455192274.jpg?io=getty-c-w1536","symbol":"UBER","publisher":"SeekingAlpha","summary":"DoorDash's financial review shows decelerated revenue growth but improved profitability, with a record-low net loss and margin. Find out why DASH stock is a Buy.","url":"https://seekingalpha.com/article/4651400-a-roadmap-for-doordash-in-times-of-slower-growth"},{"category":"company","date":1699910898,"headline":"16 Stocks Hedge Funds and Wall Street Analysts Are Crazy About","id":123847015,"image":"https://media.zenfs.com/en/insidermonkey.com/9ab9d43b226731590760a54e378251e5","symbol":"UBER","publisher":"Yahoo","summary":"In this article, we discuss 16 stocks hedge funds and Wall Street analysts are crazy about. If you want to see more stocks in this selection, check out 5 Stocks Hedge Funds and Wall Street Analysts Are Crazy About. Equity markets have been on a roll, with major indices recouping all the losses accrued last year […]","url":"https://finance.yahoo.com/news/16-stocks-hedge-funds-wall-212818401.html"},{"category":"company","date":1699910367,"headline":"Billionaire David Shaw’s Quant Models Love These 15 Stocks","id":123848100,"image":"https://media.zenfs.com/en/insidermonkey.com/ff4092c04af2420e81c6b7504497b32f","symbol":"UBER","publisher":"Yahoo","summary":"In this article, we discuss billionaire David Shaw’s quant models that love these 15 stocks. You can skip our detailed analysis of David Shaw’s quant models and go directly to read Billionaire David Shaw’s Quant Models Love These 5 Stocks. Quantitative investing proved to be the real deal as equity markets fell, with the S\u0026P 500 […]","url":"https://finance.yahoo.com/news/billionaire-david-shaw-quant-models-211927154.html"},{"category":"company","date":1699909975,"headline":"13 Best Tech Stocks to Buy According To Billionaire Laffont","id":123845717,"image":"https://media.zenfs.com/en/insidermonkey.com/586bc91b3deb0c7856dee8bc06d100b6","symbol":"UBER","publisher":"Yahoo","summary":"In this article, we will take a look at the 13 best tech stocks to buy according to billionaire Laffont. To see more such companies, go directly to 5 Best Tech Stocks to Buy According To Billionaire Laffont. Starting as an analyst at McKinsey and Company, billionaire Philippe Laffont has established himself as a top […]","url":"https://finance.yahoo.com/news/13-best-tech-stocks-buy-211255134.html"},{"category":"company","date":1699905091,"headline":"10 Best Technology Stocks to Buy According to Giant Quant Hedge Fund","id":123844101,"image":"https://media.zenfs.com/en/insidermonkey.com/99e80de1fd49af5890139d07dc745fa0","symbol":"UBER","publisher":"Yahoo","summary":"In this piece, we will take a look at 10 best technology stocks to buy according to giant quant hedge fund. For more stocks, head on over to 5 Best Technology Stocks to Buy According to Giant Quant Hedge Fund. Computer and technology stocks have cooled off in recent months as investors remain wary about the […]","url":"https://finance.yahoo.com/news/10-best-technology-stocks-buy-195131774.html"},{"category":"company","date":1699900476,"headline":"Uber takes steps to combat unfair driver deactivations","id":123852737,"image":"https://techcrunch.com/wp-content/uploads/2019/11/GettyImages-1137478531.jpg?resize=1200,800","symbol":"UBER","publisher":"Yahoo","summary":"Uber is introducing new features geared toward addressing the issues of unfair deactivations that ride-hail and delivery drivers often face. Starting Monday across the U.S., Uber will roll out a technology that identifies riders or Uber Eats customers who consistently give bad ratings or feedback with the intent of getting a refund. Allegations by those customers, the company said in a blog post, won't be considered in drivers' ratings or deactivation decisions. The ride-hail giant is also expan","url":"https://techcrunch.com/2023/11/13/uber-takes-steps-to-combat-unfair-driver-deactivations/"},{"category":"company","date":1699896996,"headline":"Uber Technologies Inc (UBER) Posts Strong Earnings with Record Adjusted EBITDA in Q3 2023","id":123837319,"image":"https://media.zenfs.com/en/us.finance.gurufocus/df62ec704da46e08ab9bb2e849b575ed","symbol":"UBER","publisher":"Yahoo","summary":"Accelerated Trip Growth and Operational Efficiency Drive Profitability","url":"https://finance.yahoo.com/news/uber-technologies-inc-uber-posts-173636032.html"},{"category":"company","date":1699896960,"headline":"Uber Technologies Inc. stock rises Monday, outperforms market","id":123876354,"image":"https://images.mktw.net/im-220105/social","symbol":"UBER","publisher":"MarketWatch","summary":"Shares of Uber Technologies Inc. rallied 1.28% to $52.24 Monday, on what proved to be an all-around mixed trading session for the stock market, with the Dow...","url":"https://www.marketwatch.com/data-news/uber-technologies-inc-stock-rises-monday-outperforms-market-b153da5f-f447c565afa2"},{"category":"company","date":1699896786,"headline":"Uber Technologies Inc (UBER) Reports Accelerated Growth and Record Profits in Q3 2023","id":123837320,"image":"https://media.zenfs.com/en/us.finance.gurufocus/df62ec704da46e08ab9bb2e849b575ed","symbol":"UBER","publisher":"Yahoo","summary":"Net Income Hits $221 Million with Adjusted EBITDA Margin Reaching New Heights","url":"https://finance.yahoo.com/news/uber-technologies-inc-uber-reports-173306640.html"},{"category":"company","date":1699888351,"headline":"Dow Jones Falls On Moody's Debt Warning; Boeing Stock Surges On $52 Billion Order","id":123833302,"image":"https://media.zenfs.com/en/ibd.com/8e3f0f90c622d76c522be98b9f3975ee","symbol":"UBER","publisher":"Yahoo","summary":"The Dow Jones Industrial Average dropped Monday on Moody's U.S. debt warning. Aerospace giant Boeing surged on a $52 billion order.","url":"https://finance.yahoo.com/m/5863024f-43a4-307c-86ff-d9b9347c0210/dow-jones-falls-on-moody%27s.html"},{"category":"company","date":1699888500,"headline":"Drizly Debuts New Marketing Campaign and Launches Its First-Ever Gift Registry To Help People Find the Right Drinks for the Moment","id":123836203,"image":"https://media.zenfs.com/en/prnewswire.com/dd7bea92e633e3a766379c5cf40d5cb3","symbol":"UBER","publisher":"Yahoo","summary":"Drizly, an Uber Company (NYSE:UBER), today announced the launch of its new \"What's It Gonna Be?\" marketing campaign. As the go-to online beer, wine and spirits marketplace, the campaign showcases how the beverage alcohol e-commerce pioneer helps people find the right drink for the moment - from the everyday, to holidays and special occasions.","url":"https://finance.yahoo.com/news/drizly-debuts-marketing-campaign-launches-151500022.html"},{"category":"company","date":1699874460,"headline":"Uber Technologies Inc (UBER) Reports Strong Growth and Record Profitability in Q3 2023","id":123841158,"image":"","symbol":"UBER","publisher":"GuruFocus","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3210199693"},{"category":"company","date":1699869900,"headline":"Drizly asks ‘What’s It Gonna Be?’ with game show campaign, gift registry","id":123836204,"image":"https://www.marketingdive.com/imgproxy/JvFi3sLLo9AWLN00r1nxqB9xBRqMfF61umpWvJkYxmg/g:ce/rs:fill:770:435:0/bG9jYWw6Ly8vZGl2ZWltYWdlL1BSX1dJR0JMYXVuY2hfSW1hZ2UwMV9OSl9GSU5BTC5qcGc.jpg","symbol":"UBER","publisher":"Yahoo","summary":"Gina Hardy, chief customer officer for the Uber-owned alcohol e-commerce platform, explained how the brand is evolving to meet consumer habits.","url":"https://www.marketingdive.com/news/drizly-holiday-campaign-gift-registry-game-show-joel-mchale/699061/"},{"category":"company","date":1699863120,"headline":"Cramer Says This Cybersecurity Company Is 'Doing Terrific,' He Expects A 'Very Good Quarter'","id":123834723,"image":"","symbol":"UBER","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3209944229"},{"category":"company","date":1699853553,"headline":"Didi Posts First Profit Since 2021 Ahead of Landmark HK IPO","id":123832782,"image":"https://s.yimg.com/ny/api/res/1.2/4Eaq2Wq2cbjTjyfWEGAyzA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_markets_842/f5ff60854692da61b287c700ddf1800b","symbol":"UBER","publisher":"Yahoo","summary":"(Bloomberg) -- Didi Global Inc. posted its first profit since 2021, sustaining the Chinese ride-hailing leader’s gradual recovery ahead of a 2024 Hong Kong listing. Most Read from BloombergChina Weighs Ending Freeze on Boeing With 737 Max Deal in USIceland Girds for Volcanic Eruption That Could Wipe Out TownBiden Has Wiped Away $127 Billion in Student Loan DebtSunak Fires Braverman and Names David Cameron Foreign SecretaryGoldman Sachs, Morgan Stanley Diverge on Fed Rate-Cut ForecastsChina’s ans","url":"https://finance.yahoo.com/news/didi-posts-first-profit-since-053233295.html"},{"category":"company","date":1699844580,"headline":"What 12 Analyst Ratings Have To Say About Uber Technologies","id":123865988,"image":"","symbol":"UBER","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3210541959"},{"category":"company","date":1699844100,"headline":"These 12 AI Stocks Remain Above 100% YTD","id":123847187,"image":"","symbol":"UBER","publisher":"TalkMarkets","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3210526807"},{"category":"company","date":1699842420,"headline":"APEC summit could be beneficial for US-China trade","id":123843795,"image":"","symbol":"UBER","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3210481550"},{"category":"company","date":1699838700,"headline":"Four stocks to invest on the second half of the year","id":123841161,"image":"","symbol":"UBER","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3210385288"},{"category":"company","date":1699830259,"headline":"GM/Cruise: Down But Not Out","id":123828642,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1608040697/image_1608040697.jpg?io=getty-c-w1536","symbol":"UBER","publisher":"SeekingAlpha","summary":"Cruise has the potential to be worth more than GM is today. Click here to see why it is a unique long-term investment opportunity.","url":"https://seekingalpha.com/article/4651077-gmcruise-down-but-not-out"},{"category":"company","date":1699788960,"headline":"JMP Securities Sticks to Its Buy Rating for Uber Technologies (UBER)","id":123841162,"image":"","symbol":"UBER","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3209560563"},{"category":"company","date":1699707634,"headline":"Is There An Opportunity With Uber Technologies, Inc.'s (NYSE:UBER) 49% Undervaluation?","id":123814686,"image":"https://media.zenfs.com/en/simply_wall_st__316/976387f9691d9e9c613091b5dddac717","symbol":"UBER","publisher":"Yahoo","summary":"Key Insights The projected fair value for Uber Technologies is US$102 based on 2 Stage Free Cash Flow to Equity Current...","url":"https://finance.yahoo.com/news/opportunity-uber-technologies-inc-nyse-130034850.html"},{"category":"company","date":1699678418,"headline":"Strong Mid-Cap Insider Buys: Q3 2023","id":123808340,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1651064790/image_1651064790.jpg?io=getty-c-w1536","symbol":"UBER","publisher":"SeekingAlpha","summary":"The article discusses sizable mid-cap insider purchases in Q3 of this calendar year. Explore more details here.","url":"https://seekingalpha.com/article/4650671-strong-mid-cap-insider-buys-q3-2023"},{"category":"company","date":1699655940,"headline":"The Score: Uber, Warner Bros. Discovery, Take-Two Interactive Software and More Stocks That Defined the Week","id":123799304,"image":"","symbol":"UBER","publisher":"Yahoo","summary":"Uber  and  Lyft  latest earnings told a tale of two ride-share apps.  Uber on Tuesday beat earnings expectations, officially reporting enough positive earnings to qualify the company to join the S\u0026P 500.  Uber said both its ride-hailing and food-delivery businesses grew in the third quarter.","url":"https://finance.yahoo.com/m/b1327d07-dbf3-3dbb-8f8a-f46723a0a17f/the-score%3A-uber%2C-warner-bros..html"},{"category":"company","date":1699637760,"headline":"Uber Technologies Inc. stock rises Friday, outperforms market","id":123821283,"image":"https://images.mktw.net/im-220105/social","symbol":"UBER","publisher":"MarketWatch","summary":"Shares of Uber Technologies Inc. advanced 3.06% to $51.58 Friday, on what proved to be an all-around positive trading session for the stock market, with the...","url":"https://www.marketwatch.com/data-news/uber-technologies-inc-stock-rises-friday-outperforms-market-285a8be5-4a814561d142"},{"category":"company","date":1699636140,"headline":"UBER's Q3 Earnings and Revenues Miss Estimates, Rise Y/Y","id":123792888,"image":"https://media.zenfs.com/en/zacks.com/c72948d9110c781347c525891307628f","symbol":"UBER","publisher":"Yahoo","summary":"UBER's third-quarter 2023 earnings and revenues improve year over year.","url":"https://finance.yahoo.com/news/ubers-q3-earnings-revenues-miss-170900389.html"},{"category":"company","date":1699634580,"headline":"Missed your flight? Ride-share company commits to offering compensation","id":123789802,"image":"","symbol":"UBER","publisher":"Yahoo","summary":"'Every minute counts when you're on the way to the airport,' Lyft's CEO tells travelers.","url":"https://finance.yahoo.com/m/4a1ad342-bdb5-3097-a98f-49fffb6ce12d/missed-your-flight%3F.html"},{"category":"company","date":1699632000,"headline":"Autonomous trucking: ‘What’s love got to do with it?’","id":123789803,"image":"https://media.zenfs.com/en/freightwaves_373/d7dcb1e40facc177e169099fbce8f61e","symbol":"UBER","publisher":"Yahoo","summary":"Uber Freight has more than 100 shipper companies lined up to run autonomous freight, but the capacity just doesn't exist yet. The post Autonomous trucking: ‘What’s love got to do with it?’ appeared first on FreightWaves.","url":"https://finance.yahoo.com/news/autonomous-trucking-love-got-160000802.html"},{"category":"company","date":1699629086,"headline":"Dow Jones Rises After Inflation Report; Trade Desk Crashes On Earnings","id":123787544,"image":"https://media.zenfs.com/en/ibd.com/af3d8bf275f34dd771b1551f1766e265","symbol":"UBER","publisher":"Yahoo","summary":"The Dow Jones rose Friday after an inflation report from the University of Michigan. Trade Desk crashed on a disappointing outlook.","url":"https://finance.yahoo.com/m/25f2d41a-1a8b-3c6a-88d8-4683420819d0/dow-jones-rises-after.html"},{"category":"company","date":1699618740,"headline":"Why These 3 Names Should Be on Your Stocks to Sell List","id":123798009,"image":"","symbol":"UBER","publisher":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3206708951"},{"category":"company","date":1699615800,"headline":"1 Magnificent Stock That Could Join Apple, Microsoft, Amazon, Alphabet, and Nvidia in the $1 Trillion Club","id":123783484,"image":"https://s.yimg.com/ny/api/res/1.2/uIUz657aWZNMwfrz58oSZg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/motleyfool.com/595fd9e5715ab49385fb6da926a9d23e","symbol":"UBER","publisher":"Yahoo","summary":"In 2018, Apple became the first business with a $1 trillion valuation.  Apple has since been followed into the $1 trillion club by Microsoft, Amazon, Google parent Alphabet, and Nvidia -- and I think there's one more that could join them.  Uber Technologies (NYSE: UBER) operates the world's largest ride-hailing platform, but the company is set for a major transformation thanks to artificial intelligence (AI) and autonomous vehicles.","url":"https://finance.yahoo.com/m/901cae1c-914f-33a9-8c5e-a720bbe96910/1-magnificent-stock-that.html"},{"category":"company","date":1699612227,"headline":"Lyft: Still Hold; Still In Uber's Shadow","id":123787770,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1497731066/image_1497731066.jpg?io=getty-c-w1536","symbol":"UBER","publisher":"SeekingAlpha","summary":"Lyft continues to trail Uber, underperforming the rival with bookings this quarter. Click here to find out why we maintain our hold rating on LYFT stock.","url":"https://seekingalpha.com/article/4650350-lyft-still-hold-in-uber-shadow"},{"category":"company","date":1699611720,"headline":"3 Reasons Uber's Profit Growth Trend Will Persist","id":123789806,"image":"","symbol":"UBER","publisher":"Yahoo","summary":"Don't sweat last quarter's revenue shortfall too much. Take a step back and look at the bigger picture.","url":"https://finance.yahoo.com/m/e4ed08bb-4270-3022-9b73-786e9f3ef7c8/3-reasons-uber%27s-profit.html"},{"category":"company","date":1699600020,"headline":"Qualcomm, Merck And 2 Other Stocks Insiders Are Selling","id":123789386,"image":"","symbol":"UBER","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3206293365"},{"category":"company","date":1699594260,"headline":"Analysts Are Bullish on These Technology Stocks: Zai Lab (ZLAB), Navitas Semiconductor (NVTS)","id":123789387,"image":"","symbol":"UBER","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3206199992"},{"category":"company","date":1699575069,"headline":"Uber (NYSE:UBER) is at an Inflection Point. Time to Buy?","id":123789807,"image":"https://media.zenfs.com/en/tipranks_452/29f568ae8fd943436302c9a7f10e28e3","symbol":"UBER","publisher":"Yahoo","summary":"Uber Technologies (NYSE:UBER), the global leader in the ridesharing industry, reported third-quarter earnings that missed Wall Street estimates. The company also missed revenue estimates for the quarter, but its shares held up well in the market, with the company nearing an inflection point in its story. Ever since its market debut in 2019, many investors have been skeptical about Uber’s potential to turn a profit, but the third quarter marked the second consecutive quarter of GAAP profitability","url":"https://finance.yahoo.com/news/uber-nyse-uber-inflection-point-001109696.html"},{"category":"company","date":1699547400,"headline":"Uber: Sell The Surge And Cash In On A Great Run (Rating Downgrade)","id":123763230,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1502994711/image_1502994711.jpg?io=getty-c-w1536","symbol":"UBER","publisher":"SeekingAlpha","summary":"Uber Technologies, Inc. has been a spectacular market outperformer, delivering a 1-year total return of over 80%. Learn more about UBER stock now.","url":"https://seekingalpha.com/article/4649881-uber-sell-the-surge-and-cash-in-on-a-great-run-rating-downgrade"},{"category":"company","date":1699541034,"headline":"Dow Jones Rises After Jobless Claims; Nvidia Is Breaking Out Today With Powell Speech Next","id":123755456,"image":"https://media.zenfs.com/en/ibd.com/55ca4252bd7c66820fc61ce444908e68","symbol":"UBER","publisher":"Yahoo","summary":"The Dow Jones rose Thursday after initial jobless claims. Nvidia stock is breaking out today, while Fed chief Powell will speak later.","url":"https://finance.yahoo.com/m/2ec0f5d5-fc1e-3618-9dc4-d4c166df576d/dow-jones-rises-after-jobless.html"},{"category":"company","date":1699537111,"headline":"NYC Uber Eats driver accused of fleeing after hitting 9-year-old boy who just got off bus","id":123770149,"image":"https://media.zenfs.com/en/fox_business_text_367/858b7de755d191a1c62d854937e472aa","symbol":"UBER","publisher":"Yahoo","summary":"Police in New York City are looking for the person delivering an Uber Eats order who ran into a 9-year-old boy getting off a school bus Wednesday night.","url":"https://finance.yahoo.com/news/nyc-uber-eats-driver-accused-133831189.html"},{"category":"company","date":1699536454,"headline":"Uber Stock Butterfly Option Trade Can Return Much More Than It Risks","id":123770152,"image":"https://media.zenfs.com/en/ibd.com/1c73551068a466d47c101898d800b929","symbol":"UBER","publisher":"Yahoo","summary":"A butterfly is a neutral, income-oriented strategy.  It is a limited risk and limited profit trade. But on a typical butterfly trade, the profit potential is higher than the potential loss. Butterfly spreads involve three option strike prices, all within the same expiration date.","url":"https://finance.yahoo.com/m/d47213a8-9a4a-334f-af19-e8cd3cb1b2a4/uber-stock-butterfly-option.html"},{"category":"company","date":1699533060,"headline":"Food Stamps: 6 Delivery Services That Accept SNAP","id":123768619,"image":"https://s.yimg.com/ny/api/res/1.2/oYHJJpkWekv.q8Yz7Byzgg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/gobankingrates_644/ab676127ea51e151d57710542f4127fa","symbol":"UBER","publisher":"Yahoo","summary":"Millions of Americans rely on the Supplemental Nutrition Assistance Program (SNAP), a federal program that provides monthly food benefits to low-income households to supplement their grocery budget....","url":"https://finance.yahoo.com/news/food-stamps-6-delivery-services-123100920.html"},{"category":"company","date":1699529280,"headline":"5 Analysts Dissect Lyft Strategy: October 'Sustained Strength' Bodes Well For Q4","id":123762114,"image":"","symbol":"UBER","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3204459436"},{"category":"company","date":1699527660,"headline":"Four stocks to consider investing in before the year-end","id":123758398,"image":"","symbol":"UBER","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3204414776"},{"category":"company","date":1699522500,"headline":"How Uber built its TikTok creator strategy — and why it looks beyond vanity metrics","id":123770159,"image":"https://www.marketingdive.com/imgproxy/-VzEaVfGlsq2D0IxjxFLkWhKhtlB918brFYHA1zgwpk/crop:4718:2665/g:nowe:0:480/rs:fill:770:435:0/bG9jYWw6Ly8vZGl2ZWltYWdlL0dldHR5SW1hZ2VzLTE0NTQ0MzU3MzAuanBn.jpg","symbol":"UBER","publisher":"Yahoo","summary":"Phil Rosario, Uber’s global social media lead for TikTok, explains how he leveraged creators to grow the brand’s following to over 750,000 within a year.","url":"https://www.marketingdive.com/news/uber-tiktok-creator-strategy-vanity-metrics-grin/699241/"},{"category":"company","date":1699519500,"headline":"Polen U.S. Opportunistic High Yield Q3 2023 Commentary","id":123754338,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1351571961/image_1351571961.jpg?io=getty-c-w1536","symbol":"UBER","publisher":"SeekingAlpha","summary":"The Polen Credit U.S. Opportunistic High Yield Composite outperformed the ICE BofA U.S. High Yield Index in Q3 2023. Click here to read the full fund letter.","url":"https://seekingalpha.com/article/4649689-polen-us-opportunistic-high-yield-q3-2023-commentary"},{"category":"company","date":1699516800,"headline":"Lyft price target raised to $12 from $11 at Roth MKM","id":123762120,"image":"","symbol":"UBER","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3204125928"},{"category":"company","date":1699511760,"headline":"Instacart price target raised to $31 from $30 at BofA","id":123764216,"image":"","symbol":"UBER","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3204015203"},{"category":"company","date":1699508520,"headline":"Uber price target raised to $67 from $60 at Citi","id":123764217,"image":"","symbol":"UBER","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3203957542"},{"category":"company","date":1699503660,"headline":"Why Did Lyft Stock (NASDAQ:LYFT) Fall Despite Its Q3 Earnings Beat?","id":123762124,"image":"","symbol":"UBER","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3203887790"},{"category":"company","date":1699496820,"headline":"Why Did Lyft Stock (NASDAQ:LYFT) Fall Despite Q3 Earnings Beat?","id":123762125,"image":"","symbol":"UBER","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3203801479"}]}