{"id":3944,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"1990-06-18","marketCap":10818.3,"name":"Paramount Global","phone":"12122586000","outstanding":651.41,"symbol":"PARAA","website":"https://www.paramount.com/","industry":"Media"},"price":21.2475,"year":2024,"month":7,"day":11,"weekday":"Thursday","title":"Growth Prospects and Expansion Strategies for Paramount Global Stock","date":"2024-07-11","url":"/posts/2024/07/11/PARAA","content":[{"section":"1. Market Demand and Industry Growth","text":"Paramount Global operates in an industry with a high market demand, making it well-positioned for potential growth. The industry it operates in has been experiencing steady growth due to various factors such as increasing consumer purchasing power and global economic development. This growth potential offers Paramount Global an opportunity to expand its presence and capture a larger market share."},{"section":"2. Product Innovation and Differentiation","text":"To sustain growth and remain competitive, Paramount Global focuses on product innovation and differentiation. By continuously developing and introducing new and improved products, the company can attract new customers and retain existing ones. Paramount Global invests in research and development to stay ahead of market trends and consumer preferences, ensuring its offerings are relevant and in-demand."},{"section":"3. Strategic Partnerships and Acquisitions","text":"Paramount Global actively seeks strategic partnerships and acquisitions to expand its reach and capabilities. By partnering with complementary companies or acquiring businesses that provide synergistic value, Paramount Global can extend its product portfolio, enter new markets, and capitalize on economies of scale. This strategy allows the company to grow both organically and through strategic collaborations."},{"section":"4. Geographic Expansion","text":"Another avenue for growth is geographic expansion. Paramount Global can explore untapped markets and regions where its products are in demand but have limited presence. By expanding its distribution network and establishing local operations, the company can reach a wider customer base and capture new market opportunities."},{"section":"5. Market Penetration and Customer Retention","text":"Paramount Global emphasizes market penetration and customer retention as key growth strategies. By intensifying its marketing efforts and targeting new customer segments, the company can increase its market share. Additionally, Paramount Global prioritizes customer satisfaction and loyalty programs to retain existing customers, fostering long-term relationships and recurring revenue streams."},{"section":"6. Operational Efficiency and Cost Optimization","text":"Achieving operational efficiency and optimizing costs are crucial for sustained growth. Paramount Global focuses on streamlining its internal processes and supply chain management to reduce expenses and enhance productivity. By implementing lean manufacturing practices, automation, and optimizing logistics, the company can improve profitability and reinvest the savings into growth initiatives."},{"section":"7. Digital Transformation and E-commerce","text":"In line with changing consumer behavior and market trends, Paramount Global embraces digital transformation and e-commerce as expansion strategies. By investing in online platforms, enhancing its digital presence, and leveraging technology, the company can tap into the growing e-commerce market and reach a larger customer base. Paramount Global also explores partnerships with leading e-commerce platforms to increase its online visibility and sales."},{"section":"8. Sustainability and Corporate Social Responsibility","text":"Paramount Global recognizes the importance of sustainability and corporate social responsibility. By integrating sustainable practices into its operations and product offerings, the company can attract environmentally conscious customers and align with emerging market trends. Paramount Global's commitment to social responsibility also enhances its brand image, fostering customer loyalty and supporting its growth prospects."}],"tags":["CrossOver21","Long","Media"],"news":[{"category":"company","date":1720539203,"headline":"Paramount Risks Cut to Junk by Moody’s After Skydance Deal","id":128638924,"image":"https://s.yimg.com/ny/api/res/1.2/AQJToT64ZPSmyalo1iu2VQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_markets_842/63b9ad106535fbe0e96f20c9a93f2d88","symbol":"PARAA","publisher":"Yahoo","summary":"(Bloomberg) -- Paramount Global may have its credit rating cut to junk by Moody’s Ratings after the company agreed to sell itself to Skydance Media, with the bond grader citing “significant secular pressures” on Paramount businesses.Most Read from BloombergMicrosoft Orders China Staff to Use iPhones for Work and Drop AndroidSaudis Warned G-7 Over Russia Seizures With Debt Sale ThreatBiden’s Biggest Donors Left Powerless to Sway Him to End BidHurricane Beryl Makes a Mockery of Texas Climate Denie","url":"https://finance.yahoo.com/news/paramount-risks-being-cut-junk-150101254.html"},{"category":"company","date":1720535100,"headline":"Ellison’s Plan to Fix Paramount Includes Technology Upgrade","id":128638925,"image":"https://s.yimg.com/ny/api/res/1.2/hU.pH61ARorOfIMf4aXwqw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_technology_68/04d88c49558e2deb786cd5302bf25e46","symbol":"PARAA","publisher":"Yahoo","summary":"(Bloomberg) -- When investors look at Paramount Global, they see a distressed company in decline. David Ellison sees a rare opportunity to own one of Hollywood’s original studios.Most Read from BloombergMicrosoft Orders China Staff to Use iPhones for Work and Drop AndroidSaudis Warned G-7 Over Russia Seizures With Debt Sale ThreatBiden’s Biggest Donors Left Powerless to Sway Him to End BidHurricane Beryl Makes a Mockery of Texas Climate DeniersStocks Hold Near Peak as Powell Sticks to Script: Ma","url":"https://finance.yahoo.com/news/ellison-plan-fix-paramount-includes-142500964.html"},{"category":"company","date":1720532719,"headline":"Why Is Sony Stock Trading Higher On Tuesday?","id":128638926,"image":"https://media.zenfs.com/en/Benzinga/b6338fcbb4226960664b70ded755dac6","symbol":"PARAA","publisher":"Yahoo","summary":"Sony Group Corp (NYSE:SONY) stock gained Tuesday as Paramount Global (NASDAQ:PARA) (NASDAQ:PARAA) agreed to merge with Skydance Media, creating “New Paramount,” which values the combined entity at $28 billion. In 2024, Sony stock came under pressure after the company, alongside Apollo Global Management Inc (NYSE:APO), submitted a joint $26 billion bid to acquire Paramount Global. The offer has raised concerns about Sony’s ability to manage the acquisition, as the proposed deal surpasses Sony’s c","url":"https://finance.yahoo.com/news/why-sony-stock-trading-higher-134519303.html"},{"category":"company","date":1720519209,"headline":"Paramount-Skydance merger: What strategies execs plan to use for streaming","id":128638927,"image":"https://s.yimg.com/ny/api/res/1.2/tNvZ.JI80SCAceUX6w6dmQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/fox_business_text_367/3dafef2d649b6eb8b154c265c611800b","symbol":"PARAA","publisher":"Yahoo","summary":"Skydance Media and RedBird Capital Partners executives shed some light on what strategy they intend to use to approach Paramount Global’s streaming business.","url":"https://finance.yahoo.com/news/paramount-skydance-merger-strategies-execs-100009449.html"},{"category":"company","date":1720509964,"headline":"Heard on the Street Monday Recap: Jet Wash","id":128634160,"image":"https://s.yimg.com/ny/api/res/1.2/nn82g03TvtWWZrewDp_kJA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/2a7df725f62c0f5d89e5166d00e24f37","symbol":"PARAA","publisher":"Yahoo","summary":"Maybe AI can keep Tom Cruise young enough to keep flying those fighter jets.  Like every corporate call these days, the one Skydance Media hosted to discuss its finally pending merger with Paramount Global featured shout-outs to Wall Street’s favorite topic du jour.  Skydance Chief Executive David Ellison, who will lead the combined company, said the deal will \"unify\" the rights to key intellectual property like \"Top Gun: Maverick,\" which the two companies produced.","url":"https://finance.yahoo.com/m/acb4a388-6dee-3dbf-81b5-2c1d0087564b/heard-on-the-street-monday.html"},{"category":"company","date":1720486800,"headline":"New Hollywood Mogul David Ellison Tackles Daunting To-Do List After Paramount Deal","id":128629376,"image":"https://s.yimg.com/ny/api/res/1.2/VS1v.kkte1qj3e6UBr62Zw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/d7a4b6fc00eb42f99224db54e9d88f22","symbol":"PARAA","publisher":"Yahoo","summary":"The Skydance CEO is eyeing $2 billion in cost savings and looking to turn the combined company into a “media and tech hybrid.”","url":"https://finance.yahoo.com/m/939120b3-e2c0-37da-a264-e70c4bfde014/new-hollywood-mogul-david.html"},{"category":"company","date":1720476860,"headline":"David Ellison Vows More Film Production After Paramount Merger","id":128634175,"image":"https://s.yimg.com/ny/api/res/1.2/_Vy4agw0dXA7dPg8NaxKhw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_technology_68/aa8364866c127165c6570d2816e42d3a","symbol":"PARAA","publisher":"Yahoo","summary":"(Bloomberg) -- Independent producer David Ellison delivered a promise Monday to a Hollywood community rocked by strikes, layoffs and cutbacks: Film and TV giant Paramount Global will be increasing production once his Skydance Media takes over.Most Read from BloombergMicrosoft Orders China Staff to Use iPhones for Work and Drop AndroidBiden’s Biggest Donors Left Powerless to Sway Him to End BidZyn Imitators Rush In as Online Sales Halt Worsens US ShortageRich Chinese Return to Hong Kong as Singap","url":"https://finance.yahoo.com/news/david-ellison-vows-more-film-221420785.html"},{"category":"company","date":1720473151,"headline":"S\u0026P 500 Gains and Losses Today: Intel, Super Micro Computer Surge on AI Boost","id":128626105,"image":"https://www.investopedia.com/thmb/6X_WTETOjPiO3eCwtzRD1bTjzI4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-2160010090-7db3d4313f954d15be13ffb9ea643ad8.jpg","symbol":"PARAA","publisher":"Yahoo","summary":"The S\u0026P 500 edged 0.1% higher to close at a record high on Monday, July 8, 2024, kicking off a trading week that will feature testimony from the Federal Reserve chair, key inflation data, and bank earnings.","url":"https://www.investopedia.com/s-and-p-500-gains-and-losses-today-intel-super-micro-computer-surge-on-ai-boost-8674798"},{"category":"company","date":1720471699,"headline":"Skydance's David Ellison describes Paramount's tech-media hybrid future","id":128626680,"image":"https://media.zenfs.com/en/reuters-finance.com/2553d648c7d127612337ba807e977c6c","symbol":"PARAA","publisher":"Yahoo","summary":"Skydance Media CEO David Ellison on Monday sketched out a vision for Paramount Global as a technology-media hybrid company at a time Hollywood has been competing for attention with tech giants moving into the entertainment business.  In an hour-long presentation to the financial community following the announcement of a merger agreement with Paramount, Ellison invoked Steve Jobs, describing the late Apple co-founder and Pixar Animation Studios leader as a mentor who informed Ellison's view of the relationship between art and technology.  \"The art challenges the technology and the technology challenges the art,\" said Ellison, recalling a favorite Jobs quote.","url":"https://finance.yahoo.com/news/skydances-david-ellison-describes-paramounts-204819827.html"},{"category":"company","date":1720470120,"headline":"These Stocks Moved the Most Today: Tesla, Corning, Morphic, Intel, Paramount, ServiceNow, SolarEdge, and More","id":128626682,"image":"https://s.yimg.com/ny/api/res/1.2/nmFkBThAJkeMenZy6vs.3g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/Barrons.com/3ffdf6fa59930c0e4241888602054e35","symbol":"PARAA","publisher":"Yahoo","summary":"Tesla closes higher for a ninth-straight session, Corning raises guidance, and Morphic will be bought by Eli Lilly for $3.2 billion.","url":"https://finance.yahoo.com/m/439f5a94-4518-3279-8c52-3180130134fb/these-stocks-moved-the-most.html"},{"category":"company","date":1720469696,"headline":"Three AI Plays Led S\u0026P 500 Stocks Monday","id":128625165,"image":"https://media.zenfs.com/en/ibd.com/573638b65ab0da6a9ef96790e629731a","symbol":"PARAA","publisher":"Yahoo","summary":"Corning and Super Micro were the S\u0026P 500 index's top performers on Monday, while Chipotle was the biggest loser.","url":"https://finance.yahoo.com/m/930c13cd-6c08-35b7-9f86-33658323f435/three-ai-plays-led-s%26p-500.html"},{"category":"company","date":1720467789,"headline":"Paramount Stock Drops After Skydance Deal Announced","id":128626749,"image":"https://media.zenfs.com/en/wsj.com/7b2c285183be07ca3c4e8242b25a59a8","symbol":"PARAA","publisher":"Yahoo","summary":"Investors weren't all that excited Monday about the apparent finale of one of the biggest deal dramas in recent months. Shares of Paramount Global fell about 5% in afternoon trading after the troubled media giant finally wrapped up its on-again, off-again merger deal with Skydance Media.","url":"https://finance.yahoo.com/m/12a45ba3-8f58-3648-9dc8-d81dadaeef30/paramount-stock-drops-after.html"},{"category":"company","date":1720461480,"headline":"Paramount-Skydance Deal Is Lousy for Shareholders. Too Bad They Don’t Get a Vote.","id":128626685,"image":"https://s.yimg.com/ny/api/res/1.2/TAVEqJ75INA9we5wJk1_bw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/Barrons.com/54aab9a7fc4b0755c39fee6e8bfe7ac2","symbol":"PARAA","publisher":"Yahoo","summary":"The media and entertainment company’s merger deal with Skydance Media shuts out holders of the company’s nonvoting Class B shares—who own most of Paramount’s equity.","url":"https://finance.yahoo.com/m/b726adfe-ff0b-3024-ae89-c698143a2b0e/paramount-skydance-deal-is.html"},{"category":"company","date":1720458420,"headline":"Paramount’s Third Act Will Still Offer Plenty of Drama","id":128626751,"image":"https://s.yimg.com/ny/api/res/1.2/hGHU74XsDnP3G2Pf68cFgA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/5604bdecb88d33d366584b2f4e1898ef","symbol":"PARAA","publisher":"Yahoo","summary":"Skydance, headed by David Ellison, brings a strong track record, but making streaming profitable as traditional business declines will be a tough haul.","url":"https://finance.yahoo.com/m/cabce744-32d6-3a12-8599-6cf163c231b3/paramount%E2%80%99s-third-act-will.html"},{"category":"company","date":1720458359,"headline":"Pound hits one-month high after Reeves speech","id":128624140,"image":"https://s.yimg.com/ny/api/res/1.2/cH0qMAP_PX.N2ogIhmnVQw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NTA-/https://media.zenfs.com/en/the_telegraph_818/8703db51ab9bcc8f3e9fc691c9319a96","symbol":"PARAA","publisher":"Yahoo","summary":"The pound hit its highest level in nearly a month after Rachel Reeves set out plans to increase house building, unblock infrastructure projects and attract private investment as part of a new “national mission” to drive economic growth.","url":"https://uk.finance.yahoo.com/news/pound-hits-one-month-high-170559602.html"},{"category":"company","date":1720429093,"headline":"Stocks to Watch Monday: Paramount, Boeing, Carlsberg","id":128621004,"image":"https://s.yimg.com/ny/api/res/1.2/r3J55NDOwdUJ.LUt.H_McQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/fda16fa5528d8a35e64c00ba7fc0e833","symbol":"PARAA","publisher":"Yahoo","summary":"**?** **Boeing (BA)**: The world's biggest aerospace company agreed to plead guilty to misleading air-safety regulators in the run-up to two deadly 737 MAX crashes. **↗️** **Paramount Global (PARA)**: The Hollywood company agreed to merge with David Ellison's Skydance Media, ending a nearly four-decade run by the Redstone family as entertainment power players.","url":"https://finance.yahoo.com/m/8c4618dc-8507-34ff-9418-42da5247439b/stocks-to-watch-monday%3A.html"},{"category":"company","date":1720455681,"headline":"Paramount stock drops after company agrees to Skydance merger","id":128626754,"image":"https://s.yimg.com/ny/api/res/1.2/O6h3NJmOjnWxYHu64tzavw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NzI-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/39168ba0-3d33-11ef-9fff-eb1a015cc436","symbol":"PARAA","publisher":"Yahoo","summary":"Paramount's messy merger journey has finally reached its conclusion.","url":"https://finance.yahoo.com/news/paramount-stock-drops-after-company-agrees-to-skydance-merger-162121986.html"},{"category":"company","date":1720454856,"headline":"Biden, Boeing plea deal, French markets: Morning Brief","id":128624512,"image":"https://s.yimg.com/ny/api/res/1.2/4P4msHMtiHEwhVHPXsig4w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/19a61540-3d44-11ef-afaf-ac6b8178332b","symbol":"PARAA","publisher":"Yahoo","summary":"It's Monday morning, and stocks (^DJI, ^IXIC, ^GSPC) are moving as if they're on their third cup of coffee ahead of the market opening. Seana Smith and Brad Smith help investors start the day off right, highlighting this morning's top business stories and previewing the biggest economic data prints and earnings reports expected out throughout the week. Raymond James managing director Ed Mills comes onto The Morning Brief to talk about how the markets could react to President Biden's willingness to stay in the 2024 presidential election. Boeing (BA) plans to plead guilty to a fraud charge tied to fatal 737 Max crashes from 2018 and 2019. Bloomberg Intelligence senior analyst George Ferguson expands upon the plea deal arranged with the Department of Justice (DOJ) and what it means for the aerospace company's stock value after a series of manufacturing issues from the beginning of 2024. Several other top trending stocks on the Yahoo Finance platform include Paramount Global (PARA) as the media company agrees to an $8 billion merger with Skydance Media; Eli Lilly (LLY) $3.2 billion acquisition of Morphic Holding (MORF); and French indexes (^FCHI, ^SBF120) in response to the country's snap election results. This post was written by Luke Carberry Mogan.","url":"https://finance.yahoo.com/video/biden-boeing-plea-deal-french-160736322.html"},{"category":"company","date":1720454323,"headline":"Top Midday Stories: Boeing Reaches Settlement with DOJ Over Fatal 737 Max Crashes; Eli Lilly Acquires Morphic for $3.2 Billion; Paramount to Merge with Skydance","id":128625736,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"PARAA","publisher":"Yahoo","summary":"Top Midday Stories: Boeing Reaches Settlement with DOJ Over Fatal 737 Max Crashes; Eli Lilly Acquires Morphic for $3.2 Billion; Paramount to Merge with Skydance","url":"https://finance.yahoo.com/news/top-midday-stories-boeing-reaches-155843944.html"},{"category":"company","date":1720451974,"headline":"Paramount agrees to merger with Skydance","id":128626688,"image":"https://s.yimg.com/ny/api/res/1.2/CZXH2kHdMj9o1uKLHE9QWw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/fox_business_text_367/cf17c2ab48603c0d3d71804fe9a75f4b","symbol":"PARAA","publisher":"Yahoo","summary":"Paramount Global and Skydance Media have reached a deal to merge the two massive media companies together, according to a joint statement released Sunday.","url":"https://finance.yahoo.com/news/paramount-agrees-merger-skydance-151934629.html"},{"category":"company","date":1720422474,"headline":"Paramount, the media empire behind CBS and ‘Top Gun,’ agrees to merge with Skydance","id":128621553,"image":"https://media.cnn.com/api/v1/images/stellar/prod/2024-06-10t185253z-1752678630-rc2h88a3wr8b-rtrmadp-3-paramount-global-m-a-edgar-bronfman.JPG?c=16x9\u0026q=w_800,c_fill","symbol":"PARAA","publisher":"Yahoo","summary":"Paramount Global, the sprawling media empire behind CBS, MTV, and one of Hollywood’s most storied movie studios, has agreed to merge with technology scion David Ellison’s Skydance Media, ending years of speculation over the company’s fate.","url":"https://www.cnn.com/2024/07/08/media/paramount-global-skydance-merger-announcement?cid=external-feeds_iluminar_yahoo\u0026amp;.tsrc=rss"},{"category":"company","date":1720447920,"headline":"Paramount Stock Falls on New Skydance Deal. It Could Be Best Shareholders Will Get.","id":128626690,"image":"https://s.yimg.com/ny/api/res/1.2/xR9lP8oN7lM0NV3J4r5Anw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/Barrons.com/2c455f7bdd251ddf9fc3892076f59f5a","symbol":"PARAA","publisher":"Yahoo","summary":"The deal, the culmination of months of wrangling between Skydance and Paramount, would let shareholders cash out at a premium.","url":"https://finance.yahoo.com/m/d1549542-c9d1-3fff-b151-789cb38872f7/paramount-stock-falls-on-new.html"},{"category":"company","date":1720412692,"headline":"Paramount Agrees to Skydance Merger, Marking End to Redstone Era","id":128618572,"image":"https://s.yimg.com/ny/api/res/1.2/6yx.fj5rw11H1z5rK1yKMw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_technology_68/afc28e1518551d7f67b3f6a7f2d9c1ca","symbol":"PARAA","publisher":"Yahoo","summary":"(Bloomberg) -- Paramount Global, the parent of CBS and MTV, agreed to merge with Skydance Media, handing control of a major Hollywood studio to independent producer David Ellison and ending one of the messiest and most dramatic merger deals in recent history.Most Read from BloombergBiden Narrows Gap With Trump in Swing States Despite Debate LossHedge Funds That Piled Into Big Tesla Short Stung by Huge RallyFrench Left Set for Shock Victory Over Macron and Le PenBoeing to Plead Guilty to Fraud fo","url":"https://finance.yahoo.com/news/paramount-agrees-skydance-merger-marking-040202106.html"},{"category":"company","date":1720446904,"headline":"Paramount Agrees To Skydance Merger, Seemingly Ending Saga","id":128626692,"image":"https://www.investopedia.com/thmb/K-DyceoN8sv-buZPZcsI9cBYovM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-2150317990-a1d8c45432f14ab4bd6dc42f696f5652.jpg","symbol":"PARAA","publisher":"Yahoo","summary":"Paramount Global has agreed to merge with Skydance Media in a deal that will involve over $8 billion in investment from Skydance and its private equity partners.","url":"https://www.investopedia.com/paramount-agrees-to-skydance-merger-seemingly-ending-saga-8674476"},{"category":"company","date":1720446597,"headline":"Paramount Global shares up on $8B Skydance Media deal","id":128626762,"image":"https://s.yimg.com/ny/api/res/1.2/17tJzYZ1lrQIY1YFZqZoZw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzQ-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/9083f8e0-3d2f-11ef-be3f-e3ef22254264","symbol":"PARAA","publisher":"Yahoo","summary":"Paramount Global (PARA) stock is trading higher on Monday following the announcement of a merger agreement with Skydance Media. The deal, valued at approximately $8 billion, marks a significant consolidation in the media industry. Yahoo Finance entertainment reporter Alexandra Canal breaks down the details of this long-anticipated merger. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This article was written by Angel Smith","url":"https://finance.yahoo.com/video/paramount-global-shares-8b-skydance-134957318.html"},{"category":"company","date":1720441560,"headline":"Paramount Global, Skydance Agree to Merger","id":128621544,"image":"https://s.yimg.com/ny/api/res/1.2/_8RW8P7xO3GVJUSvCnkDeg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/bbdc01ea0f74a5338df6fdbab83a5f0d","symbol":"PARAA","publisher":"Yahoo","summary":"David Ellison’s production company would buy Shari Redstone’s National Amusements, Paramount’s controlling shareholder, as part of the deal.","url":"https://finance.yahoo.com/m/29f1c1ce-f8ba-3c31-a155-bafc51b2e15f/paramount-global%2C-skydance.html"},{"category":"company","date":1720441260,"headline":"Morphic Holding, Boeing rise; Paramount, Devon Energy fall, Monday, 7/8/2024","id":128626029,"image":"","symbol":"PARAA","publisher":"Associated Press, The","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=lb8794notf"},{"category":"company","date":1720440480,"headline":"Wall Street Lunch: Merger Monday In All Its Glory","id":128622902,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1097298712/image_1097298712.jpg?io=getty-c-w1536","symbol":"PARAA","publisher":"SeekingAlpha","summary":"Carlsberg (CABGY) seals acquisition of U.K. soft drinks company Britvic, Lilly to buy Morphic Holding","url":"https://seekingalpha.com/article/4702957-wall-street-lunch-merger-monday-in-all-its-glory"},{"category":"company","date":1720440202,"headline":"5 Things to Know Before the Stock Market Opens","id":128621545,"image":"https://www.investopedia.com/thmb/7bdCg4hXXJl_7IvkQu8OZ3vD0z0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-2159049546-960758269cff4c87b4186ca50b05480a.jpg","symbol":"PARAA","publisher":"Yahoo","summary":"News of the day for July 8, 2024","url":"https://www.investopedia.com/5-things-to-know-before-the-stock-market-opens-july-08-2024-8674470"},{"category":"company","date":1720433700,"headline":"Evaluating The Final Paramount-Skydance Merger","id":128622117,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/186838207/image_186838207.jpg?io=getty-c-w1536","symbol":"PARAA","publisher":"SeekingAlpha","summary":"Financial writer analyzes Paramount's merger terms agreement with Shari Redstone, warning of potential drawbacks despite a possible better deal within...","url":"https://seekingalpha.com/article/4702922-evaluating-the-final-paramount-skydance-merger"},{"category":"company","date":1720424040,"headline":"Paramount to merge with Skydance to create new $28B media, tech conglomerate","id":128623996,"image":"","symbol":"PARAA","publisher":"United Press International","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=0rwhlpgkt9"},{"category":"company","date":1720420114,"headline":"Paramount: Shari Redstone's 'Let Them Eat Cake' Moment With Shareholders","id":128620482,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/898637136/image_898637136.jpg?io=getty-c-w1536","symbol":"PARAA","publisher":"SeekingAlpha","summary":"The Sony/Paramount deal offers superior cross-entertainment opportunities and potential for stock price increase. Read more to see my analysis on PARA stock.","url":"https://seekingalpha.com/article/4702877-paramount-shari-redstone-let-them-eat-cake-moment-with-shareholders"},{"category":"company","date":1720417200,"headline":"Paramount and Skydance merge, signaling end of a family reign in Hollywood and the rise of new power","id":128626947,"image":"","symbol":"PARAA","publisher":"Associated Press, The","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=fve2agis7n"},{"category":"company","date":1720398360,"headline":"Stock market today: Asian shares trade mostly higher after S\u0026P 500, Nasdaq reach more records","id":128638708,"image":"","symbol":"PARAA","publisher":"Associated Press, The","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=gytjr7nb1u"},{"category":"company","date":1720398360,"headline":"Stock market today: Wall Street wavers ahead of bank earnings and Powell testimony this week","id":128623998,"image":"","symbol":"PARAA","publisher":"Associated Press, The","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=lhlhy9u90v"},{"category":"company","date":1720395360,"headline":"PARAMOUNT GLOBAL'S SPECIAL COMMITTEE UNANIMOUSLY APPROVES MERGER WITH SKYDANCE MEDIA","id":128623999,"image":"","symbol":"PARAA","publisher":"PR Newswire","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=59cz2i2wyz"},{"category":"company","date":1720395060,"headline":"Skydance Media and Paramount Global Sign Definitive Agreement to Advance Paramount as a World-Class Media and Technology Enterprise","id":128624000,"image":"","symbol":"PARAA","publisher":"GlobeNewswire","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=kbludhggee"},{"category":"company","date":1720390860,"headline":"Paramount Global Agrees to Skydance Deal","id":128617116,"image":"https://s.yimg.com/ny/api/res/1.2/_8RW8P7xO3GVJUSvCnkDeg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/bbdc01ea0f74a5338df6fdbab83a5f0d","symbol":"PARAA","publisher":"Yahoo","summary":"David Ellison’s production company would buy Shari Redstone’s National Amusements, Paramount’s controlling shareholder, as part of the deal.","url":"https://finance.yahoo.com/m/29f1c1ce-f8ba-3c31-a155-bafc51b2e15f/paramount-global-agrees-to.html"},{"category":"company","date":1720389217,"headline":"Special committee of Paramount Global endorses plan to merge with Skydance Media, source says","id":128617692,"image":"https://media.zenfs.com/en/reuters.com/0fae7b8915799067caadc2d34b3b83f9","symbol":"PARAA","publisher":"Yahoo","summary":"(Reuters) -Tech scion David Ellison moved one step closer to gaining control of Paramount Global, with a special committee voting Sunday to support a merger with his Skydance Media, a source close to the deal told Reuters.  Paramount's full board, including its non-executive chair, Shari Redstone, is expected to approve the deal imminently, the source said.  The vote comes on the heels of a preliminary agreement reached last week to sell National Amusements, which holds a controlling stake in Paramount, to Ellison and his deal partners.","url":"https://ca.finance.yahoo.com/news/special-committee-paramount-global-endorses-215337791.html"},{"category":"company","date":1720387483,"headline":"Skydance Is Inching Closer to Nailing a Deal for Paramount","id":128617545,"image":"https://s.yimg.com/ny/api/res/1.2/G.djjLy1N3ADKX6g5uW5iw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_technology_68/db17b70618e53652981ceba9b2f1a062","symbol":"PARAA","publisher":"Yahoo","summary":"(Bloomberg) -- David Ellison inched closer to an acquisition of Paramount Global, the owner of MTV and CBS, as a special committee of the company’s board endorsed a merger with his Skydance Media, according to a person with knowledge of the matter.Most Read from BloombergBiden Narrows Gap With Trump in Swing States Despite Debate LossHedge Funds That Piled Into Big Tesla Short Stung by Huge RallyFrench Left Set for Shock Victory Over Macron and Le PenLe Pen Party Seeks Major French Election Win:","url":"https://finance.yahoo.com/news/skydance-inching-closer-nailing-deal-212443274.html"},{"category":"company","date":1720210020,"headline":"Netflix, U.S. Companies Ask Canada Appeal Court to Stop Proposed Tax on Streaming Revenue","id":128602820,"image":"","symbol":"PARAA","publisher":"Yahoo","summary":"An industry group representing Netflix, Walt Disney and other U.S. streaming companies has asked a Canadian court to stop plans by authorities to force them to fork over 5% of their sales in the country to help finance local broadcast news and other domestic content.","url":"https://finance.yahoo.com/m/86864d15-2c52-34a2-98a7-3dfc1884862d/netflix%2C-u.s.-companies-ask.html"},{"category":"company","date":1720206196,"headline":"Chewy's Bounce and Amazon's Rise","id":128600307,"image":"https://g.foolcdn.com/editorial/images/782160/mfm_27.jpg","symbol":"PARAA","publisher":"Yahoo","summary":"We also chat with William Cohan from Puck about what's going on with Paramount Global.","url":"https://www.fool.com/investing/2024/07/05/chewys-bounce-and-amazons-rise/?source=eptyholnk0000202\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;referring_guid=a6889b48-4d1e-42dd-8be3-dd48bcbe2742\u0026amp;.tsrc=rss"},{"category":"company","date":1720181401,"headline":"Warner Bros. Discovery: Approaching My Buy Price Target (Rating Upgrade)","id":128598402,"image":"https://media.gettyimages.com/id/2159247911/photo/atlanta-georgia-a-sign-for-warner-brothers-discovery-is-seen-outside-of-the-turner.jpg?b=1\u0026s=594x594\u0026w=0\u0026k=20\u0026c=PqW5mJbkNyfu7ZHLif_HosDTd28j2xWnd9-pSa4r3b4=","symbol":"PARAA","publisher":"SeekingAlpha","summary":"Warner Bros. Discovery shares have dropped from $10 in February to $7 currently. Check out whyÂ I raise my rating toÂ HoldÂ fromÂ Sell for WBD stock.","url":"https://seekingalpha.com/article/4702592-warner-bros-discovery-approaching-my-buy-price-target-rating-upgrade"},{"category":"company","date":1720144380,"headline":"Netflix, Disney Ask Canada Appeal Court to Stop Proposed Tax on Streaming Revenue","id":128593758,"image":"https://s.yimg.com/ny/api/res/1.2/spPNDN7S_lVXrBIBMcYYew--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/7301a4cc4cc907e8abc2bf83a2a498a4","symbol":"PARAA","publisher":"Yahoo","summary":"Netflix, Walt Disney, and other U.S. streaming companies have asked a Canadian court to stop plans by authorities to force them to fork over 5% of their sales in the country to finance local broadcast news and other domestic content.","url":"https://finance.yahoo.com/m/86864d15-2c52-34a2-98a7-3dfc1884862d/netflix%2C-disney-ask-canada.html"},{"category":"company","date":1720096647,"headline":"Heard on the Street Pre-Holiday Recap: Paramount's Plus","id":128594499,"image":"https://s.yimg.com/ny/api/res/1.2/JImRRGgXbtO05wOwrcaNYw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/8acd1809508868b1a9d10bae57d00e31","symbol":"PARAA","publisher":"Yahoo","summary":"News emerged late Tuesday that Skydance Media had reached a preliminary agreement to buy National Amusements, which owns about 77% of the voting shares of Paramount.  **Koss**, one of the original meme stocks during 2021's GameStop mania, surged 144% on Wednesday after the headphone maker's name reappeared in social media forums.  Shares of Japanese tech conglomerate **SoftBank** rose 1.5% and closed at a record high on Wednesday, due in large part to the market's enthusiasm for companies tied to artificial intelligence.","url":"https://finance.yahoo.com/m/49a80502-75f7-37e6-a459-c180cddecd9c/heard-on-the-street.html"},{"category":"company","date":1720072200,"headline":"Ariel Fund And Ariel Appreciation Fund Q1 2024 Letter","id":128583136,"image":"https://media.gettyimages.com/id/2155377082/photo/asian-millennial-women-applied-ai-machine-learning-with-her-investing-portfolio-to-growth-her.jpg?b=1\u0026s=170667a\u0026w=0\u0026k=20\u0026c=zpKsZKiE_XgY02h4Z9b7rdkktuwjjQgzIKaEbi0wTzs=","symbol":"PARAA","publisher":"SeekingAlpha","summary":"During Q1 2024, Ariel Fund slightly underperformed its core benchmark, while Ariel Appreciation Fund fell short. Click here to read the full letter.","url":"https://seekingalpha.com/article/4702416-ariel-fund-and-ariel-appreciation-fund-q1-2024-letter"},{"category":"company","date":1720036946,"headline":"S\u0026P 500 Gains and Losses Today: Paramount Pops on Reports of Resuscitated Skydance Deal","id":128575653,"image":"https://www.investopedia.com/thmb/Q8CMobQkBggLHNAwo72qFYlch9U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/INV_ParamountBuilding_GettyImages-1247972540-fdb652682100432aa12641fe7c460c90.jpg","symbol":"PARAA","publisher":"Yahoo","summary":"The S\u0026P 500 advanced 0.5% on Wednesday, July 3, 2024, reaching its second straight record close in a shortened trading session ahead of Independence Day.","url":"https://www.investopedia.com/s-and-p-500-gains-and-losses-today-tesla-walgreens-first-solar-8673392"},{"category":"company","date":1720033200,"headline":"Heard on the Street Recap: Paramount's Plus","id":128574618,"image":"","symbol":"PARAA","publisher":"Yahoo","summary":"First, another plot development in Paramount Global's deal saga sent the company's stock up 6.9%.  News emerged late Tuesday that Skydance Media reached a preliminary agreement to buy National Amusements, which owns about 77% of the voting shares of Paramount.  Headphone maker Koss Corp., one of the original meme stocks during 2021's GameStop mania, surged 144% on Wednesday after the company's name re-appeared in social media forums.","url":"https://finance.yahoo.com/m/f8ce7213-04f1-3817-9324-f7b22149cb66/heard-on-the-street-recap%3A.html"},{"category":"company","date":1720029290,"headline":"Skydance Media's deal to gain control of Paramount could be sealed this weekend, sources say","id":128574619,"image":"https://media.zenfs.com/en/reuters.com/d7739891529de8cf5a3d83b89b5a4fdd","symbol":"PARAA","publisher":"Yahoo","summary":"Skydance Media's deal to acquire theater operator National Amusements, with its controlling interest in Paramount Global, could be finalized by Monday, sources familiar with the deal process said.  Parties are expected to work throughout the weekend to finalize the deal before Tuesday's start of Allen \u0026 Co's annual gathering of technology and media titans in Sun Valley, Idaho, which Paramount Global Chair Shari Redstone typically attends.  Skydance Media, an independent media company with interests in films, animation, television, video games and sports, has offered to pay $1.75 billion for National Amusements, the holding company that owns about 77% of the voting shares of Paramount.","url":"https://ca.finance.yahoo.com/news/skydance-medias-deal-gain-control-175450516.html"},{"category":"company","date":1720027260,"headline":"These Stocks Moved the Most Today: Tesla, Paramount, Nvidia, Constellation Brands, Simulations Plus, First Solar, and More","id":128574620,"image":"https://s.yimg.com/ny/api/res/1.2/YP5SgoFJANYAmwQ4ii1FhA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/Barrons.com/42abbdbdcdb0982d5280cb9eec4b967f","symbol":"PARAA","publisher":"Yahoo","summary":"Tesla stock extended gains after second-quarter deliveries at the electric-vehicle maker beat expectations, while Paramount surged following a report it has reached a deal to merge with Skydance Media.","url":"https://finance.yahoo.com/m/bc41ade5-d7e6-3767-8742-a6c2eeb9e235/these-stocks-moved-the-most.html"},{"category":"company","date":1720024906,"headline":"Paramount: Deal Merry-Go-Round","id":128575393,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/183854850/image_183854850.jpg?io=getty-c-w1536","symbol":"PARAA","publisher":"SeekingAlpha","summary":"Paramount Global is involved in multiple deal rumors, including primary Skydance Media deal. Its stock is cheap when trading at $10. Find out why PARA stock is a Buy.","url":"https://seekingalpha.com/article/4702340-paramount-deal-merry-go-round"},{"category":"company","date":1720024668,"headline":"Top Stock Movers Now: Tesla, Paramount Global, Biogen, and More","id":128573448,"image":"https://www.investopedia.com/thmb/BcBnzbw14io9J4FQk-yVBx6Bm3U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-2158062641-d9ea2a5f407f423cb74888be111c5d33.jpg","symbol":"PARAA","publisher":"Yahoo","summary":"U.S. equities were mixed at midday Wednesday, July 3, 2024 just ahead of the close of a holiday-shortened session after a report showed private sector job creation slowed in June.","url":"https://www.investopedia.com/top-stock-movers-now-paramount-global-tesla-biogen-and-more-8673357"},{"category":"company","date":1720022282,"headline":"Top Midday Stories: Southwest Board Approves Shareholder Rights Plan; National Amusements Agrees to Preliminary Deal to Sell Paramount to Skydance; Ozempic, Wegovy Linked to Blinding Eye Condition, Study Says","id":128571033,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"PARAA","publisher":"Yahoo","summary":"Top Midday Stories: Southwest Board Approves Shareholder Rights Plan; National Amusements Agrees to Preliminary Deal to Sell Paramount to Skydance; Ozempic, Wegovy Linked to Blinding Eye Condition, Study Says","url":"https://finance.yahoo.com/news/top-midday-stories-southwest-board-155802837.html"},{"category":"company","date":1720022142,"headline":"ADP jobs data, Constellation Brands, summer gas prices: Morning Brief","id":128573452,"image":"https://s.yimg.com/ny/api/res/1.2/TY6QUsjpm2_Q9Bvx1nOxlA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/d50cba10-3951-11ef-bfbe-6b560f61e397","symbol":"PARAA","publisher":"Yahoo","summary":"Just one day shy of the July 4th festivities, the market (^DJI, ^IXIC, ^GSPC) will be on vacation tomorrow but not before clocking out one more trading session. Brad Smith and Madison Mills walk investors through the opening bell in today's shortened trading day. Get your flip-flops ready and grab a beer this holiday because Corona maker Constellation Brands (STZ) reported its first-quarter earnings, topping profit estimates but coming just short on the revenue front. Citi US beverages analyst Filippo Falorni explains how beer sales — particularly through Constellation's Corona and Modelo brands — are still a key driver in the alcohol company's profit growth. Paramount Global (PARA, PARAA) may be back on the menu for prospective buyer Skydance Media, as reports surface that it is in talks to buy Paramount's holding company National Amusements. Bloomberg Intelligence senior media analyst Geetha Ranganathan comes onto The Morning Brief to talk about the latest development in Paramount's M\u0026A saga. Other top trending stocks on the Yahoo Finance platform this morning include Southwest Airlines (LUV), Marriott International (MAR), and gasoline prices (RB=F). This post was written by Luke Carberry Mogan.","url":"https://finance.yahoo.com/video/adp-jobs-data-constellation-brands-155542695.html"},{"category":"company","date":1720021018,"headline":"Redstone, Skydance reportedly reach new Paramount deal, but 'whole lot of uncertainty' remains","id":128571034,"image":"https://s.yimg.com/ny/api/res/1.2/Q9hOxR6IdEWLhWenGMP3RQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2023-12/3a94f8f0-9f6c-11ee-b5b9-d08fc2985b28","symbol":"PARAA","publisher":"Yahoo","summary":"Paramount's stock jumped after the Wall Street Journal reported a new path for the media giant's merger with Skydance Media is on the table.","url":"https://finance.yahoo.com/news/redstone-skydance-reportedly-reach-new-paramount-deal-but-whole-lot-of-uncertainty-remains-153658674.html"},{"category":"company","date":1719996428,"headline":"Stocks to Watch Wednesday: Paramount, Tesla, Constellation Brands","id":128569302,"image":"https://s.yimg.com/ny/api/res/1.2/_0iQKTiHWm88c_FMdoC1mA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/2dd695b44cafcc517d7d290fbc3cef5b","symbol":"PARAA","publisher":"Yahoo","summary":"**↗️** **Paramount Global** **(PARA)**: Skydance Media reached a preliminary agreement to buy National Amusements and merge with Paramount, rekindling deal talks that fizzled last month. Paramount stock jumped about 7% in premarket trading.","url":"https://finance.yahoo.com/m/58ee00ae-9a98-3a03-b62a-b588936d45d1/stocks-to-watch-wednesday%3A.html"},{"category":"company","date":1720001100,"headline":"These Stocks Are Moving the Most Today: Tesla, Paramount, Nvidia, Constellation Brands, and More","id":128568222,"image":"https://s.yimg.com/ny/api/res/1.2/YP5SgoFJANYAmwQ4ii1FhA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/Barrons.com/42abbdbdcdb0982d5280cb9eec4b967f","symbol":"PARAA","publisher":"Yahoo","summary":"Tesla stock extends gains after second-quarter deliveries at the electric-vehicle make beat expectations, while Paramount surges following a report it has reached a deal to merge with Skydance Media.","url":"https://finance.yahoo.com/m/bc41ade5-d7e6-3767-8742-a6c2eeb9e235/these-stocks-are-moving-the.html"},{"category":"company","date":1720018636,"headline":"Everything You Need To Know About The Potential Paramount-Skydance Merger","id":128573510,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/491084086/image_491084086.jpg?io=getty-c-w1536","symbol":"PARAA","publisher":"SeekingAlpha","summary":"Shari Redstone in talks with Skydance for potential buyout of National Amusement stake \u0026 Paramount merger. Click here to read an analysis of PARA stock now.","url":"https://seekingalpha.com/article/4702323-everything-you-need-to-know-about-the-potential-paramount-skydance-merger"},{"category":"company","date":1720017562,"headline":"Revived Skydance Deal Boosts Paramount Stock","id":128571038,"image":"","symbol":"PARAA","publisher":"Yahoo","summary":"Paramount Global stock (PARA) jumped, on the news that an on-again, off-again deal involving the Hollywood business and its parent company, Shari Redstone's National Amusements, was on again. David Ellison’s Skydance Media has reached a preliminary agreement to buy National Amusements for $1.","url":"https://finance.yahoo.com/m/d625ea8e-b7e0-3a62-aa0f-1e27c41a7585/revived-skydance-deal-boosts.html"},{"category":"company","date":1720017000,"headline":"Paramount Stock Jumps 10% on Report of New Skydance Deal","id":128571039,"image":"","symbol":"PARAA","publisher":"Yahoo","summary":"Skydance is expected to pay $1.75 billion for National Amusements, the media company owned by Shari Redstone, and then merge with Paramount, The Wall Street Journal reports.","url":"https://finance.yahoo.com/m/9f9dce04-ee0e-3300-81c5-1a409da862f4/paramount-stock-jumps-10%25-on.html"},{"category":"company","date":1720016530,"headline":"Why Paramount is back at the negotiating table with Skydance","id":128571040,"image":"https://s.yimg.com/ny/api/res/1.2/n.jPafyIFTLL9HSCqOdJew--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/13798640-3946-11ef-b6fd-803a75bd3f41","symbol":"PARAA","publisher":"Yahoo","summary":"Shares of Paramount Global (PARA, PARAA) are rallying on revived merger talks with Skydance. According to reports, Skydance has reached a preliminary agreement to buy Shari Redstone's National Amusements, the controlling shareholder of Paramount. If that deal goes through, Skydance would then begin the merger process with Paramount Global. Bloomberg Intelligence senior media analyst Geetha Ranganathan joins Morning Brief to discuss the news and what it means for the media giant's future. \"With Skydance, what we've constantly seen is that they are proposing a deal which basically favors Shari Redstone, who is the controlling shareholder, favors her over everybody else. So it favors her over class A shareholders as well as class B shareholders. And that is something that has the potential for attracting a lot of lawsuits. And that is something that has made Shari Redstone extremely wary, and so it looks like this time around, there is much stronger indemnification language in the agreement that should or could potentially protect her from a lot of the upcoming litigation,\" Ranganathan explains. Paramount has faced a rocky 6 months in its attempts to merge with Skydance, and Ranganathan believes that this deal comes with unique pressure: \"The one thing that we have to remember is that the longer and longer this whole process kind of drags out, the less and the less value that the assets will have. And I think Shari Redstone realizes that she's been publicly negotiating for six months. That's something that's highly unusual in the media landscape, in any M\u0026A deal for that matter, so for her to come that far and then just drop everything again, it created huge overhang on the stock. And I think she's realized that, which is why she's back at the negotiating table.\" For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Melanie Riehl","url":"https://finance.yahoo.com/video/why-paramount-back-negotiating-table-142210902.html"},{"category":"company","date":1720012639,"headline":"ADP jobs data, Fed on inflation, Paramount talks: 3 Things","id":128571041,"image":"https://s.yimg.com/ny/api/res/1.2/HGvbysCa0kd181oKV93rsQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/8ae8e890-393e-11ef-afd3-63150836ed9f","symbol":"PARAA","publisher":"Yahoo","summary":"Stock futures (^DJI, ^IXIC, ^GSPC) are taking in ADP's jobs data for June and the US Department of Labor's initial jobless claims from last week. Federal Reserve Jerome Powell feels the Fed has \"made some progress\" against inflation, stated at the ECB Forum on Central Banking yesterday, as officials slowly move back toward a disinflationary path. Paramount Global (PARA) shares are soaring in pre-market trading on reports that Skydance Media may be nearing an agreement to buy Shari Redstone's National Amusements, the holding company of Paramount. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Luke Carberry Mogan.","url":"https://finance.yahoo.com/video/adp-jobs-data-fed-inflation-131719702.html"},{"category":"company","date":1720009702,"headline":"Paramount Jumps Amid Reports That Skydance Merger Is Back On","id":128571042,"image":"https://www.investopedia.com/thmb/5VChFT275txdJlQVaa4BYUQmkok=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1247972540-3d636c9adb2042d083812d7cc3a652f6.jpg","symbol":"PARAA","publisher":"Yahoo","summary":"A Tentative Deal Between the Two Sides Was Axed by Shari Redstone Last Month","url":"https://www.investopedia.com/paramount-jumps-amid-reports-that-skydance-merger-is-back-on-8673206"},{"category":"company","date":1720007931,"headline":"Update: Update: Market Chatter: Paramount in Talks to Sell BET Network for At Least $1.6 Billion","id":128571043,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"PARAA","publisher":"Yahoo","summary":"Update: Update: Market Chatter: Paramount in Talks to Sell BET Network for At Least $1.6 Billion","url":"https://finance.yahoo.com/news/market-chatter-paramount-talks-sell-115851743.html"},{"category":"company","date":1719997537,"headline":"National Amusements Reportedly Agrees to Preliminary $1.75 Billion Deal to Sell Paramount Interest to Skydance Media","id":128568226,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"PARAA","publisher":"Yahoo","summary":"National Amusements Reportedly Agrees to Preliminary $1.75 Billion Deal to Sell Paramount Interest to Skydance Media","url":"https://finance.yahoo.com/news/national-amusements-reportedly-agrees-preliminary-090537219.html"},{"category":"company","date":1719992700,"headline":"Heard on the Street Tuesday Recap: Riding the Wind","id":128566381,"image":"https://media.zenfs.com/en/wsj.com/7b2c285183be07ca3c4e8242b25a59a8","symbol":"PARAA","publisher":"Yahoo","summary":"Brent crude prices surged to a high of $87.44 a barrel on Tuesday, before settling at $86.24, on concerns surrounding the quickly intensifying Hurricane Beryl that is hitting the Caribbean.  The early nature of the storm increases the chance of a very active 2024 hurricane season, which could eventually hit the U.S. oil patch, energy analyst Robert Yawger said.  Also on Tuesday, Federal Reserve Chair Jerome Powell said that he was pleased with inflation's downward shift, though he stopped short of saying that rate cuts would be coming in September.","url":"https://finance.yahoo.com/m/2266631d-cbcc-315e-b2b3-d152b42f3d0e/heard-on-the-street-tuesday.html"},{"category":"company","date":1719964140,"headline":"Skydance Media’s Deal to Buy Shari Redstone’s Family Company Is Back On","id":128563330,"image":"https://s.yimg.com/ny/api/res/1.2/AQR_jiOVpcxRriXDmRBM3A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/f3e3aca27a62236cb14723f9d2fbcf51","symbol":"PARAA","publisher":"Yahoo","summary":"David Ellison’s  production company has reached a preliminary agreement to buy National Amusements, according to people familiar with the matter, rekindling deal talks that fizzled last month.  It then plans to merge Skydance with  Paramount Global  a deal subject to approval by a special committee of Paramount’s directors.  National Amusements, which owns about 77% of the voting shares of Paramount, has referred the new deal to the special committee for review.","url":"https://finance.yahoo.com/m/2a6f76ea-bab7-3ef6-8437-46d78c19b1be/skydance-media%E2%80%99s-deal-to-buy.html"},{"category":"company","date":1719962344,"headline":"Skydance Media Reaches Preliminary Paramount Merger Agreement","id":128563331,"image":"https://s.yimg.com/ny/api/res/1.2/puwP4NO8JNsScHKeWt3GVw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_technology_68/051e779904cb3fb1ebb59b5cbc18cbdf","symbol":"PARAA","publisher":"Yahoo","summary":"(Bloomberg) -- Independent film and TV producer Skydance Media has reached a preliminary agreement to buy Shari Redstone’s National Amusements Inc. and merge with Paramount Global, the parent of CBS and MTV, according to a person with knowledge of the matter.Most Read from BloombergDemocrats Weigh Mid-July Vote to Formally Tap Biden as NomineePowerful Storm Beryl Aims at Jamaica After Grenada StrikeS\u0026P 500 Closes Above 5,500 in Record-Breaking Run: Markets Wrap‘Upflation’ Is the New Retail Trend","url":"https://finance.yahoo.com/news/skydance-media-reaches-preliminary-paramount-231904580.html"},{"category":"company","date":1719962201,"headline":"David Ellison’s Skydance Reaches New Deal to Buy Paramount Global Owner","id":128563332,"image":"","symbol":"PARAA","publisher":"Yahoo","summary":"Under the new terms, Skydance and its backers which include Oracle co-founder Larry Ellison and RedBird Capital, will pay $1.75 billion for National Amusements.","url":"https://www.theinformation.com/briefings/david-ellisons-skydance-reaches-new-deal-to-buy-paramount-global-owner?rc=66mtsr\u0026amp;.tsrc=rss"},{"category":"company","date":1719962040,"headline":"Paramount Stock Surges on Reports of New Skydance Deal","id":128563333,"image":"https://s.yimg.com/ny/api/res/1.2/kPzF5Be6RlLHsSoVa2LFwg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/Barrons.com/3f2696ed2ec7c77e2db4a3ebe4a8cdc1","symbol":"PARAA","publisher":"Yahoo","summary":"Skydance is expected to pay $1.75 billion for National Amusements, the media company owned by Shari Redstone, and then merge with Paramount, The Wall Street Journal reported.","url":"https://finance.yahoo.com/m/9f9dce04-ee0e-3300-81c5-1a409da862f4/paramount-stock-surges-on.html"},{"category":"company","date":1719959595,"headline":"Skydance reaches new deal to buy controlling Paramount stake, sources say","id":128563334,"image":"https://media.zenfs.com/en/reuters-finance.com/3b0ed83c1b758e237caf9d67b2ec29fb","symbol":"PARAA","publisher":"Yahoo","summary":"LOS ANGELES (Reuters) -Shari Redstone's National Amusements has reached a preliminary deal to sell its controlling interest in Paramount Global to David Ellison's Skydance Media, three sources familiar with the matter told Reuters on Tuesday.  The news sent Paramount shares up 9% in after-hours trading.  Under the tentative agreement, Skydance would pay $1.75 billion for National Amusements, which owns 77% of the voting shares of Paramount.","url":"https://finance.yahoo.com/news/skydance-media-reaches-deal-national-223315903.html"},{"category":"company","date":1719958653,"headline":"Boeing, Tesla stock reaction, small-cap portfolio: Market Domination","id":128561252,"image":"https://s.yimg.com/ny/api/res/1.2/59u6sgmPvGAC5IKUIyNv8Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/d77e4e30-38c0-11ef-bfff-ed4039079853","symbol":"PARAA","publisher":"Yahoo","summary":"The market (^DJI, ^IXIC, ^GSPC) is heading into its final trading hour on Tuesday, but the headlines keep coming. Market Domination Hosts Seana Smith and Josh Lipton detail the biggest industry stories and stock movements ahead of the closing bell. Market Domination welcomes Barron's associate editor Al Root to discuss Boeing's (BA) latest legal obstacle as it faces potential charges from Department of Justice (DOJ) officials. Sanders Morris Harris chairman George Ball later joins the show to elaborate why he believes the US economy isn't a textbook case of being in a Goldilocks environment, but is actually reflective of a \"Winnie the Pooh\" environment. The top trending tickers on the Yahoo Finance platform this hour include Eli Lilly (LLY) and Novo Nordisk (NVO); Archer Aviation (ACHR); Paramount Global (PARA); and Nikola (NKLA). This post was written by Luke Carberry Mogan.","url":"https://finance.yahoo.com/video/boeing-tesla-stock-reaction-small-221733466.html"},{"category":"company","date":1719949805,"headline":"Paramount shares rise on report of BET's potential sale","id":128563336,"image":"https://s.yimg.com/ny/api/res/1.2/sdSTTF8BNDVEC1fxsG5muw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzQ-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/268295b0-38ab-11ef-a7eb-50f5012f6848","symbol":"PARAA","publisher":"Yahoo","summary":"Shares of Paramount Global (PARA) are rising on a Bloomberg report that the media giant will sell its Black Entertainment Television (BET) Network for $1.6 billion. The company is in exclusive talks with buyers that include its current CEO Scott Mills and Chinh Chu of CC Capital. Yahoo Finance Anchors Josh Lipton and Seana Smith break down the report and what it means for Paramount Global moving forward. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Nicholas Jacobino","url":"https://finance.yahoo.com/video/paramount-shares-rise-report-bets-195005690.html"},{"category":"company","date":1719944959,"headline":"Paramount in Talks to Sell BET Network for $1.6 Billion","id":128563337,"image":"https://s.yimg.com/ny/api/res/1.2/LqqOJZMXSCJQSDCcZvZ67g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_technology_68/40ebb3f1f0bd05bc6b6df7a8b306c546","symbol":"PARAA","publisher":"Yahoo","summary":"(Bloomberg) -- Paramount Global is in exclusive talks to sell its Black Entertainment Television network to buyers that include BET Chief Executive Officer Scott Mills and Chinh Chu, who runs the New York-based private equity firm CC Capital.Most Read from BloombergDemocrats Weigh Mid-July Vote to Formally Tap Biden as NomineePowerful Storm Beryl Aims at Jamaica After Grenada StrikeS\u0026P 500 Closes Above 5,500 in Record-Breaking Run: Markets Wrap‘Upflation’ Is the New Retail Trend Driving Up Price","url":"https://finance.yahoo.com/news/paramount-talks-sell-bet-network-182919017.html"},{"category":"company","date":1719936668,"headline":"Top Midday Stories: Tesla, GM Report Vehicle Deliveries; Biden, Sanders Say Novo Nordisk, Eli Lilly Charge 'Unconscionably' High Prices; Warner Bros. Interested in Deal With Paramount","id":128556661,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"PARAA","publisher":"Yahoo","summary":"Top Midday Stories: Tesla, GM Report Vehicle Deliveries; Biden, Sanders Say Novo Nordisk, Eli Lilly Charge 'Unconscionably' High Prices; Warner Bros. Interested in Deal With Paramount","url":"https://finance.yahoo.com/news/top-midday-stories-tesla-gm-161108111.html"},{"category":"company","date":1719928313,"headline":"Media mogul Barry Diller in talks to acquire Paramount: NYT","id":128555911,"image":"https://s.yimg.com/ny/api/res/1.2/jNLKlBd8jU8Cb8eCZvF7Zw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/ca294cf0-3878-11ef-96ce-ba0b58b14e66","symbol":"PARAA","publisher":"Yahoo","summary":"Media mogul and IAC Chairman Barry Diller is reportedly exploring a bid to acquire Paramount Global (PARA), according to New York Times reports, after his company signed non-disclosure agreements (NDAs) and is seemingly in talks with majority stakeholder National Amusements. Diller also sits as the chairman and senior executive of the Expedia Group (EXPE). The Morning Brief's Brad Smith and Madison Mills report on the news and what this could mean for Paramount's future. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Luke Carberry Mogan.","url":"https://finance.yahoo.com/video/media-mogul-barry-diller-talks-135153123.html"},{"category":"company","date":1719924780,"headline":"Tesla, Archer Aviation rise; Eli Lilly falls, Tuesday, 7/2/2024","id":128559472,"image":"","symbol":"PARAA","publisher":"Associated Press, The","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=gksot7pu59"},{"category":"company","date":1719918703,"headline":"Market Chatter: Warner Bros. Discovery in Talks with Paramount Over Potential Streaming Platform Collaboration","id":128555912,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"PARAA","publisher":"Yahoo","summary":"Market Chatter: Warner Bros. Discovery in Talks with Paramount Over Potential Streaming Platform Collaboration","url":"https://finance.yahoo.com/news/market-chatter-warner-bros-discovery-111143419.html"},{"category":"company","date":1719902786,"headline":"Wall Street Breakfast Podcast: Paramount Gains On Barry Diller Buzz, Streaming Merger Talks","id":128552597,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1492919341/image_1492919341.jpg?io=getty-c-w1536","symbol":"PARAA","publisher":"SeekingAlpha","summary":"Paramount gains on report of interest from media mogul Barry Diller/IAC. U.S. judge halts Biden administration pause on LNG export licenses. Conn's may file for Chapter 11 bankruptcy-report.","url":"https://seekingalpha.com/article/4702008-wall-street-breakfast-podcast-paramount-gains-on-barry-diller-buzz-streaming-merger-talks"},{"category":"company","date":1719890844,"headline":"Futures lower, Fed's Powell to speak, Boeing plea deal - what's moving markets","id":128552498,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"PARAA","publisher":"Yahoo","summary":"Investing.com -- U.S. stock futures edge down as investors prepare for incoming labor market data during a holiday-shortened trading week. Federal Reserve Chair Jerome Powell is due to speak at an European Central Bank event, with the Fed's potential interest rate path for the rest of the year in focus. Elsewhere, U.S. federal prosecutors are reportedly awaiting a decision from Boeing (NYSE:BA) on a plea deal to settle charges linked to two fatal crashes.","url":"https://finance.yahoo.com/news/futures-lower-feds-powell-speak-032724622.html"},{"category":"company","date":1719867119,"headline":"Consolidation is a 'requirement' in the streaming industry","id":128545953,"image":"https://s.yimg.com/ny/api/res/1.2/SD9o5wCB4JAdr8IH44dTeA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-07/41496a20-37ea-11ef-b6bf-e3d0bd3aaa85","symbol":"PARAA","publisher":"Yahoo","summary":"Paramount (PARA, PARAA) is reportedly looking to merge its Paramount+ streaming service with another platform after previous merger discussions failed to materialize in 2024. Third Bridge Group sector analyst Jamie Lumley and Manhattan Venture Partners head of research Santosh Rao join Market Domination to discuss what's next for the media giant. Lumley notes that Paramount+ trails behind other streaming competitors, the company might consider Warner Bros. Discovery (WBD) or Max as a \"good partnership.\" Rao adds that consolidation has become a \"requirement\" in the sector as he believes it's necessary to scale. \"As we think over the last few years, this streaming space overall has lost billions and billions of dollars. And it's clear that while there might be some companies here which can reach profitability, it is unlikely that all of them will be able to rebuild these streaming companies or these streaming businesses to offset, for the traditional media companies, the declining revenue and earnings that they had on the traditional linear businesses,\" Lumley says. He adds that bundling services is a way to retain customers and become profitable. Santosh believes that consolidation is \"not going to be a threat\" in the sector: \"There's not going to be a monopoly of search. It's sustainability. And these companies will just not last. So I think it's going to be healthy for the industry.\" For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Melanie Riehl","url":"https://finance.yahoo.com/video/consolidation-requirement-streaming-industry-205159872.html"},{"category":"company","date":1719867078,"headline":"Paramount Global: Navigating Leadership Changes and Financial Challenges","id":128545954,"image":"https://media.zenfs.com/en/us.finance.gurufocus/d578a731cbad4ab1934d4c37b4b6b931","symbol":"PARAA","publisher":"Yahoo","summary":"The company is facing stiff competition and financial challenges","url":"https://finance.yahoo.com/news/paramount-global-navigating-leadership-changes-205118312.html"},{"category":"company","date":1719862856,"headline":"Barry Diller considers bid for Paramount after Skydance deal falls through- NYT","id":128547691,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"PARAA","publisher":"Yahoo","summary":"Investing.com-- Billionaire Barry Diller is considering a bid to take over Paramount Global (NASDAQ:PARAA), after the studio, which he formerly led, pulled out of a merger with Skydance Media, the New York Times reported on Monday.","url":"https://finance.yahoo.com/news/barry-diller-considers-bid-paramount-194056917.html"},{"category":"company","date":1719862154,"headline":"Barry Diller's IAC explores bid to take control of Paramount, NYT reports","id":128547692,"image":"https://media.zenfs.com/en/reuters-finance.com/82d010b0ccc86a65dbac5a36a078c05d","symbol":"PARAA","publisher":"Yahoo","summary":"IAC entered into nondisclosure agreements with National Amusements, Paramount's majority shareholder, sometime after the collapse of the Paramount-Skydance deal in June, NYT said, adding it is unclear how far along the talks have progressed.  IAC said it does not comment on rumors or speculation, while Reuters could not immediately reach Redstone for comment.","url":"https://finance.yahoo.com/news/paramount-looking-streaming-partner-cnbc-192914270.html"},{"category":"company","date":1719850564,"headline":"Paramount Global explores streaming merger - CNBC","id":128547693,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"PARAA","publisher":"Yahoo","summary":"Investing.com - Paramount Global (NASDAQ:PARA) is currently in discussions with other entertainment companies about merging its Paramount+ streaming service with an existing platform. If successful, this could trigger a wave of similar partnerships across the media sector and strengthen the industry as a whole.","url":"https://finance.yahoo.com/news/paramount-global-explores-streaming-merger-161604864.html"},{"category":"company","date":1719845538,"headline":"3 Buyable Berkshire Dividend Dogs From June And 6 To Watch","id":128544596,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/155446788/image_155446788.jpg?io=getty-c-w1536","symbol":"PARAA","publisher":"SeekingAlpha","summary":"Discover the top dividend-paying stocks in Berkshire Hathaway's portfolio and learn how to maximize your investment returns with this update. Click for more.","url":"https://seekingalpha.com/article/4701906-3-buyable-berkshire-dividend-dogs-from-june-and-6-to-watch"},{"category":"company","date":1719762465,"headline":"Free streaming channels have become 'sleeping giants' as Netflix, Max, others hike prices","id":128535276,"image":"https://s.yimg.com/ny/api/res/1.2/GhpJLZykSlOiHb69jFiGWA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-06/1fa059f0-32fa-11ef-bf34-44dcc96adb7b","symbol":"PARAA","publisher":"Yahoo","summary":"More consumers are choosing to watch free, ad-supported streaming platforms amid the rapid rise of subscription prices from traditional streamers.","url":"https://finance.yahoo.com/news/free-streaming-channels-have-become-sleeping-giants-as-netflix-max-others-hike-prices-154745358.html"},{"category":"company","date":1719564860,"headline":"Unpacking Q1 Earnings: Paramount (NASDAQ:PARA) In The Context Of Other Broadcasting Stocks","id":128505087,"image":"https://s.yimg.com/ny/api/res/1.2/5vdBZZG.Pv1raY1sjpValg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/stockstory_922/5b8f85bace10c314146ab00363beb225","symbol":"PARAA","publisher":"Yahoo","summary":"Quarterly earnings results are a good time to check in on a company’s progress, especially compared to its peers in the same sector. Today we are looking at Paramount (NASDAQ:PARA) and the best and worst performers in the broadcasting industry.","url":"https://finance.yahoo.com/news/unpacking-q1-earnings-paramount-nasdaq-085420084.html"},{"category":"company","date":1719459420,"headline":"Jury says NFL must pay $4.7B in damages in Sunday Ticket case, Bloomberg says","id":128493219,"image":"","symbol":"PARAA","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3557628316"}]}