{"id":4060,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2002-03-11","marketCap":317.3760681152344,"name":"MVB Financial Corp","phone":"13043634800","outstanding":12.890000343322754,"symbol":"MVBF","website":"https://ir.mvbbanking.com/","industry":"Banking"},"price":24.285,"year":2024,"month":7,"day":24,"weekday":"Wednesday","title":"Historical Stock Price Performance of MVB Financial Corp","date":"2024-07-24","url":"/posts/2024/07/24/MVBF","content":[{"section":"2008 Financial Crisis","text":"During the 2008 financial crisis, MVB Financial Corp (MVB) stock experienced a significant decline in value. The crisis was triggered by the collapse of Lehman Brothers and led to a severe global economic downturn. MVB stock, like many other financial institutions, suffered from investor panic and a lack of confidence. The stock price plummeted from its peak of $30 in early 2008 to a low of $5 in early 2009."},{"section":"Recovery and Bull Market","text":"Following the financial crisis, the stock market gradually recovered, and MVB Financial Corp benefited from the overall improvement in economic conditions. As the economy stabilized and investor confidence returned, MVB's stock price started to climb. It reached a peak of $35 in mid-2011, reflecting the optimism of the post-crisis recovery and the start of a bull market."},{"section":"2015 Oil Price Crash","text":"In 2015, the global oil market experienced a significant crash, with oil prices plunging due to oversupply. This oil price crash had a negative impact on MVB Financial Corp stock, as it dampened investor sentiment and raised concerns about the financial health of oil-dependent regions. MVB's stock price dipped from around $25 in mid-2014 to $15 in early 2016."},{"section":"2016 Presidential Election","text":"The 2016 US presidential election was a major market event that created significant volatility. Initially, the election of Donald Trump as President sparked a rally across various sectors, including financial stocks like MVB. The stock price surged from around $15 in November 2016 to over $40 in March 2017, driven by expectations of deregulation and tax cuts. However, the rally was followed by a period of consolidation and uncertainty."},{"section":"COVID-19 Pandemic","text":"The COVID-19 pandemic, which emerged in early 2020, had a profound impact on global financial markets. MVB Financial Corp stock was not immune to the market turmoil caused by the pandemic. In February and March 2020, as lockdowns were imposed and economic activity came to a halt, MVB's stock price dropped from around $30 to below $10. However, as governments and central banks implemented stimulus measures, the stock market gradually recovered, including MVB's stock price."},{"section":"Current Market Situation","text":"As of the most recent data, MVB Financial Corp's stock price is fluctuating in response to various market factors, including economic indicators, interest rates, and investor sentiment. It is essential to closely monitor the current market situation and relevant events to assess the stock's performance accurately."}],"tags":["CrossOver21","Long","Banking"],"news":[{"category":"company","date":1721718060,"headline":"MVB Financial Reaches Analyst Target Price","id":128860816,"image":"","symbol":"MVBF","publisher":"ETF Channel","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3568145400"},{"category":"company","date":1721041800,"headline":"TimesSquare Capital U.S. Small Cap Growth Q2 2024 Commentary","id":128699581,"image":"https://media.gettyimages.com/id/2157912644/photo/goal-setting-for-greater-growth-achieving-higher-objectives.jpg?b=1\u0026s=170667a\u0026w=0\u0026k=20\u0026c=g6VJYWW-dvD1ItUVTMks1h8axg1iReZgeQBQZ8s7suA=","symbol":"MVBF","publisher":"SeekingAlpha","summary":"TimesSquare Capital US Small Cap Growth portfolio outperformed the Russell 2000® Growth Index in Q2 2024. Click here to read the full commentary.","url":"https://seekingalpha.com/article/4704119-timessquare-capital-us-small-cap-growth-q2-2024-commentary"}]}