{"id":1606,"company":{"country":"US","currency":"USD","exchange":"NEW YORK STOCK EXCHANGE, INC.","ipo":"1987-10-13","marketCap":5513.96,"name":"Coherent Corp","phone":"17243524455.0","outstanding":151.41,"symbol":"COHR","website":"https://www.ii-vi.com/","industry":"Electrical Equipment"},"price":41.493126,"year":2023,"month":12,"day":12,"weekday":"Tuesday","title":"Historical Price-to-Book Ratio Trends of Coherent Corp","date":"2023-12-12","url":"/posts/2023/12/12/COHR","content":[{"section":"Introduction","text":"The price-to-book (P/B) ratio is a financial metric used by investors to assess the market price of a company's stock relative to its book value. It is calculated by dividing the current market price per share by the book value per share. A higher P/B ratio implies that investors are willing to pay a premium for the company's assets, while a lower P/B ratio suggests that the stock may be undervalued."},{"section":"Historical P/B Ratio Data of Coherent Corp","text":"Year 2016: 2.85\nYear 2017: 3.17\nYear 2018: 4.02\nYear 2019: 3.94\nYear 2020: 4.76"},{"section":"Analysis of P/B Ratio Trends","text":"Coherent Corp's historical P/B ratio reveals an increasing trend from 2016 to 2020. This indicates that investors were willing to pay a higher premium for the company's assets during this period, suggesting positive market sentiment and potential overvaluation. The P/B ratio increased from 2.85 in 2016 to 4.76 in 2020, reflecting a significant rise in market price relative to book value."},{"section":"Relevance for Investors","text":"The historical P/B ratio trends of Coherent Corp stock can be relevant for investors in several ways. Firstly, a rising P/B ratio may indicate positive market expectations and growth prospects for the company. However, investors need to analyze whether this increase is warranted based on the company's financial performance and future prospects. Secondly, a high P/B ratio suggests that the stock may be overvalued, warranting caution before making investment decisions. Conversely, a low P/B ratio may indicate potential undervaluation, presenting an opportunity for value investors. Ultimately, investors should consider multiple financial metrics and conduct a comprehensive analysis before making investment decisions."}],"tags":["CrossOver21","Long","Electrical Equipment"],"news":[{"category":"company","date":1702137933,"headline":"Insider Sell: Coherent Corp's CTO Julie Eng Divests 9,901 Shares","id":124414038,"image":"https://media.zenfs.com/en/us.finance.gurufocus/67155f507593ce1ca3d48236d904cde2","symbol":"COHR","publisher":"Yahoo","summary":"In a notable insider transaction, Julie Eng, the Chief Technology Officer of Coherent Corp (NYSE:COHR), sold 9,901 shares of the company on December 6, 2023.","url":"https://finance.yahoo.com/news/insider-sell-coherent-corps-cto-160533776.html"},{"category":"company","date":1702000980,"headline":"Catalyst Watch: Intel's AI event, Oracle earnings and CAVA IPO lockup expiration","id":124396360,"image":"","symbol":"COHR","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3248254483"},{"category":"company","date":1701946800,"headline":"Coherent Unveils Industry’s First 800G ZR/ZR+ Transceiver in Ultracompact QSFP-DD Pluggable Form Factor for Optical Communications Networks","id":124358034,"image":"https://s.yimg.com/ny/api/res/1.2/2C3XA4lQbkLNoa3bKlr_AQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/globenewswire.com/123fb59ec958290bd2d0652abe4171f2","symbol":"COHR","publisher":"Yahoo","summary":"The new transceiver leverages the 140 GBaud IC-TROSA from Coherent, which was announced and demonstrated at ECOC 2023 Coherent unveils the industry's first 800G ZR/ZR+ transceiver in ultracompact QSFP-DD pluggable form factor. The 800G ZR/ZR+ transceivers from Coherent are the world’s first digital coherent optics (DCO) that can plug directly into QSFP-DD and OSFP transceiver slots on IP routers. Leveraging their high output power of 0 dBm, these transceivers can connect routers directly to acce","url":"https://finance.yahoo.com/news/coherent-unveils-industry-first-800g-110000143.html"},{"category":"company","date":1701725400,"headline":"Coherent’s Silicon Carbide Semiconductor Business Completes $1 Billion in Investments From DENSO and Mitsubishi Electric","id":124293200,"image":"https://s.yimg.com/ny/api/res/1.2/f0rnz2IZk1WqlQAPlYNcFA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/globenewswire.com/5b1721549f3e8c00f2d58b4258343378","symbol":"COHR","publisher":"Yahoo","summary":"Silicon Carbide Substrate Coherent Corp. manufactures silicon carbide substrates for power electronics used in electric vehicles. DENSO and Mitsubishi Electric each invested $500 million for a 12.5% non-controlling interest in the silicon carbide semiconductor business Coherent entered into arm’s-length long-term supply agreements with DENSO and Mitsubishi Electric to support their 150 mm and 200 mm substrate and epitaxial wafer demandThe silicon carbide semiconductor business will fund future c","url":"https://finance.yahoo.com/news/coherent-silicon-carbide-semiconductor-business-213000308.html"},{"category":"company","date":1701400560,"headline":"Coherent (COHR) Shares Cross Above 200 DMA","id":124248587,"image":"","symbol":"COHR","publisher":"Market News Video","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3237450766"},{"category":"company","date":1701391735,"headline":"Sweden's Viaplay to raise equity, restructure debt","id":124218835,"image":"","symbol":"COHR","publisher":"Finnhub","summary":"Struggling Swedish streamingcompany Viaplay on Friday said it planned to raise 4billion Swedish crowns in new equity, write down2 billion crowns in debt and renegotiate the terms of debttotalling...","url":"https://finnhub.io/api/news?id=d860d9761c70e95d01e392b8e4c7b0ad9a54909c7557428becd9cf10c43b4484"},{"category":"company","date":1701271366,"headline":"Ion The Prize: Axcelis Technologies' Strategic Surge","id":124174335,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1441269828/image_1441269828.jpg?io=getty-c-w1536","symbol":"COHR","publisher":"SeekingAlpha","summary":"Axcelis shows strong growth in semiconductor ion implantation, outperforming peers amid industry challenges. Click here to read an analysis of ACLS stock now.","url":"https://seekingalpha.com/article/4654962-ion-the-prize-axcelis-technologies-strategic-surge"},{"category":"company","date":1701255600,"headline":"Coherent Announces Date of Its Industrial Market Overview Webcast","id":124177556,"image":"https://media.zenfs.com/en/globenewswire.com/74035539bff67c5dd8ef580d1544de2d","symbol":"COHR","publisher":"Yahoo","summary":"PITTSBURGH, Nov. 29, 2023 (GLOBE NEWSWIRE) -- Coherent Corp. (NYSE: COHR), a global leader in materials, networking, and lasers, announced today that the company will hold an Industrial Market Overview webcast for investors, equity analysts, and the public on Thursday, December 14, 2023, at 10:00 a.m. ET. Individuals wishing to view the two-hour webcast can access the event at the company’s website by visiting coherent.com/company/investor-relations/financial-webcasts or via this link. The event","url":"https://finance.yahoo.com/news/coherent-announces-date-industrial-market-110000964.html"},{"category":"company","date":1701223645,"headline":"Coherent: Strong SiC Growth In Robust Global EV Sector Despite U.S. Slump","id":124160663,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1448196521/image_1448196521.jpg?io=getty-c-w1536","symbol":"COHR","publisher":"SeekingAlpha","summary":"Coherent dominates optical transceiver and silicon carbide markets, benefiting from strong growth in AI-related datacom and EV automobile sectors. Read more here.","url":"https://seekingalpha.com/article/4654790-coherent-stock-strong-sic-growth-robust-global-ev-sector-despite-us-slump"}]}