{"id":1632,"company":{"country":"US","currency":"USD","exchange":"NEW YORK STOCK EXCHANGE, INC.","ipo":"2013-10-02","marketCap":2440.72412109375,"name":"Empire State Realty OP, L.P.","phone":"+12126878700","outstanding":20.327899932861328,"symbol":"ESBA","website":"https://www.empirestaterealtytrust.com","industry":"Real Estate"},"price":9.035,"year":2023,"month":12,"day":12,"weekday":"Tuesday","title":"Historical Stock Price Performance of Empire State Realty OP, L.P. during Significant Market Events","date":"2023-12-12","url":"/posts/2023/12/12/ESBA","content":[{"section":"Market Event: Dot-com Bubble (2000-2002)","text":"During the dot-com bubble from 2000 to 2002, the stock market experienced a significant crash due to overvaluation of internet-based companies. Empire State Realty OP, L.P. was not publicly traded at that time, so its stock price performance was not directly affected by this market event."},{"section":"Market Event: Global Financial Crisis (2007-2009)","text":"The global financial crisis from 2007 to 2009 was triggered by the subprime mortgage bubble burst in the United States. Empire State Realty OP, L.P. became a publicly traded company in October 2013, after the financial crisis had already passed. Therefore, its stock price performance during this event does not provide relevant historical data."},{"section":"Market Event: COVID-19 Pandemic (2020)","text":"The COVID-19 pandemic, which started in early 2020, led to a global stock market crash. Empire State Realty OP, L.P. was affected by this market event, as the pandemic had a significant negative impact on the real estate industry. From February to March 2020, the stock price of Empire State Realty OP, L.P. declined by approximately 50% as uncertainty and market volatility increased. However, it gradually recovered over time as the markets stabilized and vaccination efforts began."},{"section":"Market Event: Bull Market (2009-present)","text":"Since the global financial crisis in 2009, the stock market has been on a long bull run. Empire State Realty OP, L.P. has experienced overall positive stock price performance during this period. However, it is essential to consider other factors such as economic conditions and company-specific news that may have influenced its stock price."},{"section":"Market Event: Vaccine Announcement (November 2020)","text":"In November 2020, several pharmaceutical companies announced positive results regarding COVID-19 vaccine development. This news had a positive impact on global stock markets, including Empire State Realty OP, L.P. The company's stock price witnessed a significant uptick as investors gained confidence in the potential recovery of the real estate sector."},{"section":"Market Event: GameStop Short Squeeze (January 2021)","text":"In January 2021, a group of retail investors on Reddit targeted GameStop's heavily shorted stock. This event caused a short squeeze and resulted in a significant rally in GameStop's stock price. However, Empire State Realty OP, L.P. did not experience any direct impact from this event."}],"tags":["CrossOver100","Long","Real Estate"],"news":null}