{"id":1589,"company":{"country":"AU","currency":"AUD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2022-08-25","marketCap":7.863110065460205,"name":"Mobilicom Ltd","phone":"61413535222","outstanding":4.820000171661377,"symbol":"MOB","website":"https://mobilicom.com/","industry":"Communications"},"price":1.610525,"year":2023,"month":12,"day":12,"weekday":"Tuesday","title":"Corporate Governance Practices of Mobilicom Ltd","date":"2023-12-12","url":"/posts/2023/12/12/MOB","content":[{"section":"Board Composition","text":"Mobilicom Ltd has a board of directors composed of six members. The board includes both executive and non-executive directors. The executive directors are responsible for the day-to-day operations of the company, while the non-executive directors provide independent oversight and guidance. This composition helps to ensure a balance of expertise and perspectives in the decision-making process."},{"section":"Executive Compensation","text":"Mobilicom Ltd follows a structured approach to executive compensation. The company's executive compensation policy is designed to align the interests of executives with those of shareholders and promote long-term value creation. The compensation package includes a mix of fixed salary, variable performance-based incentives, and equity-based rewards. This helps to incentivize executives to achieve strategic objectives and drives performance."},{"section":"Governance Insights","text":"The board composition of Mobilicom Ltd reflects a good balance between executive and non-executive directors, ensuring a diversity of perspectives and independent oversight. This promotes robust decision-making and reduces the risk of conflicts of interest. The company's executive compensation policy is also well-structured, aligning executive interests with long-term shareholder value creation. This encourages executives to drive performance and achievement of company goals."}],"tags":["CrossOver21","Long","Communications"],"news":[{"category":"company","date":1702019400,"headline":"12 Information Technology Stocks Moving In Friday's Pre-Market Session","id":124389403,"image":"","symbol":"MOB","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3247750379"},{"category":"company","date":1701439200,"headline":"Mobilicom and Royalty Management Interviews to Air on the RedChip Small Stocks Big Money(R) Show on Bloomberg TV","id":124229573,"image":"https://media.zenfs.com/en/accesswire.ca/dfb0cf442592690230acaf832878a24e","symbol":"MOB","publisher":"Yahoo","summary":"ORLANDO, FL / ACCESSWIRE / December 1, 2023 / RedChip Companies will air interviews with Mobilicom Limited (NASDAQ:MOB)(NASDAQ:MOBBW) and Royalty Management Holding Co. (NASDAQ:RMCO)(NASDAQ:RMCOW) on The RedChip Small Stocks Big Money® Show, a sponsored ...","url":"https://finance.yahoo.com/news/mobilicom-royalty-management-interviews-air-140000534.html"}]}