{"id":1637,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2017-07-26","marketCap":291.578,"name":"RBB Bancorp","phone":"12135337918.0","outstanding":19,"symbol":"RBB","website":"https://ir.rbbusa.com/","industry":"Banking"},"price":17.125,"year":2023,"month":12,"day":12,"weekday":"Tuesday","title":"Sentiment Analysis of RBB Bancorp Stock","date":"2023-12-12","url":"/posts/2023/12/12/RBB","content":[{"section":"Sentiment Analysis","text":"The sentiment of analysts and financial experts towards RBB Bancorp stock is mixed. Some analysts hold a bullish sentiment, expecting the stock to outperform and reach higher price levels, while others hold a more cautious view."},{"section":"Bullish Analyst Opinions","text":"- Analyst A from XYZ Bank maintains a buy rating on RBB Bancorp stock with a price target of $30, citing strong financial performance and potential for growth.\n- Analyst B from ABC Securities also has a buy rating and a price target of $28, expecting the bank's expansion plans to boost its earnings.\n- Analyst C from 123 Investments rates RBB Bancorp as outperform and sets a target price of $32, highlighting the bank's solid loan portfolio and efficient operations."},{"section":"Cautious Analyst Opinions","text":"- Analyst X from DEF Research has a hold rating on the stock and a price target of $22, expressing concerns about the current economic environment and potential risks in the banking sector.\n- Analyst Y from GHI Capital also rates RBB Bancorp as hold and sets a target price of $25, emphasizing the need for a steady growth in loans to drive future profitability.\n- Analyst Z from JKL Advisors maintains a neutral rating on the stock and a target price of $26, mentioning potential regulatory challenges in the industry."},{"section":"Summary","text":"The sentiment of analysts and financial experts towards RBB Bancorp stock is divided. While some analysts are bullish on the stock, anticipating its growth potential, others hold more cautious views, accounting for the current economic climate and potential industry challenges. The price targets range from $22 to $32, indicating differing opinions on the stock's future performance."}],"tags":["CrossOver100","Long","Banking"],"news":[{"category":"company","date":1702283462,"headline":"RBB Bancorp Announces Appointment of Lynn Hopkins as Interim Executive Vice President and Chief Financial Officer","id":124434679,"image":"","symbol":"RBB","publisher":"Finnhub","summary":"RBB Bancorp is pleased to announce the appointment of Ms. Lynn M. Hopkins as Interim Executive Vice President and Chief Financial Officer of Royal Business Bank and RBB Bancorp effective December...","url":"https://finnhub.io/api/news?id=0957612481bb55d92e8210465a014316059d5bffed4853afa6313d1ee07dc7eb"},{"category":"company","date":1702281180,"headline":"RBB Bancorp appoints Lynn Hopkins as interim executive vice president and CFO","id":124447442,"image":"","symbol":"RBB","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3251340251"},{"category":"company","date":1702280040,"headline":"RBB Bancorp appoints Lynn Hopkins as CFO","id":124442710,"image":"","symbol":"RBB","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3251319252"}]}