{"id":3723,"company":{"country":"US","currency":"USD","exchange":"NYSE MKT LLC","ipo":"1988-08-03","marketCap":543.54736328125,"name":"Tellurian Inc","phone":"18329624000","outstanding":836.22998046875,"symbol":"TELZ","website":"https://www.tellurianinc.com/","industry":"Energy"},"price":15.13,"year":2024,"month":6,"day":6,"weekday":"Thursday","title":"Corporate Governance Practices of Tellurian Inc","date":"2024-06-06","url":"/posts/2024/06/06/TELZ","content":[{"section":"Board Composition","text":"Tellurian Inc's board of directors is comprised of nine members, including the CEO and Chairman. The board is primarily composed of independent directors, with only one insider serving as a director. This promotes accountability and objectivity in decision-making."},{"section":"Board Independence","text":"The majority of Tellurian Inc's directors are independent, ensuring a balance of power and reducing conflicts of interest. Independent directors make up six out of the nine total board members, strengthening the oversight and decision-making processes."},{"section":"Committees","text":"Tellurian Inc's board has established various committees to enhance governance. These include the Audit, Compensation, Nominating and Corporate Governance, and Health, Safety, and Environment committees. These committees allow for specialized focus on important matters and ensure proper due diligence."},{"section":"Executive Compensation","text":"Tellurian Inc has a structured approach to executive compensation. The company's compensation program is designed to align the interests of executives with those of shareholders. It includes a mix of base salary, annual incentives, and long-term equity awards, ensuring performance-based rewards."},{"section":"Transparency","text":"Tellurian Inc demonstrates a commitment to transparency by providing detailed information on corporate governance practices on its website. This includes information on board structure, committees, and executive compensation. Transparency fosters trust and accountability among shareholders and stakeholders."},{"section":"Shareholder Rights","text":"Tellurian Inc recognizes the importance of shareholder rights. The company's bylaws provide mechanisms for shareholders to participate in important decisions through voting rights and allows shareholders to propose nominees for director positions. This ensures shareholder engagement and democratic decision-making."},{"section":"Evaluation and Renewal","text":"Tellurian Inc conducts regular evaluations of its board and committees, assessing their effectiveness and performance. This practice enables the company to identify areas for improvement and make necessary changes to enhance governance practices."},{"section":"Conclusion","text":"Tellurian Inc exhibits strong corporate governance practices with a focus on board independence, committee structure, executive compensation alignment, transparency, and shareholder rights. These practices contribute to effective decision-making, risk management, and the protection of shareholder interests."}],"tags":["CrossOver21","Long","Energy"],"news":[{"category":"company","date":1717437258,"headline":"10% Yielding Portfolio Investments Revealed By Broadening Market Strength","id":128054823,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/684123206/image_684123206.jpg?io=getty-c-w1536","symbol":"TELZ","publisher":"SeekingAlpha","summary":"The Magnificent 7 stocks and capitalization weighted indices like the S\u0026P 500 and NASDAQ 100 appear to be peaking. Explore more details here.","url":"https://seekingalpha.com/article/4697230-10-percent-yielding-portfolio-investments-revealed-by-broadening-market-strength"}]}