{"id":4138,"company":{"country":"JP","currency":"JPY","exchange":"TOKYO STOCK EXCHANGE-TOKYO PRO MARKET","ipo":"1949-05-16","marketCap":699947.1875,"name":"TOTO Ltd","phone":"81939512052","outstanding":169.62860107421875,"symbol":"TOTDY","website":"https://jp.toto.com/","industry":"Building"},"price":29.355,"year":2024,"month":8,"day":1,"weekday":"Thursday","title":"Ownership structure of TOTO Ltd stock","date":"2024-08-01","url":"/posts/2024/08/01/TOTDY","content":[{"section":"Institutional Investors","text":"As of the latest available data, TOTO Ltd has a significant percentage of its shares held by institutional investors. These institutional investors include both investment management firms and mutual funds. The exact ownership percentages may vary over time as institutional investors buy or sell shares. It is recommended to refer to the latest public filings or official reports for the most up-to-date information."},{"section":"Insider Ownership","text":"Insider ownership refers to shares of a company held by individuals who have a direct or indirect connection to the company, such as executives, directors, or employees. Insider ownership can provide insights into the level of confidence and alignment of interests between insiders and shareholders. However, the specific insider ownership data for TOTO Ltd is not available in the given context. It is advisable to consult the company's official filings or reports for accurate and up-to-date information."},{"section":"Major Shareholders","text":"The major shareholders of TOTO Ltd are often individuals or entities that hold a significant portion of the company's outstanding shares. These major shareholders may include institutional investors, high net worth individuals, or large investment firms. Unfortunately, the specific data regarding major shareholders of TOTO Ltd is not provided in the given context. To obtain the latest and accurate information regarding major shareholders, it is recommended to refer to the company's official filings or reports."}],"tags":["CrossOver21","Long","Building"],"news":null}