{"id":2734,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2021-10-08","marketCap":322.9169616699219,"name":"AEON Biopharma Inc","phone":"19492844555.0","outstanding":37.15549850463867,"symbol":"AEON","website":"https://www.aeonbiopharma.com/","industry":"N/A"},"price":8.381125,"year":2024,"month":1,"day":27,"weekday":"Saturday","title":"Corporate Governance Practices of AEON Biopharma Inc","date":"2024-01-27","url":"/posts/2024/01/27/AEON","content":[{"section":"Board Composition","text":"AEON Biopharma Inc has a well-diversified board of directors composed of experienced professionals from various backgrounds. The board consists of seven members, including four independent directors and three executive directors. This composition ensures a balance of independent perspectives and industry expertise, promoting effective decision-making and risk management."},{"section":"Executive Compensation","text":"AEON Biopharma Inc follows a transparent and performance-based approach to executive compensation. The company's compensation committee, comprised of independent directors, sets executive salaries and incentives. The compensation structure is aligned with the company's long-term goals and focuses on key performance indicators, such as revenue growth, profitability, and shareholder returns. By linking executive compensation to performance, AEON Biopharma Inc incentivizes its executives to drive value creation for shareholders."},{"section":"Corporate Governance Policies","text":"AEON Biopharma Inc has implemented robust corporate governance policies to safeguard the interests of stakeholders. The company has adopted a code of conduct that outlines ethical standards and promotes integrity in business operations. Additionally, AEON Biopharma Inc has established clear guidelines for risk management practices, internal controls, and audit processes, ensuring transparency and accountability within the organization."},{"section":"Shareholder Rights","text":"AEON Biopharma Inc recognizes the importance of protecting shareholder rights. The company regularly communicates with its shareholders through investor relations activities, annual general meetings, and quarterly reports. Shareholders are provided with timely and accurate information to make informed decisions and exercise their voting rights. AEON Biopharma Inc also encourages shareholders to actively participate in corporate governance by providing avenues for feedback and engagement."},{"section":"Board Evaluation and Oversight","text":"AEON Biopharma Inc conducts regular evaluations of its board and individual directors to ensure their effectiveness and independence. This evaluation process helps identify areas for improvement and enhances the overall governance structure. The board exercises strong oversight over the company's performance, strategic direction, and risk management, ensuring alignment with shareholder interests and long-term sustainability."},{"section":"Conclusion","text":"AEON Biopharma Inc demonstrates a commitment to sound corporate governance practices. By maintaining diverse board composition, aligning executive compensation with performance, implementing robust policies, protecting shareholder rights, and conducting regular board evaluations, the company fosters transparency, accountability, and effective decision-making. These governance practices contribute to AEON Biopharma Inc's long-term success and stakeholder value creation."}],"tags":["CrossOver21","Long","Other"],"news":[{"category":"company","date":1705611900,"headline":"AEON Biopharma Presents Positive Clinical and Pre-clinical Data for ABP-450 (prabotulinumtoxinA) in Treating Cervical Dystonia and PTSD, Respectively, at a Leading Neurotoxin Conference","id":125148111,"image":"https://media.zenfs.com/en/globenewswire.com/b3a2f4b01bae008546b8404ef24c6cc7","symbol":"AEON","publisher":"Yahoo","summary":"– Open label extension (OLE) Phase 2 data show peak efficacy for all ABP-450 doses and cycles in treating cervical dystonia (CD) occurred early, within 4 weeks; durability of effect was demonstrated 12 to 16 weeks post treatment – – Early-phase, original research illustrated successful implementation of image-guided Stellate Ganglion Block (SGB) using ABP-450 both as monotherapy and in conjunction with lidocaine as a preclinical model for treating PTSD – IRVINE, Calif., Jan. 18, 2024 (GLOBE NEWS","url":"https://finance.yahoo.com/news/aeon-biopharma-presents-positive-clinical-210500488.html"},{"category":"company","date":1705547760,"headline":"Aeon Biopharma presents new data from ABP-450 trial","id":125157113,"image":"","symbol":"AEON","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3306478626"}]}