{"id":43,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2014-10-23","marketCap":294.869,"name":"Soleno Therapeutics Inc","phone":"16502138444.0","outstanding":9.99,"symbol":"SLNO","website":"https://soleno.life/","industry":"Biotechnology"},"direction":"Long","price":23.855,"year":2023,"month":9,"day":27,"weekday":"Wednesday","title":"Corporate Governance Practices of Soleno Therapeutics Inc","date":"2023-09-27","url":"/posts/2023/09/27/SLNO","content":[{"section":"Board Composition","text":"Soleno Therapeutics Inc has a diverse board composition, consisting of directors with a range of expertise and experience in the pharmaceutical and biotechnology industries. The board includes both independent directors and company executives, ensuring a balance of perspectives and interests. This composition promotes accountability and effective decision-making."},{"section":"Independence","text":"Soleno Therapeutics Inc emphasizes the importance of board independence and has a majority of independent directors on its board. Independent directors play a crucial role in providing unbiased oversight and protecting the interests of shareholders. This commitment to independence enhances the credibility of the company's governance practices."},{"section":"Executive Compensation","text":"Soleno Therapeutics Inc follows a structured and transparent approach to executive compensation. The company has a compensation committee responsible for determining executive salaries, bonuses, and equity awards. The committee ensures alignment between executive pay and the company's performance, promoting a focus on long-term value creation for shareholders. Executive compensation is also disclosed in the company's proxy statement, enhancing transparency."},{"section":"Incentives and Performance Metrics","text":"Soleno Therapeutics Inc's executive compensation program includes a mix of cash, equity, and performance-based incentives. These incentives are often tied to key performance metrics, such as financial targets, clinical trial milestones, and overall company performance. By linking compensation to specific goals, the company motivates executives to drive outcomes that align with shareholder interests and strategic objectives."},{"section":"Shareholder Engagement","text":"Soleno Therapeutics Inc values shareholder engagement and regularly communicates with its shareholders through various channels. The company provides opportunities for shareholders to vote on important matters, participate in shareholder meetings, and voice their concerns. This open dialogue fosters trust, transparency, and accountability between the company and its shareholders."},{"section":"Risk Oversight","text":"Soleno Therapeutics Inc maintains a robust system of risk oversight and management. The board actively oversees and assesses the company's risk profile, including financial, operational, and compliance risks. The board, in collaboration with management, establishes risk mitigation strategies and monitors their implementation. This focus on risk management helps safeguard the interests of shareholders and protects the long-term sustainability of the company."},{"section":"Ethics and Compliance","text":"Soleno Therapeutics Inc prioritizes ethics and compliance in its corporate governance practices. The company has a code of conduct that outlines expected behaviors for directors, executives, and employees. This code of conduct ensures adherence to legal and ethical standards, promoting integrity and responsible business practices. Soleno Therapeutics Inc also maintains a whistleblower hotline to encourage the reporting of any misconduct or violations."},{"section":"Conclusion","text":"Soleno Therapeutics Inc demonstrates strong corporate governance practices through its board composition, emphasis on independence, transparent executive compensation, shareholder engagement, risk oversight, and commitment to ethics and compliance. These practices ensure accountability, protect shareholder interests, and contribute to the long-term success of the company."}],"tags":["stock","Biotechnology"],"news":null}