{"id":2624,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2020-02-28","marketCap":63.59077835083008,"name":"Passage Bio Inc","phone":"12678660312","outstanding":54.81999969482422,"symbol":"PASG","website":"https://www.passagebio.com/","industry":"Biotechnology"},"price":1.115,"year":2024,"month":1,"day":10,"weekday":"Wednesday","title":"Ownership Structure of Passage Bio Inc Stock","date":"2024-01-10","url":"/posts/2024/01/10/PASG","content":[{"section":"Institutional Investors","text":"As of September 2021, the top institutional shareholders of Passage Bio Inc are:\n\n1. BlackRock Inc - BlackRock is the largest institutional shareholder of Passage Bio Inc, owning approximately 18.8% of the company's outstanding shares.\n\n2. The Vanguard Group - The Vanguard Group is the second-largest institutional shareholder, holding around 14.5% of the company's shares.\n\n3. Fidelity Management \u0026 Research Company LLC - Fidelity Management \u0026 Research Company owns approximately 6.6% of Passage Bio Inc's stock.\n\n4. Franklin Resources Inc - Franklin Resources holds around 5.1% of the company's outstanding shares.\n\n5. Invus Public Equities Advisors LLC - Invus Public Equities Advisors owns approximately 4.7% of Passage Bio Inc's stock."},{"section":"Insider Ownership","text":"Insider ownership refers to the ownership of company stock by individuals who have close ties to the company, such as executives, directors, or major shareholders. As of the latest available information, key insiders and their ownership stakes in Passage Bio Inc are:\n\n1. New Enterprise Associates (NEA) - NEA is a venture capital firm that is a major shareholder in Passage Bio Inc, owning around 28.8% of the company's outstanding shares.\n\n2. OrbiMed Advisors LLC - OrbiMed Advisors holds approximately 16.4% of the company's shares through its various funds. It is an investment firm specializing in the healthcare sector.\n\n3. Vivo Capital LLC - Vivo Capital owns around 10.1% of Passage Bio Inc's stock. It is a healthcare-focused investment firm.\n\n4. Access Industries Holdings LLC - Access Industries holds approximately 9.8% of the company's outstanding shares. It is an industrial group with investments in various sectors, including pharmaceuticals."}],"tags":["CrossOver21","Long","Biotechnology"],"news":[{"category":"company","date":1703866774,"headline":"Passage Bio : IN THE COURT OF CHANCERY OF THE STATE OF DELAWARE - Form 8-K","id":124770791,"image":"","symbol":"PASG","publisher":"Finnhub","summary":"IN THE COURT OF CHANCERY OF THE STATE OF DELAWARE TARA M. WILLIAMS, derivatively on behalf of PASSAGE BIO, INC., ...","url":"https://finnhub.io/api/news?id=302821ee6e0512e148a401bde3f2295ac7faf9e2b83f6cd3b6108c08c41914e2"}]}