{"id":3631,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2018-03-16","marketCap":275.5719909667969,"name":"Red Violet Inc","phone":"15617574000","outstanding":13.729999542236328,"symbol":"RDVT","website":"https://redviolet.com/","industry":"Technology"},"price":20.085,"year":2024,"month":5,"day":23,"weekday":"Thursday","title":"Impact of corporate earnings reports on Red Violet Inc stock's price movements","date":"2024-05-23","url":"/posts/2024/05/23/RDVT","content":[{"section":"Earnings Report 1","text":"In the Q2 2021 earnings report, Red Violet Inc reported revenue of $14.5 million, a 26% increase compared to the previous quarter. This positive revenue growth exceeded market expectations and led to an immediate spike in the company's stock price. The stock jumped by 10% within hours of the earnings report's release."},{"section":"Earnings Report 2","text":"However, in the Q3 2021 earnings report, Red Violet Inc announced a decline in revenue to $12.8 million, missing analysts' estimates by 7%. This disappointing result created uncertainty among investors, causing the stock price to drop by 15% in the following trading session. The lower revenue and the failure to meet expectations resulted in a significant sell-off by market participants."},{"section":"Earnings Report 3","text":"In the Q4 2021 earnings report, Red Violet Inc surprised analysts and investors with record-breaking revenue of $17.2 million, representing a 34% increase from the previous quarter. This outstanding performance fueled optimism and attracted new investors to the stock. Consequently, Red Violet Inc's stock price showed a substantial gain of 12% in the days following the earnings release."},{"section":"Earnings Report 4","text":"For the Q1 2022 earnings report, Red Violet Inc reported revenue of $15.6 million, meeting market expectations. The stock price remained relatively stable, with minor fluctuations, as the result aligned with investors' expectations. The lack of surprises in the earnings report limited the impact on the stock price."},{"section":"Earnings Report 5","text":"In the most recent Q2 2022 earnings report, Red Violet Inc reported revenue of $13.2 million, falling 10% short of analysts' estimates. This unexpected revenue miss led to a significant sell-off, causing the stock price to plummet by 20% in the days following the earnings release. Investors reacted strongly to the disappointment, resulting in a highly bearish sentiment towards Red Violet Inc's stock."}],"tags":["CrossOver21","Long","Technology"],"news":[{"category":"company","date":1716314683,"headline":"A Look At The Fair Value Of Red Violet, Inc. (NASDAQ:RDVT)","id":127829574,"image":"https://media.zenfs.com/en/simply_wall_st__316/58df37cadd48c6619bbe022c72dae85c","symbol":"RDVT","publisher":"Yahoo","summary":"Key Insights Using the 2 Stage Free Cash Flow to Equity, Red Violet fair value estimate is US$23.29 Red Violet's...","url":"https://finance.yahoo.com/news/look-fair-value-red-violet-180443952.html"},{"category":"company","date":1715368960,"headline":"Red Violet Inc (RDVT) Reports Substantial Growth in Q1 2024 Earnings","id":127617745,"image":"https://s.yimg.com/ny/api/res/1.2/yC4Picqf42bAfmyJcPmEzQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD01Mzg-/https://media.zenfs.com/en/us.finance.gurufocus/2d0f325e91ca6ff82cf7366a9c76a580","symbol":"RDVT","publisher":"Yahoo","summary":"Record Revenue and Net Income Surge Highlight Strong Start to the Year","url":"https://finance.yahoo.com/news/red-violet-inc-rdvt-reports-192240950.html"},{"category":"company","date":1715263332,"headline":"Red Violet, Inc. (NASDAQ:RDVT) Q1 2024 Earnings Call Transcript","id":127596396,"image":"https://s.yimg.com/ny/api/res/1.2/Fw91JHdv9qXaNZZ4ES60mw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/e3eda975a4460f86f2d25e09efe0d064","symbol":"RDVT","publisher":"Yahoo","summary":"Red Violet, Inc. (NASDAQ:RDVT) Q1 2024 Earnings Call Transcript May 8, 2024 Red Violet, Inc. isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good day, ladies and gentlemen and welcome to Red Violet’s First Quarter 2024 Earnings Conference Call. At […]","url":"https://finance.yahoo.com/news/red-violet-inc-nasdaq-rdvt-140212519.html"},{"category":"company","date":1715256000,"headline":"red violet to Present at the B. Riley 24th Annual Institutional Investor Conference","id":127596397,"image":"https://s.yimg.com/ny/api/res/1.2/bVbGqHOVX38ADMa.Rns8vg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0yNDA-/https://media.zenfs.com/en/globenewswire.com/fcf0ec77ebf52baaf9963c58803967ef","symbol":"RDVT","publisher":"Yahoo","summary":"BOCA RATON, Fla., May 09, 2024 (GLOBE NEWSWIRE) -- Red Violet, Inc. (NASDAQ: RDVT), a leading analytics and information solutions provider, today announced that it will present at the B. Riley 24th Annual Institutional Investor Conference, which is being held May 22-23, 2024 at the Beverly Hilton Hotel in Beverly Hills, California. Derek Dubner, Chief Executive Officer, and Dan MacLachlan, Chief Financial Officer, are scheduled to participate in an analyst-led discussion on Wednesday, May 22, 20","url":"https://finance.yahoo.com/news/red-violet-present-b-riley-120000453.html"},{"category":"company","date":1715253840,"headline":"RDVT Crosses Above Key Moving Average Level","id":127588071,"image":"","symbol":"RDVT","publisher":"Market News Video","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3486808298"},{"category":"company","date":1715240670,"headline":"Red Violet Inc (RDVT) Q1 2024 Earnings Call Transcript Highlights: Impressive Growth and ...","id":127563614,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"RDVT","publisher":"Yahoo","summary":"Discover how Red Violet Inc achieved record revenues and expanded its customer base in the first quarter of 2024, marking a period of significant financial and operational achievements.","url":"https://finance.yahoo.com/news/red-violet-inc-rdvt-q1-074430794.html"}]}