{"id":4432,"company":{"country":"CH","currency":"CHF","exchange":"SWISS EXCHANGE","ipo":"2011-09-19","marketCap":31.767940521240234,"name":"Relief Therapeutics Holding SA","phone":"","outstanding":11.013826370239258,"symbol":"RLFTF","website":"https://relieftherapeutics.com/","industry":"Biotechnology"},"price":3.0275,"year":2024,"month":9,"day":11,"weekday":"Wednesday","title":"Corporate Governance Practices of Relief Therapeutics Holding SA","date":"2024-09-11","url":"/posts/2024/09/11/RLFTF","content":[{"section":"Board Composition","text":"Relief Therapeutics Holding SA has a well-defined board composition that consists of individuals with diverse backgrounds and expertise. The board is composed of a mix of executive and non-executive directors. The non-executive directors bring valuable external perspectives and play a crucial role in providing independent oversight of the company's operations. The board also includes members with relevant industry knowledge and experience, ensuring a comprehensive understanding of the pharmaceutical sector."},{"section":"Executive Compensation","text":"Relief Therapeutics Holding SA emphasizes fair and transparent executive compensation practices. The company's executive compensation program is designed to align the interests of executives with the long-term success of the company. It includes a combination of base salary, performance-based incentives, and stock option grants. The criteria for determining performance-based incentives are carefully established and linked to measurable goals and key performance indicators. This ensures that executives are rewarded based on their individual and company-wide performance."},{"section":"Committees","text":"Relief Therapeutics Holding SA has established several committees to strengthen its governance practices. These committees include the Audit Committee, Compensation Committee, and Nominating and Corporate Governance Committee. Each committee has a specific focus and responsibilities to ensure effective oversight and decision-making. The Audit Committee ensures the integrity of financial reporting, the Compensation Committee reviews and approves executive compensation, and the Nominating and Corporate Governance Committee oversees board composition and governance matters."},{"section":"Shareholder Engagement","text":"Relief Therapeutics Holding SA recognizes the importance of shareholder engagement and actively promotes communication with its shareholders. The company regularly updates its shareholders through annual general meetings, investor presentations, and regulatory filings. The board and management encourage shareholders to participate in the decision-making process and provide their input on key matters. This enables shareholders to have a voice in the company's governance and decision-making."},{"section":"Transparency and Disclosure","text":"Relief Therapeutics Holding SA maintains a strong commitment to transparency and disclosure. The company adheres to relevant regulations and guidelines concerning financial reporting and corporate governance. It provides timely and accurate information to shareholders, investors, and other stakeholders. Relief Therapeutics Holding SA publishes its financial statements, annual reports, and other disclosures to ensure transparency and enable stakeholders to make informed decisions."},{"section":"Ethical Practices","text":"Relief Therapeutics Holding SA places high importance on ethical practices and compliance. The company has a Code of Conduct that outlines the expected standards of behavior for its directors, executives, and employees. The Code of Conduct promotes integrity, honesty, and accountability in all business activities. Relief Therapeutics Holding SA also maintains an effective system for reporting and addressing ethical concerns or potential violations. This fosters a culture of ethics and strengthens the company's governance framework."},{"section":"Continual Improvement","text":"Relief Therapeutics Holding SA is committed to continual improvement of its corporate governance practices. The company regularly evaluates and updates its governance framework to align with evolving best practices and regulatory requirements. This ensures that Relief Therapeutics Holding SA maintains a robust governance structure that enhances its accountability, transparency, and overall performance."},{"section":"Conclusion","text":"Relief Therapeutics Holding SA demonstrates strong corporate governance practices in terms of board composition and executive compensation. Its well-defined board composition, fair executive compensation program, established committees, shareholder engagement efforts, transparency and disclosure practices, ethical standards, and commitment to continual improvement contribute to effective governance and stakeholder confidence."}],"tags":["CrossOver21","Long","Biotechnology"],"news":[{"category":"company","date":1725856658,"headline":"aTyr Pharma: Two 2025 Data Readouts Could Provide Inflection Point","id":129783035,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2154042612/image_2154042612.jpg?io=getty-c-w1536","symbol":"RLFTF","publisher":"SeekingAlpha","summary":"aTyr Pharma has been able to make significant progress developing its lead clinical drug for the treatment of patients with pulmonary sarcoidosis. See why ATYR stock is a Buy.","url":"https://seekingalpha.com/article/4719867-atyr-pharma-two-2025-data-readouts-could-provide-inflection-point"},{"category":"company","date":1725254400,"headline":"Relief Therapeutics Announces PKU GOLIKE Study Results Presentation at SSIEM 2024","id":129671932,"image":"https://media.zenfs.com/en/accesswire.ca/4a7a9660819f2e9e8e27af1df190d8a9","symbol":"RLFTF","publisher":"Yahoo","summary":"GENEVA, SWITZERLAND / ACCESSWIRE / September 2, 2024 /RELIEF THERAPEUTICS Holding SA (SIX:RLF)(OTCQB:RLFTF)(OTCQB:RLFTY) (Relief, or the Company), a biopharmaceutical company committed to delivering innovative treatment options for select specialty, ...","url":"https://finance.yahoo.com/news/relief-therapeutics-announces-pku-golike-052000426.html"},{"category":"company","date":1724995500,"headline":"Relief Therapeutics Reports Half-Year 2024 Financial Results and Provides Corporate Update","id":129629576,"image":"https://media.zenfs.com/en/accesswire.ca/4a7a9660819f2e9e8e27af1df190d8a9","symbol":"RLFTF","publisher":"Yahoo","summary":"RLF-TD011 investigator-initiated trial results for EB wound treatment anticipated in the coming weeks RLF-OD032 pilot PK study progresses with potential NDA filing by mid- to late 2025 Streamlined operations and CHF 15.1 million cash reserves expected ...","url":"https://finance.yahoo.com/news/relief-therapeutics-reports-half-2024-052500801.html"}]}