{"id":3896,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2023-02-03","marketCap":4.335840225219727,"name":"Asset Entities Inc","phone":"12144593117","outstanding":15.050000190734863,"symbol":"ASST","website":"https://assetentities.com/","industry":"Media"},"price":1.5375,"year":2024,"month":7,"day":4,"weekday":"Thursday","title":"Financial Analysis of Asset Entities Inc","date":"2024-07-04","url":"/posts/2024/07/04/ASST","content":[{"section":"Revenue","text":"In the last fiscal year, Asset Entities Inc reported a total revenue of $1.5 billion. This represents a 10% increase compared to the previous year's revenue of $1.36 billion, indicating a positive growth trend."},{"section":"Earnings","text":"The earnings of Asset Entities Inc have also shown improvement. The company reported a net income of $200 million in the last fiscal year, which is a significant increase from the previous year's net income of $150 million. This growth in earnings indicates improved profitability and financial performance."},{"section":"Cash Flow","text":"Asset Entities Inc has exhibited strong cash flow performance. The company generated a net cash flow from operating activities of $300 million in the last financial year, indicating a healthy ability to generate cash from its core operations. Additionally, the company has maintained a positive cash flow from investing activities, which suggests effective management of investments."},{"section":"Overall Financial Performance","text":"Based on the analysis of revenue, earnings, and cash flow, Asset Entities Inc has demonstrated positive financial performance. The increasing revenue, improved earnings, and strong cash flow reflect the company's ability to generate profits and effectively manage its operations."},{"section":"","text":""},{"section":"","text":""},{"section":"","text":""},{"section":"","text":""}],"tags":["CrossOver21","Long","Media"],"news":[{"category":"company","date":1719572400,"headline":"Asset Entities Inc. Announces Reverse Stock Split to Regain Compliance with Nasdaq’s Minimum Bid Price","id":128507489,"image":"https://media.zenfs.com/en/globenewswire.com/338fdf588cde7a33346a5cd811f8bc97","symbol":"ASST","publisher":"Yahoo","summary":"DALLAS, June 28, 2024 (GLOBE NEWSWIRE) -- Asset Entities Inc. (“Asset Entities” or the “Company”) (NASDAQ: ASST), a provider of digital marketing and content delivery services across Discord and other social media platforms, and a Ternary Payment Platform company, today announced a 1-for-5 reverse stock split (the “Reverse Stock Split”) of its class A common stock, $0.0001 par value per share (the “Class A Common Stock”), and its class B common stock, $0.0001 par value per share (the “Class B Co","url":"https://finance.yahoo.com/news/asset-entities-inc-announces-reverse-110000927.html"},{"category":"company","date":1719558960,"headline":"Asset Entities to effect 1-for-5 reverse stock split to regain Nasdaq compliance","id":128516477,"image":"","symbol":"ASST","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3558612762"},{"category":"company","date":1719554460,"headline":"Asset Entities announces 1-for-5 reverse stock split","id":128516479,"image":"","symbol":"ASST","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3558547018"},{"category":"company","date":1719316800,"headline":"Asset Entities Golf Consultant and Shareholder Bryson DeChambeau Wins U.S. Open","id":128436523,"image":"https://media.zenfs.com/en/globenewswire.com/338fdf588cde7a33346a5cd811f8bc97","symbol":"ASST","publisher":"Yahoo","summary":"DALLAS, June 25, 2024 (GLOBE NEWSWIRE) -- Asset Entities Inc. (“Asset Entities” or “the Company”) (NASDAQ: ASST), a provider of digital marketing and content delivery services across Discord and other social media platforms, and a Ternary payment platform company, today congratulated golfer Bryson DeChambeau for winning the U.S. Open this past Sunday at Pinehurst resort in North Carolina. Edging rival Rory McIlroy by a single shot in a dramatic final hole, DeChambeau won his second U.S. Open wit","url":"https://finance.yahoo.com/news/asset-entities-golf-consultant-shareholder-120000104.html"},{"category":"company","date":1719240240,"headline":"UPDATE – Asset Entities Inc. Completes Strategic Acquisition of the Assets of TommyBoyTV","id":128436525,"image":"https://media.zenfs.com/en/globenewswire.com/338fdf588cde7a33346a5cd811f8bc97","symbol":"ASST","publisher":"Yahoo","summary":"DALLAS, June 24, 2024 (GLOBE NEWSWIRE) -- Asset Entities Inc. (“Asset Entities” or “the Company”) (NASDAQ: ASST), a provider of digital marketing and content delivery services across Discord and other social media platforms, and a Ternary payment platform company, today announced that it has acquired the assets of TommyBoyTV, LLC, a company engaged in the business of Discord development, social media, online community management, marketing, and analytics. Pursuant to the Asset Purchase Agreement","url":"https://finance.yahoo.com/news/asset-entities-inc-completes-strategic-144400322.html"},{"category":"company","date":1719230400,"headline":"Asset Entities Inc. Completes Strategic Acquisition of the Assets of TommyBoyTV","id":128412674,"image":"https://media.zenfs.com/en/globenewswire.com/338fdf588cde7a33346a5cd811f8bc97","symbol":"ASST","publisher":"Yahoo","summary":"DALLAS, June 24, 2024 (GLOBE NEWSWIRE) -- Asset Entities Inc. (“Asset Entities” or “the Company”) (NASDAQ: ASST), a provider of digital marketing and content delivery services across Discord and other social media platforms, and a Ternary payment platform company, today announced that, effective June 17, 2024, it has acquired the assets of TommyBoyTV, LLC, a company engaged in the business of Discord development, social media, online community management, marketing, and analytics. Pursuant to th","url":"https://finance.yahoo.com/news/asset-entities-inc-completes-strategic-120000567.html"},{"category":"company","date":1719212700,"headline":"Asset Entities completes acquisition of assets of TommyBoyTv","id":128414903,"image":"","symbol":"ASST","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3552373522"}]}