{"id":3893,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"1992-10-22","marketCap":205.37863159179688,"name":"Consumer Portfolio Services Inc","phone":"19497536800","outstanding":21.020000457763672,"symbol":"CPSS","website":"https://www.consumerportfolio.com/","industry":"Financial Services"},"price":9.8,"year":2024,"month":7,"day":4,"weekday":"Thursday","title":"Historical Performance of Consumer Portfolio Services Inc Stock During Economic Recessions and Recoveries","date":"2024-07-04","url":"/posts/2024/07/04/CPSS","content":[{"section":"Overview of Consumer Portfolio Services Inc","text":"Consumer Portfolio Services Inc (CPS) is a specialty finance company that focuses on providing indirect automobile financing to individuals with past credit problems, low incomes, or limited credit histories. The company purchases retail installment sales contracts originated by dealers in connection with the sale of automobiles, trucks, and motorcycles. CPS operates primarily in the United States. It was founded in 1991 and is headquartered in Irvine, California."},{"section":"Performance During Economic Recessions","text":"During economic recessions, specialty finance companies like CPS tend to experience challenges due to higher defaults and delinquencies in their loan portfolios. The 2008 financial crisis, for example, had a significant impact on the stock price of CPS, as it did for many other financial institutions. The stock price of CPS declined sharply from its pre-recession peak in 2007, reaching a low point in early 2009. However, CPS managed to navigate through the recession and post-recession period, gradually recovering its stock price over time."},{"section":"Performance During Economic Recoveries","text":"During economic recoveries, specialty finance companies like CPS can benefit from improved credit conditions and increased lending opportunities. As the economy recovers, individuals may have better access to credit, leading to increased demand for automobile financing. This can positively impact the stock price of CPS. Additionally, as the overall financial industry improves, investor sentiment towards specialty finance companies tends to improve as well, further supporting the stock price."},{"section":"Conclusion","text":"Consumer Portfolio Services Inc (CPS) has shown a mixed performance during economic recessions and recoveries. The stock price tends to be negatively affected during recessions, reflecting the challenges faced by specialty finance companies in such periods. However, CPS has managed to recover from these downturns as economic conditions improve. It is important to note that the historical performance of CPS stock during economic recessions and recoveries may not necessarily predict its future performance, as numerous factors can influence stock prices and overall market conditions."}],"tags":["CrossOver21","Long","Financial Services"],"news":[{"category":"company","date":1719455220,"headline":"Consumer Portfolio Services close $436.31M senior subordinate asset-backed securitization","id":128486080,"image":"","symbol":"CPSS","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3556802134"},{"category":"company","date":1719437880,"headline":"CPS Announces $436.31 Million Senior Subordinate Asset-Backed Securitization","id":128476822,"image":"https://media.zenfs.com/en/globenewswire.com/6e83f761499fdd830c3c375218d91793","symbol":"CPSS","publisher":"Yahoo","summary":"LAS VEGAS, Nevada, June 26, 2024 (GLOBE NEWSWIRE) -- Consumer Portfolio Services, Inc. (Nasdaq: CPSS) (“CPS” or the “Company”) announced the closing of its third term securitization in 2024 on Wednesday June 26, 2024. The transaction is CPS's 52nd senior subordinate securitization since the beginning of 2011 and the 35th consecutive securitization to receive a triple “A” rating from at least two rating agencies on the senior class of notes. In the transaction, qualified institutional buyers purc","url":"https://finance.yahoo.com/news/cps-announces-436-31-million-213800529.html"},{"category":"company","date":1718985848,"headline":"Consumer Portfolio Services : Q1 2024 Investor Presentation","id":128379413,"image":"","symbol":"CPSS","publisher":"Finnhub","summary":"TheSubprime Source Since 1991 March 2024 Investor Presentation SAFE HARBOR...","url":"https://finnhub.io/api/news?id=03e66920bb4c580f1521b12a31246c45932f6b5bfb4f0ce050af5e91568bed0f"},{"category":"company","date":1718943120,"headline":"Consumer Portfolio Services: New Financial Insights Presentation Released","id":128392657,"image":"","symbol":"CPSS","publisher":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3549899889"}]}