{"id":1742,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2019-02-08","marketCap":219.95,"name":"Harpoon Therapeutics Inc","phone":"16504437400.0","outstanding":16.83,"symbol":"HARP","website":"https://www.harpoontx.com/","industry":"Biotechnology"},"price":9.007525,"year":2023,"month":12,"day":13,"weekday":"Wednesday","title":"Sentiment Analysis of Analysts and Financial Experts towards Harpoon Therapeutics Inc Stock","date":"2023-12-13","url":"/posts/2023/12/13/HARP","content":[{"section":"Positive Sentiment","text":"Several analysts and financial experts have expressed positive sentiments towards Harpoon Therapeutics Inc stock. They believe that the company has a strong pipeline of innovative cancer therapies and a solid growth potential. Furthermore, they appreciate the progress made by the company in advancing its investigational drugs and the positive clinical trial results. Some analysts highlight the potential market opportunity for Harpoon's treatments and expect the stock to perform well in the future."},{"section":"Price Target Upgrades","text":"Multiple analysts have raised their price targets for Harpoon Therapeutics Inc stock. These price target upgrades reflect the increased confidence in the company's prospects and the projected growth of its business. The higher price targets indicate a belief that the stock price will continue to rise in the coming months."},{"section":"Positive Recommendations","text":"Many analysts and financial experts recommend buying or holding Harpoon Therapeutics Inc stock. They believe that the company is well-positioned to capitalize on the growing demand for cancer therapies and has the potential to deliver significant returns to investors. The positive recommendations are based on the company's progress, strong management team, and promising drug candidates."},{"section":"Neutral Sentiment","text":"A few analysts maintain a neutral stance on Harpoon Therapeutics Inc stock. They acknowledge the company's potential but prefer to wait for further developments or additional data before providing a definitive recommendation. These analysts are cautious due to the inherent risks associated with biopharmaceutical companies and the volatility of the market."},{"section":"Summary","text":"Overall, analysts and financial experts have a generally positive sentiment towards Harpoon Therapeutics Inc stock. They believe that the company has a promising pipeline, positive clinical trial results, and a strong potential for growth. The price target upgrades and positive recommendations signify a favorable outlook for the stock. However, some analysts remain neutral, exercising caution until further developments are observed."}],"tags":["CrossOver100","Long","Biotechnology"],"news":[{"category":"company","date":1702389720,"headline":"Zacks Industry Outlook Highlights Aurinia Pharmaceuticals, Alpine Immune Sciences, Lyra Therapeutics, Harpoon Therapeutics and Journey Medical","id":124458989,"image":"https://media.zenfs.com/en/zacks.com/96776645e0ac7ab203b7d5e3b37251a6","symbol":"HARP","publisher":"Yahoo","summary":"Aurinia Pharmaceuticals, Alpine Immune Sciences, Lyra Therapeutics, Harpoon Therapeutics and Journey Medical are part of the Zacks Industry Outlook article.","url":"https://finance.yahoo.com/news/zacks-industry-outlook-highlights-aurinia-140200552.html"},{"category":"company","date":1702343700,"headline":"Harpoon Therapeutics Presents HPN217 Phase 1 Clinical Data in Relapsed/Refractory Multiple Myeloma (RRMM) at ASH 2023 and Announces Selection of Recommended Phase 2 Dose (RP2D)","id":124451460,"image":"https://media.zenfs.com/en/globenewswire.com/f61e3d004ea5c31a0e60da8140665214","symbol":"HARP","publisher":"Yahoo","summary":"• HPN217 was well tolerated and demonstrated robust and durable clinical activity at doses ranging from 2.15 to 24 mg in heavily pre-treated patients, including patients with prior exposure to BCMA-targeted therapy • At the 12 mg dose, cohorts demonstrated favorable activity and safety profile:- 63% ORR; with 53% VGPR or better -- CRS reported in 16% of patients, no Grade 3 events, no ICANS - • Findings support further clinical development at the 12 mg RP2D SOUTH SAN FRANCISCO, Calif., Dec. 11,","url":"https://finance.yahoo.com/news/harpoon-therapeutics-presents-hpn217-phase-011500561.html"},{"category":"company","date":1702309020,"headline":"5 Small Drug Stocks to Buy on Hopes of Better Prospects in the New Year","id":124439906,"image":"https://media.zenfs.com/en/zacks.com/3ecb7b8f4826ee26a884371aa5efe958","symbol":"HARP","publisher":"Yahoo","summary":"Innovation is expected to continue driving growth in the Medical-Drugs industry. DERM, LYRA, AUPH, ALPN and HARP may prove to be good additions to one's portfolio.","url":"https://finance.yahoo.com/news/5-small-drug-stocks-buy-153700610.html"},{"category":"company","date":1702306506,"headline":"Should You Buy Harpoon Therapeutics, Inc. (HARP) After Golden Cross?","id":124451464,"image":"https://media.zenfs.com/en/zacks.com/b95cfdd8768bc3c4620e666dbcb0b248","symbol":"HARP","publisher":"Yahoo","summary":"Good things could be on the horizon when a stock experiences a golden cross event. How should investors react?","url":"https://finance.yahoo.com/news/buy-harpoon-therapeutics-inc-harp-145506491.html"},{"category":"company","date":1702279260,"headline":"Harpoon Therapeutics presents HPN217 Phase 1 data in RRMM","id":124467708,"image":"","symbol":"HARP","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3252366291"},{"category":"company","date":1702036800,"headline":"Harpoon Ventures Raises $125 Million for Early-Stage Startups","id":124385449,"image":"https://s.yimg.com/ny/api/res/1.2/r3u6P42rtASgzTqPaRPByw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0xMjA5/https://media.zenfs.com/en/bloomberg_technology_68/9509c1966d4d797c19c71b3ccf8f58ea","symbol":"HARP","publisher":"Yahoo","summary":"(Bloomberg) -- Harpoon Ventures, whose investors include Andreessen Horowitz veteran Peter Levine and former Olympic swimmer Michael Phelps, has raised a $125 million fund to back early-stage startups.Most Read from BloombergCarlyle’s Rubenstein Is in Talks to Acquire Baltimore OriolesElon Musk's SpaceX Valued at $175 Billion or More in Tender OfferHunter Biden Indicted in Tax Case as White House Woes MountHarvard, Penn Heads Walk Back Genocide Answers After BacklashWall Street’s AI Craze Drives","url":"https://finance.yahoo.com/news/harpoon-ventures-raises-125-million-120000664.html"},{"category":"company","date":1702006560,"headline":"Harpoon Therapeutics files to sell 25.75M common shares for holders","id":124401326,"image":"","symbol":"HARP","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3248379692"},{"category":"company","date":1702005780,"headline":"Harpoon Therapeutics files to sell 25.75M shares of common stock for holders","id":124401327,"image":"","symbol":"HARP","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3248362112"},{"category":"company","date":1701880380,"headline":"ImmunoGen (IMGN) Gets FDA Priority Review for Elahere sBLA","id":124336435,"image":"https://media.zenfs.com/en/zacks.com/7813b4a575be05490cc210e943a2c6f1","symbol":"HARP","publisher":"Yahoo","summary":"The FDA grants priority review to ImmunoGen's (IMGN) sBLA to convert the accelerated approval for Elahere to full approval for treating platinum-resistant ovarian cancer. A decision is due on Apr 5, 2024.","url":"https://finance.yahoo.com/news/immunogen-imgn-gets-fda-priority-163300919.html"},{"category":"company","date":1701795605,"headline":"Harpoon Therapeutics, Inc. (HARP) Upgraded to Strong Buy: What Does It Mean for the Stock?","id":124322666,"image":"https://media.zenfs.com/en/zacks.com/d2f7ed3d1940141716bfd200f5c94c6b","symbol":"HARP","publisher":"Yahoo","summary":"Harpoon Therapeutics, Inc. (HARP) has been upgraded to a Zacks Rank #1 (Strong Buy), reflecting growing optimism about the company's earnings prospects. This might drive the stock higher in the near term.","url":"https://finance.yahoo.com/news/harpoon-therapeutics-inc-harp-upgraded-170005216.html"},{"category":"company","date":1701788400,"headline":"Best Momentum Stock to Buy for December 5th","id":124309893,"image":"https://media.zenfs.com/en/zacks.com/78e9ba6f7a6a9d76f520140004476ac4","symbol":"HARP","publisher":"Yahoo","summary":"PDD, HARP and LEU made it to the Zacks Rank #1 (Strong Buy) momentum stocks list on December 5, 2023.","url":"https://finance.yahoo.com/news/best-momentum-stock-buy-december-150000117.html"},{"category":"company","date":1701360420,"headline":"Is it a Good Idea to Invest in Harpoon (HARP) Stock Now?","id":124202423,"image":"https://media.zenfs.com/en/zacks.com/56586accb2cfbfcf1006d1af204b20f8","symbol":"HARP","publisher":"Yahoo","summary":"Here, we discuss some reasons why investing in Harpoon Therapeutics (HARP) stock now may turn out to be a prudent move.","url":"https://finance.yahoo.com/news/good-idea-invest-harpoon-harp-160700100.html"},{"category":"company","date":1701356114,"headline":"Wall Street Analysts Believe Harpoon Therapeutics, Inc. (HARP) Could Rally 40.5%: Here's is How to Trade","id":124211540,"image":"https://media.zenfs.com/en/zacks.com/8442d24e11d454aa89061259a9714d43","symbol":"HARP","publisher":"Yahoo","summary":"The consensus price target hints at a 40.5% upside potential for Harpoon Therapeutics, Inc. (HARP). While empirical research shows that this sought-after metric is hardly effective, an upward trend in earnings estimate revisions could mean that the stock will witness an upside in the near term.","url":"https://finance.yahoo.com/news/wall-street-analysts-believe-harpoon-145514273.html"}]}