{"id":4055,"company":{"country":"US","currency":"USD","exchange":"NEW YORK STOCK EXCHANGE, INC.","ipo":"1989-07-05","marketCap":227.587,"name":"Tredegar Corp","phone":"18043301000","outstanding":34.41,"symbol":"TG","website":"https://tredegar.com/","industry":"Metals \u0026 Mining"},"price":5.8025,"year":2024,"month":7,"day":24,"weekday":"Wednesday","title":"Historical Revenue Growth Trends of Tredegar Corp","date":"2024-07-24","url":"/posts/2024/07/24/TG","content":[{"section":"2009-2013: Declining Revenue","text":"From 2009 to 2013, Tredegar Corp experienced a period of declining revenue. The company's revenue decreased from $896 million in 2009 to $803 million in 2013. This decline could be attributed to factors such as a weak global economy and decreased demand for Tredegar's products."},{"section":"2014-2016: Rapid Revenue Growth","text":"In contrast, from 2014 to 2016, Tredegar Corp saw rapid revenue growth. The company's revenue increased from $803 million in 2014 to $926 million in 2016. This growth can be attributed to successful product launches, expansion into new markets, and improved market conditions."},{"section":"2017-2019: Fluctuating Revenue","text":"The subsequent years, from 2017 to 2019, showed fluctuating revenue for Tredegar Corp. The company's revenue decreased slightly from $926 million in 2017 to $902 million in 2019. These fluctuations were affected by various factors, including changes in customer demand, pricing pressures, and market competition."},{"section":"2020: Revenue Decline","text":"In 2020, Tredegar Corp experienced a significant decline in revenue due to the COVID-19 pandemic. The company's revenue dropped to $799 million, marking a decrease from the previous year. This decline was primarily driven by disruptions in global supply chains, decreased consumer spending, and lower demand for Tredegar's products in certain industries."},{"section":"Implications for Investors","text":"The historical revenue growth trends of Tredegar Corp indicate that the company's performance can be influenced by various external factors. Investors should carefully consider these trends and evaluate the company's ability to adapt to changing market conditions. The periods of rapid revenue growth demonstrate Tredegar's potential for success, while the periods of decline and fluctuation highlight the risks associated with investing in the company. Additionally, the impact of the COVID-19 pandemic on Tredegar's revenue emphasizes the importance of monitoring global events and their potential effects on the company's financial performance."}],"tags":["CrossOver21","Long","Metals \u0026 Mining"],"news":[{"category":"company","date":1721255134,"headline":"Tredegar Corporation (TG): Is It the Best Small-Cap Stock to Buy Now?","id":128743286,"image":"https://s.yimg.com/ny/api/res/1.2/0dj.Vy3quTUsOpuoINA5lQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/630096208801d2f2cf9f41485f6c312e","symbol":"TG","publisher":"Yahoo","summary":"We recently compiled a list of the 10 Best Small-Cap Stocks to Buy Now According to Minerva Advisors. In this article, we are going to take a look at where Tredegar Corporation (NYSE:TG) stands against the other small-cap stocks. Established in the fourth quarter of 2002, Minerva Advisors, based in Pennsylvania, is an activist hedge […]","url":"https://finance.yahoo.com/news/tredegar-corporation-tg-best-small-222534720.html"},{"category":"company","date":1720728900,"headline":"Bonnell Aluminum Commenting on Proclamation to Strengthen the Rules to Qualify for Trade Benefits Between the U.S. and Mexico","id":128670535,"image":"https://s.yimg.com/ny/api/res/1.2/ow3OtNfZ3AEcW.e.pXSnkQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0zMjg-/https://media.zenfs.com/en/business-wire.com/ea700486ceba2819980d99bcd1705f2b","symbol":"TG","publisher":"Yahoo","summary":"NEWNAN, Ga., July 11, 2024--Bonnell Aluminum Commenting on Proclamation to Strengthen the Rules to Qualify for Trade Benefits Between the U.S. and Mexico","url":"https://finance.yahoo.com/news/bonnell-aluminum-commenting-proclamation-strengthen-201500601.html"}]}