{"id":2310,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"1994-03-15","marketCap":113.647,"name":"NN Inc","phone":"19802644300.0","outstanding":47.02,"symbol":"NNBR","website":"https://www.nninc.com/","industry":"Machinery"},"price":3.0279,"year":2023,"month":12,"day":16,"weekday":"Saturday","title":"Corporate Governance Practices of NN Inc","date":"2023-12-16","url":"/posts/2023/12/16/NNBR","content":[{"section":"Board Composition","text":"NN Inc's board consists of highly qualified individuals with diverse backgrounds and expertise. The board includes both internal and independent directors, ensuring a balance between management and independent oversight. The independent directors bring independent judgment and objectivity to board decision-making."},{"section":"Executive Compensation","text":"NN Inc follows a responsible approach to executive compensation, aligning it with the company's overall performance and shareholder interests. The compensation committee oversees the executive compensation program and regularly reviews its effectiveness. The program includes a mix of fixed and variable components, such as base salary, annual incentives, and long-term equity-based incentives."},{"section":"Board Committees","text":"NN Inc has established various board committees to enhance governance and oversight. These committees include the Audit Committee, Compensation Committee, Nominating and Governance Committee, and Strategic Planning Committee. Each committee has a clear charter and operates independently to fulfill its responsibilities and provide valuable guidance to the board."},{"section":"Shareholder Rights","text":"NN Inc recognizes the importance of protecting shareholder rights and ensuring transparent communication. The company holds regular shareholder meetings where investors can voice their concerns and ask questions. Shareholders are provided with comprehensive information about the company's financial performance and future plans, enabling informed investment decisions."},{"section":"Ethics and Compliance","text":"NN Inc maintains a strong commitment to ethics and compliance. The company has established a code of conduct that outlines expected standards of behavior for all employees and directors. Additionally, NN Inc has implemented robust compliance programs to prevent and detect any potential violations of laws or regulations."},{"section":"Risk Management","text":"NN Inc has a well-defined risk management framework in place to identify, assess, and mitigate various risks. The board regularly reviews and monitors the company's risk profile and ensures appropriate risk controls are implemented. The risk management process enables the board to make informed decisions and take necessary actions to protect the company's long-term interests."},{"section":"Stakeholder Engagement","text":"NN Inc values its stakeholders and actively engages with them to understand their perspectives and concerns. The company maintains open lines of communication with investors, employees, customers, and other key stakeholders, seeking feedback and addressing their queries. This engagement helps NN Inc build trust and maintain strong relationships with its stakeholders."},{"section":"Conclusion","text":"NN Inc demonstrates a strong commitment to corporate governance, with a well-composed board, responsible executive compensation practices, and comprehensive oversight mechanisms. The company's focus on ethics, compliance, and stakeholder engagement further enhances its governance practices."}],"tags":["CrossOver100","Long","Machinery"],"news":[{"category":"company","date":1701777900,"headline":"Aeries Technology, NN, Spirit Airlines among industrial movers","id":124315030,"image":"","symbol":"NNBR","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3242499063"},{"category":"company","date":1701747180,"headline":"12 Industrials Stocks Moving In Tuesday's After-Market Session","id":124316669,"image":"","symbol":"NNBR","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3242805518"},{"category":"company","date":1701741180,"headline":"NN, Inc. Director Gautam buys 50K shares of company stock","id":124344735,"image":"","symbol":"NNBR","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3242654091"}]}