{"id":2283,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"1994-11-22","marketCap":348.049,"name":"West Bancorporation Inc","phone":"15152222309","outstanding":16.73,"symbol":"WTBA","website":"https://www.westbankstrong.com/investor_relations","industry":"Banking"},"price":20.985,"year":2023,"month":12,"day":16,"weekday":"Saturday","title":"Historical Revenue Growth Trends of West Bancorporation Inc","date":"2023-12-16","url":"/posts/2023/12/16/WTBA","content":[{"section":"Introduction","text":"West Bancorporation Inc is a financial holding company that operates through its subsidiary, West Bank. It provides commercial banking services, including loans, deposits, and trust services. Analyzing the historical revenue growth of West Bancorporation Inc can provide valuable insights for investors."},{"section":"Revenue Growth Data","text":"Year 2016: $93.4 million\nYear 2017: $97.6 million\nYear 2018: $106.8 million\nYear 2019: $114.2 million\nYear 2020: $122.5 million"},{"section":"Revenue Growth Trends","text":"Over the analyzed period, West Bancorporation Inc has exhibited consistent revenue growth. The company's revenue increased from $93.4 million in 2016 to $122.5 million in 2020, representing a compound annual growth rate (CAGR) of approximately 6.79%."},{"section":"Implications for Investors","text":"The steady revenue growth of West Bancorporation Inc indicates the company's ability to generate increasing profits over time. This growth may attract investors looking for a reliable and growing source of income. Furthermore, the consistent revenue growth suggests effective business strategies and successful execution by the management team, enhancing investor confidence."},{"section":"Conclusion","text":"West Bancorporation Inc has shown consistent revenue growth over the analyzed period, indicating its strength in the commercial banking industry. Investors may find this growth trend appealing for potentially gaining from the company's positive financial performance."}],"tags":["CrossOver55","Long","Banking"],"news":null}