{"id":2954,"company":{"country":"IL","currency":"ILS","exchange":"TEL AVIV STOCK EXCHANGE","ipo":"2007-07-26","marketCap":307.159912109375,"name":"InterCure Ltd","phone":"972774605012","outstanding":45.57270050048828,"symbol":"INCR","website":"https://www.intercure.co/","industry":"Pharmaceuticals"},"price":1.834275,"year":2024,"month":2,"day":23,"weekday":"Friday","title":"InterCure Ltd stock market capitalization and valuation metrics compared to industry benchmarks","date":"2024-02-23","url":"/posts/2024/02/23/INCR","content":[{"section":"Market Capitalization","text":"InterCure Ltd's market capitalization is calculated by multiplying the current share price by the total number of outstanding shares. Comparing it to industry benchmarks can provide insights into the company's relative size and worth within the industry."},{"section":"Valuation Metrics","text":"Valuation metrics help investors determine the fair value of a company's stock. Some common valuation ratios used in the industry include Price-to-Earnings (P/E) ratio, Price-to-Sales (P/S) ratio, Price-to-Book (P/B) ratio, and Enterprise Value-to-EBITDA (EV/EBITDA) ratio."},{"section":"P/E Ratio","text":"The Price-to-Earnings (P/E) ratio is calculated by dividing the current stock price by the company's earnings per share (EPS). Comparing InterCure Ltd's P/E ratio to industry benchmarks can indicate if the stock is overvalued or undervalued."},{"section":"P/S Ratio","text":"The Price-to-Sales (P/S) ratio is calculated by dividing the current stock price by the company's revenue per share. Comparing InterCure Ltd's P/S ratio to industry benchmarks can provide insights into the company's valuation relative to its revenue generation."},{"section":"P/B Ratio","text":"The Price-to-Book (P/B) ratio is calculated by dividing the current stock price by the company's book value per share. Comparing InterCure Ltd's P/B ratio to industry benchmarks can help investors assess the company's valuation based on its net assets."},{"section":"EV/EBITDA Ratio","text":"The Enterprise Value-to-EBITDA (EV/EBITDA) ratio is calculated by dividing the company's enterprise value by its earnings before interest, taxes, depreciation, and amortization (EBITDA). Comparing InterCure Ltd's EV/EBITDA ratio to industry benchmarks can provide insights into its valuation in relation to its operating performance."},{"section":"","text":""},{"section":"","text":""}],"tags":["CrossOver21","Long","Pharmaceuticals"],"news":[{"category":"company","date":1707860760,"headline":"InterCure Provides an Update Regarding Nir Oz Facility","id":125846021,"image":"https://media.zenfs.com/en/globenewswire.com/3f50b8ca0061c8583d2a39ca33f97791","symbol":"INCR","publisher":"Yahoo","summary":"NEW YORK, and HERZLIYA, Israel, Feb. 13, 2024 (GLOBE NEWSWIRE) -- InterCure Ltd. (NASDAQ: INCR) (TASE: INCR) (dba Canndoc) (\"InterCure\" or the \"Company\"), the leading medical cannabis company in Israel and outside of North America, reports today that, further to the Company’s press release issued on October 17, 2023, in which the Company provided an update regarding the status of the security situation in Israel, and its impact on the Company and its employees, the Company is providing an additi","url":"https://finance.yahoo.com/news/intercure-provides-regarding-nir-oz-214600837.html"},{"category":"company","date":1707796620,"headline":"InterCure provides update regarding its Nir Oz facility","id":125876565,"image":"","symbol":"INCR","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3348116474"},{"category":"company","date":1707796260,"headline":"InterCure provides update on Nir Oz facility in Israel","id":125876566,"image":"","symbol":"INCR","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3348108313"}]}