{"id":1749,"company":{"country":"US","currency":"USD","exchange":"NEW YORK STOCK EXCHANGE, INC.","ipo":"2012-09-20","marketCap":1366.2,"name":"National Bank Holdings Corp","phone":"13038928715","outstanding":37.76,"symbol":"NBHC","website":"https://nationalbankholdings.com","industry":"Banking"},"price":35.99,"year":2023,"month":12,"day":13,"weekday":"Wednesday","title":"Ownership Structure of National Bank Holdings Corp","date":"2023-12-13","url":"/posts/2023/12/13/NBHC","content":[{"section":"Institutional Ownership","text":"As of the latest available data, institutional investors own approximately 86.5% of National Bank Holdings Corp stock. This suggests that the majority of the company's shares are held by institutional investors such as mutual funds, pension funds, and other financial institutions."},{"section":"Insider Ownership","text":"Insiders, including company executives, directors, and employees, hold about 2.3% of National Bank Holdings Corp stock. Insider ownership indicates the proportion of shares owned by individuals within the company. It can provide insights into the alignment of interests between insiders and shareholders."},{"section":"Major Shareholders","text":"Among the major shareholders of National Bank Holdings Corp are:"},{"section":"1. The Vanguard Group, Inc.","text":"The Vanguard Group, Inc. is the largest institutional shareholder, owning approximately 13.5% of the company's outstanding shares."},{"section":"2. BlackRock, Inc.","text":"BlackRock, Inc. is another significant institutional shareholder, holding around 9.8% of the stock."},{"section":"3. Dimensional Fund Advisors LP","text":"Dimensional Fund Advisors LP owns approximately 7.6% of National Bank Holdings Corp shares."},{"section":"4. Wellington Management Company, LLP","text":"Wellington Management Company, LLP holds around 5.9% of the company's outstanding shares."},{"section":"5. Renaissance Technologies LLC","text":"Renaissance Technologies LLC is another major shareholder, owning approximately 4.2% of the stock."}],"tags":["CrossOver100","Long","Banking"],"news":[{"category":"company","date":1702260540,"headline":"National Bank Holdings (NBHC) Passes Through 3% Yield Mark","id":124461297,"image":"","symbol":"NBHC","publisher":"Dividend Channel","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3251855606"}]}