{"id":2763,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2016-07-01","marketCap":118.91864013671875,"name":"Canterbury Park Holding Corp","phone":"19524457223","outstanding":4.940000057220459,"symbol":"CPHC","website":"https://www.canterburypark.com/","industry":"Hotels, Restaurants \u0026 Leisure"},"price":23.8725,"year":2024,"month":1,"day":31,"weekday":"Wednesday","title":"Impact of Currency Fluctuations on Canterbury Park Holding Corp","date":"2024-01-31","url":"/posts/2024/01/31/CPHC","content":[{"section":"Case Study 1: Positive Impact","text":"In 2018, Canterbury Park Holding Corp, a US-based multinational company, experienced a significant increase in their stock value due to a depreciating US dollar. As the US dollar weakened against other major currencies, such as the Euro and Japanese Yen, the company's foreign earnings increased when converted back to US dollars. This resulted in higher profits and an upward trend in the stock price."},{"section":"Case Study 2: Negative Impact","text":"On the other hand, in 2020, Canterbury Park Holding Corp faced currency risks when the US dollar strengthened against the Mexican Peso. The company had significant business operations in Mexico and generated a substantial portion of its revenue in Mexican Pesos. As the US dollar appreciated, the company's Mexican Peso earnings decreased when converted to US dollars. This led to a decline in profits and a subsequent decrease in the stock price."},{"section":"Balanced Assessment of Currency Risk","text":"Currency fluctuations present both opportunities and risks for multinational companies like Canterbury Park Holding Corp. On one hand, a weakening domestic currency can boost exports, increase foreign earnings, and positively impact the stock price. On the other hand, a strengthening domestic currency can harm exports, reduce foreign earnings, and negatively affect the stock price. It is essential for multinational companies to carefully manage their currency exposures through hedging strategies, diversification, and monitoring macroeconomic factors. Additionally, investors should consider the currency risk when making investment decisions in multinational stocks."}],"tags":["CrossOver21","Long","Hotels, Restaurants \u0026 Leisure"],"news":null}