{"id":4340,"company":{"country":"AU","currency":"USD","exchange":"ASX - ALL MARKETS","ipo":"1985-04-09","marketCap":391.057,"name":"Opthea Ltd","phone":"61398260399","outstanding":662.809,"symbol":"OPT","website":"https://opthea.com/","industry":"Biotechnology"},"price":2.942225,"year":2024,"month":8,"day":28,"weekday":"Wednesday","title":"Impact of currency fluctuations on Opthea Ltd multinational stock","date":"2024-08-28","url":"/posts/2024/08/28/OPT","content":[{"section":"Case Study 1: Positive Impact","text":"In 2019, Opthea Ltd, an Australian biotechnology company, had significant revenue from international markets, primarily in the United States and Europe. The Australian dollar (AUD) weakened against major currencies during this period. As a result, when Opthea converted its overseas revenue back to AUD, it received more Australian dollars. This currency fluctuation resulted in higher reported earnings for the company, which had a positive impact on its multinational stock price."},{"section":"Case Study 2: Negative Impact","text":"In 2020, Opthea faced a situation where the Australian dollar (AUD) strengthened against major currencies, particularly the US dollar. As a result, when Opthea converted its overseas revenue back to AUD, it received fewer Australian dollars. This currency fluctuation led to lower reported earnings for the company, negatively impacting its multinational stock price."},{"section":"Balanced Assessment of Currency Risk","text":"Currency fluctuations present both opportunities and risks for Opthea Ltd's multinational stock. On one hand, a weaker Australian dollar can boost the company's reported earnings and stock price. On the other hand, a stronger Australian dollar can lead to lower reported earnings and stock price. Therefore, it is essential for Opthea to carefully manage its currency risk, using hedging strategies to mitigate potential negative impacts. Overall, currency fluctuations are a significant factor that investors and Opthea need to consider when assessing the performance of its multinational stock."}],"tags":["CrossOver21","Long","Biotechnology"],"news":null}