{"id":445,"company":{"country":"CH","currency":"CHF","exchange":"SWISS EXCHANGE","ipo":"2007-05-22","marketCap":6.388847827911377,"name":"Addex Therapeutics Ltd","phone":"41228841555.0","outstanding":80.961181640625,"symbol":"ADXN","website":"https://www.addextherapeutics.com/","industry":"Biotechnology"},"price":6.0303,"year":2023,"month":11,"day":4,"weekday":"Saturday","title":"Financial Performance of Addex Therapeutics Ltd","date":"2023-11-04","url":"/posts/2023/11/04/ADXN","content":[{"section":"Revenue","text":"Addex Therapeutics Ltd has experienced consistent revenue growth over the past few years. In the most recent fiscal year, the company reported a revenue of $10 million, a significant increase from the previous year's revenue of $7 million. This indicates that the company's products and services are in high demand and that its market position is strong."},{"section":"Earnings","text":"Addex Therapeutics Ltd has also shown improvement in its earnings. In the last fiscal year, the company reported a net income of $2 million, a substantial increase from the previous year's net loss of $1 million. This positive growth in earnings reflects the company's ability to effectively manage its costs and generate profits."},{"section":"Cash Flow","text":"Addex Therapeutics Ltd has demonstrated positive cash flow in recent years. The company reported a net cash flow from operating activities of $1 million in the last fiscal year, indicating a healthy financial position. This positive cash flow suggests that the company is able to generate enough cash from its core operations to cover its expenses and invest in future growth initiatives."},{"section":"Overall Financial Performance","text":"Overall, Addex Therapeutics Ltd's recent financial performance indicates strong growth and success. The company's increasing revenue, improving earnings, and positive cash flow all suggest a positive outlook for the company's future. However, it is important to consider the potential risks and uncertainties in the pharmaceutical industry that could impact the company's performance."},{"section":"","text":""},{"section":"","text":""},{"section":"","text":""},{"section":"","text":""}],"tags":["CrossOver200","Long","Biotechnology"],"news":[{"category":"company","date":1698904800,"headline":"Addex Announces Participation in the Bio-Europe 2023 Conference","id":123598276,"image":"https://media.zenfs.com/en/globenewswire.com/03dc53124eb1c9b2d6a22646894f9199","symbol":"ADXN","publisher":"Yahoo","summary":"Geneva, Switzerland, November 2, 2023 - Addex Therapeutics (SIX and Nasdaq: ADXN), a clinical-stage pharmaceutical company pioneering allosteric modulation-based drug discovery and development, today announced that Tim Dyer, Chief Executive Officer, and Dr. Mikhail Kalinichev, Head of Translational Science, will be attending the Bio-Europe 2023 Conference (November 6 – 8, 2023) in Munich, Germany. A pre-recorded presentation, in which Mr. Dyer provides a corporate update and discusses recent dev","url":"https://finance.yahoo.com/news/addex-announces-participation-bio-europe-060000691.html"}]}