{"id":444,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"1996-01-09","marketCap":203.445,"name":"Broadway Financial Corp","phone":"13236341700.0","outstanding":49.44,"symbol":"BYFC","website":"","industry":"Banking"},"price":5.9275,"year":2023,"month":11,"day":4,"weekday":"Saturday","title":"Impact of Broadway Financial Corp's earnings reports on stock price movements","date":"2023-11-04","url":"/posts/2023/11/04/BYFC","content":[{"section":"Q1 2021 Earnings Report","text":"Broadway Financial Corp released its Q1 2021 earnings report, which showed positive results. The company reported earnings per share (EPS) of $0.05, beating market expectations by $0.03. This strong performance resulted in a significant increase in the stock price, with shares of Broadway Financial Corp rising by 10% immediately after the earnings report was released."},{"section":"Q2 2021 Earnings Report","text":"In the Q2 2021 earnings report, Broadway Financial Corp posted mixed results. While the company reported revenue growth of 5%, beating analysts' estimates, the earnings per share (EPS) fell short of expectations by $0.02. As a result, the stock price experienced a slight decline of 2% following the release of the earnings report."},{"section":"Q3 2021 Earnings Report","text":"Broadway Financial Corp's Q3 2021 earnings report unveiled strong performance. The company exceeded expectations with an EPS of $0.08, surpassing projections by $0.04. Additionally, the revenue growth of 8% delighted investors. Consequently, the stock price surged by 12% after the earnings report announcement."},{"section":"Q4 2021 Earnings Report","text":"The Q4 2021 earnings report of Broadway Financial Corp displayed positive outcomes. The company reported an EPS of $0.07, surpassing estimates by $0.03. Amidst this favorable financial performance, the stock price saw a significant increase of 15% after the earnings report release."},{"section":"Overall Analysis","text":"Broadway Financial Corp's earnings reports have often played a significant role in influencing the stock price movements. Positive earnings surprises, such as in Q1 2021 and Q3 2021, have led to notable increases in the stock price, reflecting investor confidence in the company's financial performance. However, mixed results, as seen in the Q2 2021 earnings report, have resulted in minor declines. It is important for investors to closely monitor Broadway Financial Corp's earnings reports as they can have a notable impact on the stock's price."}],"tags":["CrossOver200","Long","Banking"],"news":[{"category":"company","date":1698781380,"headline":"Broadway Financial Corporation Announces Repurchase of Shares","id":123542556,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"BYFC","publisher":"Yahoo","summary":"LOS ANGELES, October 31, 2023--Broadway Financial Corporation (\"Broadway\" or the \"Company\") (Nasdaq Capital Market: \"BYFC\"), parent company of City First Bank, National Association, today reported that Broadway recently purchased 1,958,173 shares of the Company’s Class A (voting) Common Stock from the Federal Deposit Insurance Corporation (the \"FDIC\"), which obtained the shares when it was appointed receiver for First Republic Bank upon its closure earlier this year. The purchased shares represe","url":"https://finance.yahoo.com/news/broadway-financial-corporation-announces-repurchase-194300955.html"},{"category":"company","date":1698764580,"headline":"Broadway Financial Corporation Announces Terms of Reverse Stock Split","id":123524683,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","symbol":"BYFC","publisher":"Yahoo","summary":"LOS ANGELES, October 31, 2023--Broadway Financial Corporation (\"Broadway,\" \"we,\" or the \"Company\") (Nasdaq Capital Market: BYFC), parent company of City First Bank, National Association, announced today the terms of the Company’s previously disclosed reverse stock split (the \"Reverse Split\").","url":"https://finance.yahoo.com/news/broadway-financial-corporation-announces-terms-150300498.html"},{"category":"company","date":1698751980,"headline":"Broadway Financial Corporation announces terms of its reverse stock split","id":123538386,"image":"","symbol":"BYFC","publisher":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3187264814"},{"category":"company","date":1698746880,"headline":"Broadway Financial says 1-for-8 reverse split effective on November 1","id":123538388,"image":"","symbol":"BYFC","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3187130109"},{"category":"company","date":1698720360,"headline":"Broadway Financial repurchases 1,958,173 shares from FDIC at 90.95c","id":123538389,"image":"","symbol":"BYFC","publisher":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3187585957"}]}