{"id":1140,"company":{"country":"US","currency":"USD","exchange":"NASDAQ NMS - GLOBAL MARKET","ipo":"2017-11-02","marketCap":351.914306640625,"name":"Funko Inc","phone":"14257833616.0","outstanding":51.79999923706055,"symbol":"FNKO","website":"https://investor.funko.com","industry":"Leisure Products"},"price":6.7525,"year":2023,"month":11,"day":22,"weekday":"Wednesday","title":"Historical Performance of Funko Inc Stock during Economic Recessions and Recoveries","date":"2023-11-22","url":"/posts/2023/11/22/FNKO","content":[{"section":"Introduction","text":"Funko Inc is a pop culture collectible company that designs, manufactures, and sells licensed pop culture products. As a publicly traded company, its stock performance is influenced by various economic factors, including recessions and recoveries. Understanding how the stock has performed during these periods can provide insights into its historical resilience and profitability."},{"section":"Economic Recessions","text":"During economic recessions, consumer spending tends to decline, which can impact companies in the retail sector, including Funko Inc. Analyzing the historical performance of Funko Inc stock during recessions can reveal any patterns or trends."},{"section":"1. Great Recession (2007-2009)","text":"The Great Recession, triggered by the subprime mortgage crisis, had a significant impact on global financial markets. Funko Inc went public in 2017, so it does not have a stock performance history during this recession. However, it is important to note that the broader market experienced a significant decline during the recession, with many companies suffering substantial losses. Therefore, it can be inferred that Funko Inc would have likely faced challenges during this period."},{"section":"2. COVID-19 Pandemic (2020)","text":"The COVID-19 pandemic had a profound effect on global economies, causing a recession in many countries. Funko Inc's stock performance during this period can provide insights into its ability to navigate unprecedented challenges. Funko Inc saw a decline in its stock price during the initial stages of the pandemic, reflecting investors' concerns about the impact of lockdowns and restrictions on consumer spending. However, as people adapted to the 'new normal,' the company experienced a recovery, with its stock price gradually increasing to pre-pandemic levels."},{"section":"Economic Recoveries","text":"During economic recoveries, consumer confidence and spending tend to improve, benefiting companies like Funko Inc. Evaluating the historical performance of Funko Inc stock during recoveries can help identify its potential for growth and profitability."},{"section":"1. Post-Great Recession (2010-2013)","text":"Funko Inc's stock performance during the immediate years following the Great Recession is not available as the company went public in 2017. However, many companies experienced a gradual recovery during this period as the economy stabilized. The overall positive market sentiment likely contributed to the growth of the company once it entered the public market."},{"section":"2. Post-COVID Economic Recovery","text":"As the global economy recovers from the COVID-19 pandemic, Funko Inc's stock performance will depend on various factors, including consumer behavior, market trends, and company-specific strategies. It is essential to monitor the market conditions and financial indicators to assess the company's potential for growth and recovery."},{"section":"Conclusion","text":"Analyzing the historical performance of Funko Inc stock during economic recessions and recoveries provides a perspective on its resilience and adaptability. While the company does not have a long historical performance record, its ability to recover from the initial impact of the COVID-19 pandemic demonstrates its potential for growth and recovery in the future."}],"tags":["CrossOver100","Long","Leisure Products"],"news":[{"category":"company","date":1700538179,"headline":"Funko Reports Slightly Better Q3 Results, Stock Price Likely To Drop More (Ratings Downgrade)","id":124012823,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1186319362/image_1186319362.jpg?io=getty-c-w1536","symbol":"FNKO","publisher":"SeekingAlpha","summary":"Funko has been rightsizing its business operations and inventory stock to improve profits and net income. See why I'm downgrading FNKO stock from Hold to Sell.","url":"https://seekingalpha.com/article/4653324-funko-q3-earnings-better-stock-price-likely-drop-more-rating-downgrade"},{"category":"company","date":1700451360,"headline":"12 Consumer Discretionary Stocks Moving In Monday's After-Market Session","id":124007027,"image":"","symbol":"FNKO","publisher":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://www.zacks.com/research/get_news.php?id=3221532433"},{"category":"company","date":1700151004,"headline":"FUNKO : LAUNCHES UPDATED COLLECTION VALUATION FEATURE IN APP, BASED ON EBAY MARKETPLACE DATA","id":123931309,"image":"","symbol":"FNKO","publisher":"Finnhub","summary":"View All News FUNKO LAUNCHES UPDATED COLLECTION VALUATION FEATURE IN APP, BASED ON EBAY MARKETPLACE DATA November 16, 2023 ...","url":"https://finnhub.io/"}]}